[{"id": "87c3f2c8-ecc2-445a-9a1f-97f94d323f4c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32651/", "date": "2024-08-18 18:41", "message": "After almost a whole month of silence, the Shiite militias in Iraq are once again taking responsibility for attacking a target in Israeli territory.\nAccording to them, last week they attacked a target in the Golan using an unmanned aerial vehicle."}, {"id": "b625ea98-2850-40f1-a718-98a649353574", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32650/", "date": "2024-08-18 18:40", "message": "The President of Russia, Putin, landed for a two-day visit to Azerbaijan."}, {"id": "a9c5a034-3ced-4a8f-b247-9fe3b25cd9d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32649/", "date": "2024-08-18 18:40", "message": "Map of the progress of Ukrainian forces in the Kursk region inside the territory of Russia.\nThe area in blue is expanding compared to the map from the 13th of the month 👆.\n\nThe map was created by an Arab research institute that deals with conflicts in the Middle East and around the world."}, {"id": "2a788fd9-3583-4173-88e0-e22864f14560", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32648/", "date": "2024-08-18 18:13", "message": "The official Palestinian news agency reports that the Palestinian leadership has begun to promote on a global level the topic of the visit of PA Chairman Abu Mazen to the Gaza Strip.\nNegotiations on the issue have begun with the United Nations, with the members of the United Nations Security Council, with the European Union, with the countries of the African Union, with Arab countries and with Western countries. Israel was also updated according to the report..."}, {"id": "35ad5094-ce2a-4a2f-9946-6ef8b42f37d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32647/", "date": "2024-08-18 18:08", "message": "What will Blinken say now that he flew so many hours from the US to Israel..."}, {"id": "dcca1ea3-5274-4f5f-9ddd-d6965d49ba26", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32646/", "date": "2024-08-18 18:07", "message": "Hamas rejects the new US proposal in the negotiations\n\nA short time ago, the Hamas movement publishes an official announcement in which it states that the new proposal (which was proposed by the US, according to the statement of President Biden - AA) meets Netanyahu's conditions, especially regarding his refusal to a permanent ceasefire, refusal to a total withdrawal and insistence on controlling the Netzerim axis, the Philadelphi axis and the Rafah crossing. This is in addition to setting new conditions regarding the exchange of prisoners and withdrawing from other areas - something that prevents reaching a deal.\n\nWe place full responsibility on Netanyahu for the failure of the mediators' efforts and the failure to reach a deal.\n\nWe are committed to the proposal we agreed to on July 2, based on Biden's proposal and the UN Security Council resolution.\n\n##\nHamas states that it does not accept Biden's new proposal."}, {"id": "c583e74f-3208-4041-b22d-a84b56bff79f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32645/", "date": "2024-08-18 17:51", "message": "Palestinian channels report that this evening, after an evacuation alert, the IDF also attacked the upper floors of the Nouri building in Nuseirat in the center of the Gaza Strip."}, {"id": "922cffb1-5eae-4d99-b345-ea0284011e02", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32644/", "date": "2024-08-18 17:50", "message": "The IDF attacked the Zakat building in Nuseirat this evening after an evacuation alert (knock on the roof).\nThe upper floors of the building were attacked.\nDespite the evacuation notice, unofficial Palestinian channels reported one dead and ten wounded in this attack."}, {"id": "6faf7344-58a3-469a-8ef0-62de592d96a0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32643/", "date": "2024-08-18 17:48", "message": "Jenin: the distribution of sweets following the attack in Kdumim in which an Israeli security guard was murdered."}, {"id": "8772106c-cddb-4864-8ccc-21563bc4ec64", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32642/", "date": "2024-08-18 17:48", "message": "The Israeli who was attacked with a hammer in the disturbing attack in Samaria has been pronounced dead."}, {"id": "b59df33b-3d8e-4696-8cc6-0d69b5031df8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32641/", "date": "2024-08-18 16:00", "message": "Reuters: The US Secretary of State Blinken has landed in Tel Aviv."}, {"id": "2e477a59-2e2e-475d-9ddd-972db013528e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32640/", "date": "2024-08-18 16:00", "message": "Rafih: Before the operation and now, courtesy of Ben Tzion Macales.\nThe change in the Philadelphi axis area is especially noticeable."}, {"id": "bc104ee6-f98d-41f4-a24f-d50a6ea4723c", "channel_id": 1560386984, "url": "", "date": "2024-08-18 15:59", "message": "More matches between the German police and the anti-Israel demonstrators in Berlin."}, {"id": "769d8381-9853-424c-bceb-fbfb2a4f09df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32637/", "date": "2024-08-18 15:57", "message": "Berlin: The German police are forced to deal with the kaffiyehs...\n\nUnclear if its an ippon or waza-ari, but the headlock finished off the match..."}, {"id": "5c61c3ce-60d1-404e-bb69-031e1f2fd27a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32636/", "date": "2024-08-18 14:42", "message": "Hezbollah announces a death in the ranks of the Lebanese resistance battalions:\n\nFadi Kanaan\n\nHe was killed in an IDF attack earlier today on a motorcycle in the village of Sheba in southern Lebanon.\n\nThe Lebanese resistance brigades are an arm 100 percent subordinate to Hezbollah, receiving aid, training, equipment and... orders from the organization.\nWhat sets them apart is the fact that most of their operatives do not belong to the Shia community, but are loyal to the way of the Hezbollah organization (which is all Shia)."}, {"id": "160996de-c4f2-4528-9dd9-c494d481a7b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32635/", "date": "2024-08-18 14:18", "message": "A decrease in the number of anti-tank missiles launched by Hezbollah\n\nAn examination of Hezbollah's announcements since May shows a consistent decrease in the number of anti-tank launches for which Hezbollah has claimed responsibility:\n\nMay - 5 launches\nJune - 4 launches\nJuly - 3 launches\nAugust - no launches as of August 18\n\n##\nIt can be assumed that the eliminations carried out by the IDF in southern Lebanon harm Hezbollah's skilled manpower from the anti-tank system required for this type of launch, which reduces the number of launches."}, {"id": "8fcc20c7-50dd-4f9a-bf8f-fb27ccb71cd3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32634/", "date": "2024-08-18 14:07", "message": "Prime Minister of Lebanon: Algeria has decided to supply Lebanon with fuel immediately to help it overcome the electricity production crisis."}, {"id": "5bcf55fd-0dce-401a-a634-aaf2bcc3e89b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32633/", "date": "2024-08-18 12:43", "message": "Gazan journalists report that the presence of Israeli tanks in the area of ​​the water tower west of the Hamad neighborhood in Khan Yunis is very troubling for Gazans and many have decided to evacuate the area because of this."}, {"id": "41817be8-4abe-4f5c-a9ea-b1d4533f956f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32632/", "date": "2024-08-18 12:42", "message": "Gazan Crocs.\nThe \"Displaced\" model."}, {"id": "56fa96d8-2328-4532-b0b3-34eb39a5fbbd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32631/", "date": "2024-08-18 12:41", "message": "UNIFIL spokesperson:\n3 of our soldiers were slightly injured as a result of an explosion that occurred near their vehicle in southern Lebanon.\nThey returned to their base safely.\n\n##\nThe UNIFIL spokesperson did not associate the injury with an Israeli attack but notes that there was an explosion near the UNIFIL vehicle.\nA few months ago, in a similar event, the IDF spokesman reported that a Hezbollah mine was what caused damage to a UNIFIL patrol."}, {"id": "42aface6-15d7-4030-a493-6d1bf5ab4730", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32630/", "date": "2024-08-18 10:23", "message": "Deir al-Balah Municipality:\n\nFollowing the latest evacuation instructions, the occupation reduced the humanitarian area and caused that Deir al-Balah now has about a million displaced people.\nThe humanitarian area was reduced from 30 square kilometers to 20 square kilometers.\nThe number of displaced people in Deir al-Balah reached an unprecedented number, which made Deir al-Balah the area where the most displaced persons were absorbed in world history in relation to the area of ​​Deir al-Balah.\nThe last evacuation reduced the drinking water supply capacity by 60% (there were water wells in the area required to evacuate - AA).\nThe great density and the garbage in the streets of Deir al-Balakh are a breeding ground for the spread of epidemics."}, {"id": "fefce037-d13d-4bbb-9783-05b350ad9e4b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32629/", "date": "2024-08-18 10:13", "message": "A video documenting the tanks in the area of ​​the water tower west of the Hamad neighborhood and their proximity to the displaced persons' tents in Khan Yunis."}, {"id": "392948c1-81c5-427f-bfbb-599c0db266cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32628/", "date": "2024-08-18 10:03", "message": "Lebanese channels report that a UNIFIL soldier from the Ghana battalion was injured in an IDF attack in Dhayra in southern Lebanon."}, {"id": "e88ac009-d6ee-4ed0-ad64-1208ca7bd852", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32627/", "date": "2024-08-18 09:58", "message": "Palestinian channels: These are coins that were in the pocket of a Gazan who went to buy food for his family in Abasan (east of Khan Yunis) and was killed in an attack."}, {"id": "eabe3847-f94b-4f93-a72a-0fd76e1502c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32626/", "date": "2024-08-18 09:57", "message": "Civil Defense in Gaza:\nTen thousand \"martyrs\" are under the ruins of the buildings in the Gaza Strip.\nNo trace remains of 1760 bodies of martyrs due to Israel's use of prohibited weapons according to the international convention.\n2210 bodies disappeared from the graves in Gaza.\nThe residents of the Gaza Strip are forced to make do with 11% of the territory of the Gaza Strip due to the encirclement of the occupation army."}, {"id": "4de04d5a-535b-49f2-9548-1b58316c5818", "channel_id": 1560386984, "url": "", "date": "2024-08-18 08:25", "message": "The location of the tanks, near the water tower, in the picture above 👆 is marked with a blue circle here on the map."}, {"id": "984fb2ab-9c7f-4e2a-bec4-f257affcd448", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73498/", "date": "2024-08-18 08:23", "message": "Follower A adds:\n\nThese are water towers that Israel built while we were in Gush Katif, near the main road of Gush Katif, just before the square that led to the settlements of Katif and Netzer Hazani."}, {"id": "690ebec9-e3f9-4864-8655-e4984334b4a7", "channel_id": 1560386984, "url": "", "date": "2024-08-18 08:22", "message": "Additional Palestinian sources indicate that the tanks in the photo 👆 are on a dominating hill located about 300 meters west of the Hamad neighborhood (al-Khauz area - the water tower - and al-Jamil area) and they are covering for the other forces operating in the area."}, {"id": "8429a674-b763-4f3e-ad4a-f756053e15b9", "channel_id": 1560386984, "url": "", "date": "2024-08-18 08:19", "message": "Unofficial Lebanese sources: one killed in the motorcycle attack in the Sheba area in southern Lebanon."}, {"id": "7efaa605-c0a7-4586-a642-193098be3133", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73491/", "date": "2024-08-18 07:50", "message": "The Palestinians report 22 deaths in the morning hours in four attacks in the Strip:\n\n4 dead and 6 wounded in the attack on the home of the Misbah family in Abasan in the east of Khan Yunis.\n\n7 killed in the attack on the house of the Hossein al-Attar family on al-Mazara Street in Deir Al-Balah in the center of the Gaza Strip.\n\n4 dead and 19 injured in an attack on a house on al Huja Street in the Jabaliya refugee camp in the northern Gaza Strip.\n\n7 killed in the attack on the house of the el Yazji family on el-Ashrin Street in the Nuseirat refugee camp in the center of the Gaza Strip."}, {"id": "b240bd22-d440-4485-878c-9fd2692cbb35", "channel_id": 1560386984, "url": "", "date": "2024-08-18 07:48", "message": "Lebanese sources: An Israeli UAV attacked a motorcycle a short time ago in the area of ​​the village of Sheba in southern Lebanon. The motorcyclist was injured."}, {"id": "6dcfb6b3-b96e-4845-9869-524c422abb87", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73494/", "date": "2024-08-18 07:46", "message": "Palestinian documentation of tanks that are already west of the Hamad neighborhood in Khan Yunis."}, {"id": "44b3f6b5-f3ef-4950-bf96-4362f94fe7c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73494/", "date": "2024-08-18 07:46", "message": "The advance of IDF maneuvering forces in Khan Yunis\n\nThe Palestinians report the movement of IDF tanks and vehicles west towards the Hamad neighborhood in northern Khan Yunis (marked with a red circle).\nFollowing the advance of the forces, Gazans staying in the Azada Park area (marked with a red pin) began to quickly evacuate the area (even though the IDF did not require them to evacuate)."}, {"id": "344f554a-fb66-41fd-b0ce-a22c3c3f85bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73494/", "date": "2024-08-18 06:53", "message": "Last night the IDF spokesman announced the fall of a soldier from the Logistics Corps in a battle in the center of the Gaza Strip.\n\nMay his memory be a blessing."}, {"id": "344130bb-c003-4562-9422-504efb8c7256", "channel_id": 1560386984, "url": "", "date": "2024-08-18 06:52", "message": "Bloggers involved in tracking vessel movements claim: within a few days, close to a third of the US naval force will be in the Middle East region."}, {"id": "2da60da0-86d0-4d4c-afb5-373f5d5cdf43", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73491/", "date": "2024-08-18 06:48", "message": "Senior Hamas official Osama Hamdan on the ceasefire negotiations:\n\nWhat the Americans are proposing does not include a withdrawal from the Strip or a ceasefire.\n\nUntil now we are only negotiating the criteria and not yet the list of prisoners to be released.\n\nThe ceasefire must be guaranteed within the framework of clear criteria.\n\n##\nIt is interesting to see that he admits that Hamas is still negotiating, even though it has publicly stated that it is not..."}, {"id": "7b15f781-aac9-4172-b166-5d01f6dfbeee", "channel_id": 1560386984, "url": "", "date": "2024-08-18 06:48", "message": "Palestinian channels report that the IDF forces operating in the early morning in the Balata refugee camp in Nablus removed the fabric awnings installed above the market alleys (to hide terrorists' movement from the eyes of the IDF drones), then set them on fire."}, {"id": "6448345e-6c5c-4cd2-b7cf-87397ea0f6fa", "channel_id": 1560386984, "url": "", "date": "2024-08-18 06:47", "message": "The elimination last night in Jenin\n\nThe military wing of Hamas confirms that two of its senior officers were killed last night in the drone attack in Jenin:\n\nRafet Dawasi\nAhmed Abu Ara\n\nAccording to an official announcement published by the branch, the two are responsible for the planning and execution of a number of recent attacks, the three most prominent of which were:\n\n1. The bomb attack in Jenin on June 27 in which Captain Alon Sakagio fell and another 16 soldiers were injured.\n\n2. Ambush close to the perimeter fence in the village of Matla (Jenin) on July 23.\n\n3. The attack at Mehola Junction in the Jordan Valley in which Jonathan Deutsch was murdered and another civilian was injured on August 11.\n\n##\nAs you can see in the photos, contrary to custom, a funeral will be held for the two terrorists with their faces covered, after their bodies were charred...\n\nThe form of elimination and the charred state of their bodies contribute to the strengthening of Israeli deterrence in the West Bank."}, {"id": "01c0d0c2-4d1d-41b4-95f2-8c65a18d0054", "channel_id": 1560386984, "url": "", "date": "2024-08-18 05:56", "message": "Joint IDF and ISA announcement:\n\nThe ISA and IDF eliminated two senior Hamas terrorists in Jenin who were involved in planning the shooting attack in the Jordan Valley, during which Yonatan Deutsch was murdered\n\nIn a joint IDF and ISA operation, an aircraft struck a vehicle in Jenin and eliminated two senior Hamas terrorists.\n \nThe terrorist Ahmed Abu Ara from Aqabah was involved in further terrorist attacks and was a senior operative in the production of explosives for terror attacks.\nAdditionally, the terrorist Rafet Dawasi from Silat al-Harithiya was a senior in the Hamas military infrastructure of the Jenin area. \n\nDuring the ISA investigation on Yassin Ghanem, who was arrested by the ISA and IDF, it was revealed that the two terrorists were involved in the terror attack on the 11th of August 2024 in the Jordan Valley, during which Yonatan Deutsch was murdered.\n\n##\nIt is interesting to see that the name of who \"snitched\" - Ghanem - was published. Perhaps there are other intentions in this disclosure."}, {"id": "1a755018-c997-43c4-9b47-983ec3da2ae7", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73489/", "date": "2024-08-18 05:51", "message": "The moment of the attack on the terrorists' vehicle last night in Jenin by an Israeli aircraft."}, {"id": "b673e553-d668-452a-8a42-ef9cc9a8371a", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73485/", "date": "2024-08-18 05:51", "message": "The exchange of fire between the operatives of the security apparatus of the Palestinian Authority and between armed men near the hospital in Jenin last night."}, {"id": "8adc021e-9576-49e8-b2ab-1ab50a68d8ca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32603/", "date": "2024-08-18 05:50", "message": "Gaza sources: One of the bombs dropped yesterday on the towers in the Hamad neighborhood in Khan Yunis did not explode."}]