[{"id": "8344b5f6-9bb9-4245-b204-50e31bd928ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31644/", "date": "2024-08-02 14:14", "message": "IDF: Following the sirens that sounded a short while ago in southern Israel, one projectile crossed from the southern Gaza Strip and fell in an open area.\n\n##\nOne for Haniyeh, for the record, hours after he was buried (perhaps half the rocket was for Mohammad Deif?)"}, {"id": "96e93d57-f324-4a0b-9c31-29319403506f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31643/", "date": "2024-08-02 14:11", "message": "Haniyeh's fresh grave -\nInsisted on premium gravel (:"}, {"id": "e0c106dc-b5c3-4b71-a240-95b8b6f5c175", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31642/", "date": "2024-08-02 12:57", "message": "Haniyeh's grave in the cemetery in Lusail, Qatar."}, {"id": "f2940176-5bcd-4fce-9bec-508b296b3380", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31641/", "date": "2024-08-02 11:39", "message": "Spokesman of the Office of the Supreme Leader of Iran:\nThe necessary steps were taken to avenge Haniyeh's assassination. This will come to fruition (in the future)."}, {"id": "ae53d30c-105e-4877-bdf1-3a40af3dc771", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31638/", "date": "2024-08-02 11:12", "message": "East Jerusalem: Ekrima Sa'id Sabri, Al-Aqsa's inciting preacher eulogizes Ismail Haniyeh as part of the Friday prayer - today on the Temple Mount.\n\nThe صلاة الغائب \"Prayer of the Absent One\" was also held in Haniyeh's honor."}, {"id": "9742bdd7-0812-4678-896e-6c1be020e259", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31637/", "date": "2024-08-02 11:06", "message": "The municipality of Tehran decided to name one of the streets in the Iranian capital after Ismail Haniyeh."}, {"id": "03a7fcae-b980-49c7-aa6b-7788fa22c689", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31634/", "date": "2024-08-02 10:22", "message": "The Palestinians report that Nael al-Sakhl, a prisoner from Nablus who served a life sentence and was deported to Gaza as part of the Shalit deal, was killed in an IDF attack this morning in Gaza City.\n\nNael's father died inside the PA headquarters in Jnaid prison in Nablus in 2013 - Ismail Haniyeh called then to console...\nNael took an active part in the promotion of terrorism from within the Gaza Strip and, as can be seen in the attached photo, participated in the marches of return in the Gaza Strip on the border with Israel in previous years."}, {"id": "fb223db5-f66b-4c5c-8774-e5744b923eb3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31633/", "date": "2024-08-02 10:18", "message": "The funeral ceremony of Haniyeh and his bodyguard in Qatar:\nKhalil al-Hayya, Yahya Sinwar's deputy on the microphone.\nBehind him, Ziyad al-Nakhalah, seecretary general of the Islamic Jihad, and Zaher Jabarin, senior leader in Hamas and responsible for their activity in the West Bank- both arrived on a flight from Tehran.\nAt the edge of the photo on the right - Abd Salam Haniyeh, Ismael Haniyeh's son and chairman of the Palestinian Sports Association of Gaza - who lives a comfortable life in Qatar (he left the Strip shortly before October 7)."}, {"id": "9b357d97-a35e-4eef-84a2-1875adae6b62", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72311/", "date": "2024-08-02 10:12", "message": "The flag was lowered to half-mast across Turkey to mourn Haniyeh's death.\nThe same is true at the Turkish Embassy in Tel Aviv."}, {"id": "30e6770b-740a-44c0-9b90-b952514ed858", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31629/", "date": "2024-08-02 09:52", "message": "The Palestinians were a little less entertained: \"The Zionist soldiers are destroying the clinics in Gaza\""}, {"id": "f9cf8655-76c6-498f-8036-46b4c2d5c0aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31628/", "date": "2024-08-02 09:33", "message": "Doha, Qatar: The crowds are preparing for the funeral of Ismail Haniyeh.\n44 degrees in the shade."}, {"id": "bc166eb6-f655-42ea-b4e3-8b2a710c1471", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31624/", "date": "2024-08-02 06:41", "message": "The company Meta removed posts published by the Prime Minister of Malaysia mourning Haniyeh's death.\n\nYou can help Meta with enforcement by reporting every post that praises Haniyeh or expresses sorrow for his death."}, {"id": "1be6fa06-40b0-4b14-ab2b-3c5c88a94f98", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31622/", "date": "2024-08-02 06:38", "message": "Doha, Qatar: Haniyeh's wife praises him over his coffin placed in their luxury home.\nShe wishes him that Allah will make his path easier in the future... \"You are my beloved in this world and my beloved in the next.\"\n\nNo tears were observed on his wife... He passed away...\nWho will inherit Haniyeh's billions? 😉"}, {"id": "9efc120d-e77b-44f6-8b1f-ed1a81508ee1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31621/", "date": "2024-08-02 06:31", "message": "Hamas-affiliated channels are keeping tabs on who condemned the killing of Haniyeh among Arab countries and who did not.\n\nAccording to the data provided, 4 Arab countries did not condemn the elimination of Haniyeh:\nUnited Arab Emirates\nBahrain\nMauritania\nMorocco"}, {"id": "82599aa7-4b48-4cfa-a11b-f03baf14a0d4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31620/", "date": "2024-08-02 06:25", "message": "The White House on the Netanyahu-Biden conversation last night:\n\nThe two discussed the activity of deploying American military defense for the defense of Israel in the face of threats.\n\nPresident Biden expressed his commitment to Israel's security against all Iranian threats.\n\nThe two discussed American support for Israel's defense against UAVs and ballistic missiles.\n\nBiden emphasized to Netanyahu the importance of reducing tensions in the region.\n\nVice President Harris participated in the conversation."}, {"id": "8fa1e7ae-f588-4ccb-9a4a-1017d3f85e4b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31618/", "date": "2024-08-02 06:24", "message": "Hamas is trying to leverage the assassination of Haniyeh to wake up the sleepy Arab street and bring it out to demonstrate\n\nHamas calls for a \"صلاة الغائب\" in honor of Ismail Haniyeh - a special funeral prayer held for a dead person who is not in his city (\"prayer of the absent\"). Hamas is calling for it to be held today in all mosques (in all countries), today after the Friday prayer and after that to go to extensive \"Day of Rage\" demonstrations.\n\nAlso, Hamas calls for tomorrow to observe the \"World Day for Gaza\" that Haniyeh announced last week before his elimination.\n\nHamas wants to fill the streets all over the world with green Hamas flags.\nWe will wait to see if there will be a response."}, {"id": "2842dbfd-353f-4c02-9b47-ae300ac42444", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31617/", "date": "2024-08-02 06:21", "message": "Turkey: The Ministry of Communications blocks Instagram after deleting millions of posts mourning Ismail Haniyeh.\n\n##\nErdogan was insulted on behalf of his friend..."}, {"id": "37c20136-dc71-4a02-acd8-79fff784fd29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31616/", "date": "2024-08-02 06:15", "message": "Further to this 👆\n\nThe Iranian news agency Fars claims that based on a preliminary investigation, it can be determined that Haniyeh was killed by a missile fired at the place where he was staying.\nFars does not specify whether it is a surface-to-air missile or whether it is a different missile, which means that Fars denies the bomb theory published yesterday by the New York Times and leaves the questions of \"where was the missile fired from and what missile was it?\" - open."}, {"id": "94673f25-65a1-41f2-940a-f72c88f917fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31615/", "date": "2024-08-02 06:13", "message": "Further to this 👆\nHezbollah accepts responsibility for activating its air defense systems against air force planes in southern Lebanon tonight."}]