[{"id": "9fe3bdda-2f4f-45a2-a781-d226421d168e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28741/", "date": "2024-06-10 20:42", "message": "Another point that is important to raise at this stage is \"the day after\" - precisely the Americans, who invented the concept of \"the day after\" do not include this weighty issue in the \"Biden initiative\".\nI have already written to you several times that Hamas seeks through the deal and through the abductees to reach its main goal: to ensure the continuation of its rule in the Strip.\nThe kidnapped are the means at their disposal for this purpose.\nThe Americans do not address this issue in their proposal and apparently if the agreement enters the second phase which includes a permanent ceasefire, Hamas can maintain its rule in the Strip...\n\nOnly the exile of Hamas and its disarmament can lead to a permanent ceasefire. This matter must not be avoided. Israel needs to reiterate this again and again."}, {"id": "dc60b2a2-db94-4a88-bb5f-d639dfe2e91a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28740/", "date": "2024-06-10 20:41", "message": "The business is a bit tricky and confusing (I think on purpose because the Americans are trying to create a ceasefire under a smokescreen).\nThe American representative at the UN stated that Israel agreed to the proposal and that the first phase of the ceasefire is for six weeks. Such a ceasefire will last as long as the negotiations continue and if the parties reach the second phase of the agreement then the ceasefire will become permanent.\nIn other words, there is a possibility here that if the negotiations do not continue to the implemention of the second phase of the proposal, then apparently Israel can return to fighting - something that Hamas does not agree to (and therefore did not say that it accepts the proposal, but is willing to enter into negotiations based on the principles).\nAnd again we return to the basic issue:\nIsrael wants to resume fighting after the first phase of the deal and Hamas wants a complete ceasefire.\nWill the American smokescreen and pressure succeed in making one of the parties \"confused\" and give up the very clear principle it demands?\nHamas wants a complete cessation of fighting. Israel wants to continue - that's the whole story."}, {"id": "0f343c0f-8f40-48f3-815f-be5eef092f94", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28739/", "date": "2024-06-10 20:39", "message": "Hamas in an official announcement following the approval of the proposal by the UN Security Council:\n\nWe welcome the content included in the proposal with regard to a permanent ceasefire, a complete withdrawal of the forces from the Strip, prisoner exchanges, rehabilitation, the return of the displaced, opposition to demographic change or the reduction of the territory of the Strip and the introduction of the necessary aid to the residents of the Strip.\nWe are ready to cooperate with the mediators to enter into indirect negotiations for the implementation of these principles in a way that will be consistent with the demands of our people."}, {"id": "d5900bae-f6aa-4e72-bb82-61121c2f02ef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28738/", "date": "2024-06-10 20:38", "message": "The vote in the UN Security Council on the Biden initiative for a ceasefire in Gaza and the release of the abductees:\n14 in favor. Russia abstained.\nThe proposal was approved."}, {"id": "7c37544a-1d9f-471d-b0ae-e464f9a5d84e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28737/", "date": "2024-06-10 19:10", "message": "The hostage rescue operation - dramatic footage from the helmet cameras of Israeli special forces\n\nThe attached footage, courtesy of the Israeli police spokesperson, shows IDF and Shin Bet fighters raiding the compound where three of the hostages were held. \n\nIt includes the dramatic moment Israeli forces reached the hostages, while fighting and eliminating terrorists in the area."}, {"id": "f51a5a7d-80a8-494a-aa7c-c31a0c382885", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28735/", "date": "2024-06-10 17:50", "message": "IDF Spokesperson: “The first is on board, second, and third are with us”; footage from the underbelly of the helicopter, from the rescue of Shlomi Ziv, Andrey Kozlov, and Almog Meir Jan from the Gaza Strip"}, {"id": "6e789d90-cdb1-486c-b0b6-e6be707fc609", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28734/", "date": "2024-06-10 17:47", "message": "A Gazan turns to Yahya Sinwar with sadness due to the large number of dead in Nuseirat following the operation to rescue the abductees:\n\nYou, Sinwar, go and hide four Israeli prisoners in the heart of a densely populated area like Nuseirat... and you know that you are facing an enemy who knows no mercy and commits genocide on us... It was logical (on your part) to think that he would massacre us in order to save his prisoners...\n\n220 martyrs and 400 wounded... we are not just numbers... we are not your victims. We have become pretty tired. Enough... those who speak like me are said to be a collaborator... that they are not in favor of the homeland... to hell with the homeland... what do you understand by the homeland? This is not the way...\n\nWe sacrificed our children, our homes... we ran away... the \"Tufan\" (\"storm\" and also the name chosen by Hamas for the war) is now in Rafah... and it will reach Deir al-Balah (in the center of the Gaza Strip) and then... where will we go?"}, {"id": "49be74b3-e5de-4213-9c59-6d6db6ba545f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28733/", "date": "2024-06-10 17:45", "message": "Palestinians rallying against the United Arab Emirates because of \"Cafe Bibi\"\n\nPalestinians on social media are accusing the United Arab Emirates of treason after watching a video that was published in the last day and was filmed in Dubai at a place called \"Cafe Bibi\".\n\nThe videographer notes that the place is called \"Cafe Bibi\" in light of Netanyahu's efforts to promote normalization with the United Arab Emirates and the Abraham Accords, according to the owner of the place.\n\nAgainst the background of the war in Gaza, the level of cursing on the part of the Palestinians is higher than usual...\n\nThe place is kosher according to the person filming..."}, {"id": "20ce7bc8-1f0d-4322-a85b-477cbf021b11", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28731/", "date": "2024-06-10 17:44", "message": "The Swedish village in the south of Rafah on the border with Egypt (where this photo 👆 that I published last Friday was taken):\nbefore and after"}, {"id": "8b731316-6847-4f4d-aa47-d764bac27fde", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28729/", "date": "2024-06-10 14:48", "message": "Ismail Haniyeh, Chairman of the Political Bureau of Hamas met with Ziyad al-Nakhalah, Secretary General of the Islamic Jihad in Doha, Qatar."}, {"id": "ec49a83d-f8b3-4ee3-b9a6-8ad4a94cfbae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28728/", "date": "2024-06-10 14:47", "message": "The Lebanese report that an Israeli fighter jet attacked a short time ago in the Rihan area in southern Lebanon.\nIt is possible that it attacked the remains of the UAV or the air defense system that intercepted it."}, {"id": "dde3e229-d2e9-4ec2-bc41-02b5417c9cca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28727/", "date": "2024-06-10 14:47", "message": "Additional documentation of the downing of the Israeli drone."}, {"id": "acbf70bd-1286-4314-86e8-69d4d7041c45", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28726/", "date": "2024-06-10 14:46", "message": "IDF Spokesperson confirms the downing of the UAV.\n\nIDF: A short while ago, a surface-to-air missile was launched toward an IAF UAV that was operating in Lebanese airspace. As a result, the UAV was damaged and fell in Lebanese territory."}, {"id": "1e9aed89-4793-40df-a31a-26cc46b3acd6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28725/", "date": "2024-06-10 14:45", "message": "Hezbollah accepts responsibility, in an official announcement, for shooting down an Israeli Hermes 900 drone.\n\nA reporter from the Lebanese Almanar channel claims: This is the 7th Israeli drone that Hezbollah has shot down since the beginning of the war:\n\n3 Hermes 900\n2 Hermes 450\n2 Sky Riders"}, {"id": "d89106c4-fd95-4f21-912e-45a995c15c92", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28724/", "date": "2024-06-10 14:43", "message": "Sky News, it's not nice to blur the watermark! 👆"}, {"id": "a6273ce3-2df7-4305-894a-5af24cbc6a16", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28722/", "date": "2024-06-10 14:42", "message": "Additional documentation of the fall of the Israeli drone in the skies of Rihan in southern Lebanon."}, {"id": "de90d50c-e983-4736-a262-2333fdefa7f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28721/", "date": "2024-06-10 14:42", "message": "Lebanese channels claim: Hezbollah shot down an Israeli drone in the sky of Rihan in southern Lebanon."}, {"id": "53c992be-b231-445a-a069-9418e08df789", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28720/", "date": "2024-06-10 14:41", "message": "As of this time, Hezbollah has accepted responsibility today for 8 attacks against targets in Israel, of which 3 were attacks using suicide drones.\n\nAccording to Israeli media, there is one person slightly wounded by shrapnel as a result of Hezbollah's attacks today."}, {"id": "d1240a0c-73a3-4f65-a727-faae5c0c4aad", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68578/", "date": "2024-06-10 13:15", "message": "Digital begging: a winning horse is not to be replaced\n\nBashar al-Zaoui had started a new fundraiser.\nHe does not forget to emphasize at the end of the video:\nThe link to donations is in the bio...\n\nHe already managed to raise about 20 thousand euros from 1.1k donors..."}, {"id": "1ad71a3f-0af1-472b-bdf6-e2d85f259fe2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28717/", "date": "2024-06-10 13:03", "message": "IDF Spokesperson:\n\nDocumentation: the elimination of a terrorist who came out of a shaft with an RPG missile by the fighters of the 101st Battalion; Division 98 activity in eastern Deir al-Balah and eastern al-Bureij"}, {"id": "805fee9d-f507-4079-b036-76cb1cf02b57", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28716/", "date": "2024-06-10 11:46", "message": "A drone of the Chinese company DJI was able to successfully deliver food and oxygen cylinders at an altitude of 6000 meters on Mount Everest."}, {"id": "f0d94599-20f2-4bb8-a486-5c99e29395ca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28715/", "date": "2024-06-10 11:27", "message": "The Kurdish PKK organization publishes documentation of the downing of the Turkish drone 👆 four days ago over Sulaymaniyah district in Iraqi Kurdistan."}, {"id": "826637d6-87ea-4c99-92d6-ef749da6bafa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28708/", "date": "2024-06-10 10:42", "message": "The Kuwaiti Hospital (field hospital) opens its doors in Mawasi of Khan Yunis (in the humanitarian area in the south of the Gaza Strip) after completing the transition from Rafah following the evacuation of the population from the city."}, {"id": "039678e4-1cce-48b7-a7d3-f57eed01d825", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28707/", "date": "2024-06-10 10:41", "message": "The NBC network from an American official:\nThe US is considering conducting independent negotiations with Hamas on a Qatari axis to bring about the release of 5 hostages with American citizenship from the Strip.\nAccording to the American official, a deal without Israel's involvement will increase the internal pressure in Israel on Netanyahu."}, {"id": "1ce694f8-2a20-4f40-9d19-2c15af6f5cbc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28706/", "date": "2024-06-10 09:12", "message": "UNRWA: The dimensions of the destruction in the Gaza Strip cannot be described. Half of the buildings in the Gaza Strip have been destroyed. The removal of the rubble in Gaza will take years. The recovery from the mental shock (of the residents of the Gaza Strip) following the war will take longer."}, {"id": "3b7ab619-2b66-438c-bf20-d3507bd9bab7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28705/", "date": "2024-06-10 09:11", "message": "The Iranian Foreign Ministry on the resignation of Gantz from the government:\nThe repeated resignations in the government of the Zionist entity indicate its (the Zionist entity's -AA) collapse from within."}, {"id": "5180df5f-540e-4627-95a0-f54daa086c8f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28703/", "date": "2024-06-10 08:00", "message": "Lebanon: the power of consciousness\n\nAt 01:50 in the morning, a resident of the village in the areas of southern Lebanon (Tyre district) received a WhatsApp message (from a number belonging to a Palestinian cellular network -AA) instructing him to immediately evacuate a 4-story building near the gas station in the village, because there was going to be an explosion there.\n\nThe industrious resident began to act. The residents evacuated. All the schools in the village were closed (private and public) and all this despite the fact that the end of the year exams were supposed to be held there this morning....\n\nIn the end, nothing exploded... Maybe someone needed more time to study and had a Palestinian SIM card...\n\nThis case testifies to the power of the tool called \"evacuation notice\". A power that increased during the last months of the war, as I wrote here a few days ago."}, {"id": "c68125ad-b700-4f40-b030-928c537c2770", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28702/", "date": "2024-06-10 07:59", "message": "Germany: The Palestinians complain that the police in Berlin hugged them too tightly..."}, {"id": "8a229466-93c6-4ad6-b5b9-df9bfef589a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28701/", "date": "2024-06-10 07:58", "message": "Toronto, Canada:\nA small group of Palestinians tried to spoil the giant pro-Israeli march yesterday in the city👆\n\nIn the middle: shoe waving.\nNot sure it was successful...they will have to draw their own conclusions..."}, {"id": "529b4708-86f7-4698-873b-e03488c0a58d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28696/", "date": "2024-06-10 07:56", "message": "Three Gazan brothers opened a new stall in Mawasi in Khan Yunis in the south of the Gaza Strip:\nSkewered potatos on an open fire."}, {"id": "a01e53bf-d05a-4a5b-9d51-6e54f765656a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28695/", "date": "2024-06-10 06:09", "message": "IDF Spokesperson: Overnight, interceptors were launched toward a suspicious aerial target that was identified in the area of Acre and Kiryat Bialik.\nA review of the incident determined that it was a false identification."}, {"id": "7abdc3c5-c616-4b24-b10b-aa08d3312456", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28694/", "date": "2024-06-10 06:09", "message": "More echoes of the dramatic night in Europe: the Prime Minister of Belgium decided to resign following the victory of the right in his country.\n\nA large community of Gazans who fled Gaza in recent years has established itself in Belgium.\n\nNow the immigration policy is on the table as a result of the rise of the power of the right in Europe."}, {"id": "5fd92f28-ffec-4aba-aa97-a52be9919f5c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28693/", "date": "2024-06-10 06:08", "message": "American efforts to reach a deal with Hamas\n\nThe American Secretary of State Blinken is expected to arrive in Israel today to meet with the Israeli leadership in order to put pressure on Israel to reach a deal with Hamas. Blinken is expected to continue his journey to other countries in the Middle East to put pressure wherever he can. The Biden administration sees this as a major goal, against the background of the upcoming elections.\n\nA senior American told the CBS network that the operation to rescue the abductees in Nuseirat complicates matters in this context.\n\nAt the same time, the US will distribute a draft proposal for a vote in the UN Security Council in which there is a call for a ceasefire in Gaza based on the \"Biden initiative\"."}, {"id": "2e0dc9f3-864c-41f8-b0dd-e5ee6f6a4174", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28692/", "date": "2024-06-10 06:07", "message": "A cartoon depicting the Palestinian take on the move by Gantz's party:\nJumping from the burning plane that symbolizes the State of Israel."}, {"id": "31075f12-640b-427c-b3f0-91a7b461b482", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28691/", "date": "2024-06-10 05:44", "message": "Here is a pie chart that simplifies yesterday's election results throughout the European Union on the new European Parliament makeup:\n\nOrange - left\nBlue - right\nGrey - undefined\n\nAfter years of left-wing parties dominating the EU, right-wing parties are gaining more power. At the same time, neither party has a majority in the European Parliament."}]