[{"id": "b3ab3bc8-22f9-4eea-aa76-f0002e07fd1b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28357/", "date": "2024-06-03 19:31", "message": "Hezbollah announces a third death in its ranks today:\n\nMuhammad Shuki Shakir, a resident of the village of Ghaziyeh in southern Lebanon.\n\nThe circumstances of his death have not been published. He may have been killed in one of the IDF attacks today in southern Lebanon.\n\nNumber 331"}, {"id": "f6be639d-9bf8-458a-8390-85d33e6ad1cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28356/", "date": "2024-06-03 19:29", "message": "From a publication by the military wing of Hamas this evening:\nA Hamas operative in civilian clothes plants an explosive device inside children's toys (a pink elephant and a toy car) in a house in the Jabaliya refugee camp - with the aim of detonating it on IDF soldiers."}, {"id": "f13dccb6-c341-4adf-a986-7f82068f154c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28353/", "date": "2024-06-03 19:28", "message": "San Francisco: About 100 anti-Israeli protesters \"occupied\" the building where the Israeli consulate is located in San Francisco for about an hour."}, {"id": "1e8b957d-6376-426a-bbf3-739edbf55ce3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28352/", "date": "2024-06-03 18:21", "message": "The Palestinians report that the residential towers \"al Quds\" and \"al Makadma\" in the Bureij refugee camp in the center of the Gaza Strip were also attacked this evening after evacuation.\n\nAs of this hour, 4 residential towers in the Bureij refugee camp were attacked."}, {"id": "6a1440f2-a897-45ef-989f-da9d68056727", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28351/", "date": "2024-06-03 18:20", "message": "IDF Spokesperson: Today (Monday), IDF representatives have informed the families that the deaths of abductees Haim Perry, Yoram Metzger, Amiram Cooper, and Nadav Popplewell have been determined. Their bodies are being held by Hamas.\n\nThey were killed while held hostage by Hamas in Khan Yunis a few months ago, at the time when IDF forces were operating in the area.\nThe circumstances of their deaths are being investigated."}, {"id": "ef3cc6d5-195a-4d53-a9cc-1a5572334391", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28350/", "date": "2024-06-03 18:15", "message": "Senior Hamas official Hassam Badran:\n\nWe have not received a new document regarding a ceasefire."}, {"id": "79d4581a-327e-46ed-a600-c66c6dcc38ce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28349/", "date": "2024-06-03 18:13", "message": "The Palestinians report that in addition to the Al-Maghazi building 👆 the IDF also attacked the al-Ahlam building in the Bureij refugee camp in the center of the Gaza Strip this evening.\nThis building was also attacked after an early evacuation.\n\nThere is a third building that was attacked, also in the Bureij camp."}, {"id": "b4ebdd21-10be-42fe-b21a-f051310913b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28348/", "date": "2024-06-03 18:11", "message": "Nabal, Syria: The funeral of two Hezbollah operatives 👆 which I reported earlier today.\n\nThe two were killed in an attack attributed to the IDF in Aleppo. The banners placed at their funerals featured the familiar branding of the Hezbollah casualties (circled in red).\nHezbollah has not officially announced them, at least as of this time (perhaps because they are not Lebanese)."}, {"id": "0a06b43c-a490-4864-bb2d-0214d910f2d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28347/", "date": "2024-06-03 18:10", "message": "Today the IDF attacked the \"al Maghazi\" building in Block 10 in the Bureij refugee camp in the center of the Gaza Strip, with an evacuation alert (which made the attached documentation possible).\nOn the top of the building there were apparently cellular antennas."}, {"id": "dee2ed86-7fcb-4b6f-9f96-7fea6189f147", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28346/", "date": "2024-06-03 18:08", "message": "Official Iranian media: Sayid Aviar, a member of the Iranian Revolutionary Guards (with Iranian citizenship - AA) was killed in an IDF attack tonight in Aleppo, Syria 👆."}, {"id": "42e28f25-8648-4c90-b7de-f1bed860b24d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28344/", "date": "2024-06-03 16:16", "message": "Palestinian channels report on the death of Adam Faraj, a militant in Fatah's Al-Aqsa Martyrs' Battalions (AMB), in an Israeli operation on al-Quds Street in Nablus, near the Balata \"refugee camp\".\n\nThe attached video, which I blurred, shows the Israeli soldiers approaching Faraj after he was shot, disarming him from his weapon, while a small drone flies near them."}, {"id": "2e43420c-a3b9-462f-9656-6dee4528578c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28343/", "date": "2024-06-03 16:12", "message": "And the last one for now - Hezbollah officially announced a second death for today in its ranks:\n\nHussein Sabra\n\nSabra was an engineer, and was eliminated while driving a vehicle in the Kothariya area in southern Lebanon this morning👆.\n\nNumber 330."}, {"id": "12bb676e-aaf5-4914-85da-9b905f186827", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28342/", "date": "2024-06-03 16:11", "message": "And this is from today - Hezbollah announces another death in its ranks:\n\nHussein Nasser a-Din from the village of Al-Abbasiyeh in southern Lebanon.\n\nThe circumstances of his death have not been published, but it's more than likely that he was killed in the motorcycle attack in Naqoura 👆 earlier today.\n\nNumber 329."}, {"id": "a16a7c79-8e8d-47fa-95fe-f48e460c8b33", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28341/", "date": "2024-06-03 16:09", "message": "Catching up on an announcement from a couple of days ago, in which Hezbollah announced a death in its ranks:\n\nAhmed Taboush\n\nLikely killed in the Israeli attack in Ein Kana the day prior.\n\nNumber 328."}, {"id": "bba745eb-7d23-4c5b-85e0-0a6b624e6548", "channel_id": 1560386984, "url": "", "date": "2024-06-03 15:02", "message": "A field of sunflowers, Nahal Oz: the prosperity on the Israeli side in the face of the devastation and destruction on the Gazan side.\n\n\"Wherever the Jewish plow plows the last furrow, that's where our border will pass.\" -Yosef Trumpeldor\n\nFrom the Facebook page of Kibbutz Nahal Oz\n👇👇👇\nhttps://www.facebook.com/share/p/eCaUSzrRi2P8qSzp/?mibextid=oFDknk"}, {"id": "c30fc4a1-1d71-4db2-8fce-0d52da091737", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28337/", "date": "2024-06-03 14:55", "message": "This is the photo of the engineer Ali Hussein Sabra, a Hezbollah operative, whom the IDF killed this morning in an attack on his vehicle in the Kothariya area in southern Lebanon."}, {"id": "35d3e9b8-95d1-4985-a72a-c0ac3111bef4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28336/", "date": "2024-06-03 14:52", "message": "IDF Spokesperson: This morning (Monday), an IAF aircraft struck in the area of Tyre in Lebanon and eliminated the terrorist Ali Hussein Sabra, a military operative in Hezbollah's Force Build-up Unit.\n\nIn his role, Hussein Sabra was involved in efforts to equip and enhance Hezbollah’s Aerial Defense Unit.\n\nIn addition, the IDF struck Hezbollah terrorist infrastructure consisting of several military compounds used by the Hezbollah Aerial Defense Array in the area of Qotrani in southern Lebanon."}, {"id": "fa692005-9a73-401e-af52-c98df535ce9d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28335/", "date": "2024-06-03 14:51", "message": "Drama in the Iranian presidential elections:\n\nMohammad Bagher Ghalibaf, the speaker of the Iranian parliament, who was elected last week for another term in office, submitted his candidacy for the Iranian presidential elections, right with the \"buzzer\". Today was the last day to register.\nAfter he \"warmed up on the sidelines\" as I wrote here 👆 yesterday, with the encouragement of senior officials in the Iranian Revolutionary Guards, who support him, and contrary to general expectations, Ghalibaf registered for the race.\n\nThis means that the big boss wants him to run....and if the big boss wants him then he has a good chance."}, {"id": "11cd791d-6f04-47e6-a08c-75abc3b4af71", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28334/", "date": "2024-06-03 12:58", "message": "Hezbollah: In response to the elimination in Zrariyeh (Kothariya area👆), we attacked the headquarters of the Galilee Division using suicide drones."}, {"id": "290882f8-e21f-46f8-acfe-91971f7ef9c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28333/", "date": "2024-06-03 12:41", "message": "Lebanese channels: An Israeli drone attacked a motorcycle in Naqoura in southern Lebanon in the last few hours.\nUnofficial Lebanese reports of one dead and one injured."}, {"id": "a255481d-ea6a-4f05-9b20-faf8884dcdd7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28332/", "date": "2024-06-03 12:39", "message": "Lebanese channels: one killed in the car attack 👆 in the Kothariya area near Tyre.\n\nAccording to Lebanese sources, 4 missiles were fired at the vehicle, two hit it and two hit the road."}, {"id": "ad303c6a-ad1d-48ba-8cf1-4dc9f086f674", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28330/", "date": "2024-06-03 12:38", "message": "Syrian opposition sources: Ibrahim el-Uli and Mohammad Ichsan were killed in the Israeli attack tonight in Aleppo.\nAccording to these sources, Ibrahim el-Uli (the older of the two) is a senior member of Hezbollah (and a retired officer of the Syrian army) and lived in the Syrian village of Nabal, where a Shiite minority that supports Hezbollah lives."}, {"id": "f24f16b1-36cf-45be-82e3-025f166fd602", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28329/", "date": "2024-06-03 12:10", "message": "Unofficial Lebanese sources: Two killed in the IDF attack in the village of Meidoun in the depths of Lebanon (Baqaa district)."}, {"id": "2f7b6923-a458-476b-9e5a-23c570c21556", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28328/", "date": "2024-06-03 12:10", "message": "The President of Egypt accepted the resignation of the current Egyptian government from Prime Minister Mustafa Madbouli, and appointed him again to form a new government."}, {"id": "47edaf32-9924-4128-86c0-4a0652ce8332", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68076/", "date": "2024-06-03 12:09", "message": "Egyptian Foreign Minister: We await Israel's response to Biden's proposal after Hamas accepted it \"positively\"."}, {"id": "fbe3f1ff-a588-4ccb-9dbe-94b3481f90c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28326/", "date": "2024-06-03 12:02", "message": "Lebanese channels report an Israeli attack in the area of ​​the village of Meidoun (the attached photo), in the Beqaa district, deep in Lebanon and 6 Israeli attacks in the Rihan area in southern Lebanon."}, {"id": "21316713-956a-48dc-862b-0dc1bdf05c79", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28325/", "date": "2024-06-03 09:54", "message": "Lebanese channels report an injury in an Israeli drone attack on a vehicle in the Kothariya area on the road leading to Tyre in southern Lebanon around noon today."}, {"id": "ec093368-fcef-47ac-9e2f-2ddb36825642", "channel_id": 1560386984, "url": "", "date": "2024-06-03 08:39", "message": "El Salvador: A Pro-Israel president of Palestinian origin was sworn in for another term, against the constitution\n\nYesterday in El Salvador a new president was sworn in: Nayib Bukele.\nBukele, son of father of Palestinian origin (Bethlehem), who visited the Western Wall in 2018 and is considered pro-Israel, was elected in February with a majority of 85% of the votes for another 5-year term. Bukele heads a party that holds 56 of the 60 seats in parliament. He dramatically lowered crime in the country by... less democratic means.\nThe results spoke for themselves- his achievements are appreciated. The judges he appointed allowed him to change the constitution and be elected for another term.\nLeft-liberal European leaders distance themselves from Bukele. At his swearing-in, the President of Argentina Javier Milei, the King of Spain, representatives of the Republican Party in Spain, Catalan representatives and... the son of Donald Trump were present. \n\nAlliances are being forged between right-wing parties globally."}, {"id": "eecbda4e-5f1c-4271-a3a9-2fec73c861b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28317/", "date": "2024-06-03 07:52", "message": "The supreme leader of Iran at a ceremony to mark the 35th anniversary of the death of his predecessor in office - Ruhollah Khomeini:\n\nThe \"Tufan Al-Aqsa\" war came at the right moment. The area needed the October 7th attack.\nIt was a necessity against the Western American project to change the regional equations.\nThe war, which came at a sensitive time, thwarted attempts at normalization with the Zionist entity and its takeover of the region.\nThe Palestinian issue has now become the number one issue in the entire world."}, {"id": "361ffe4a-fad3-4044-a40f-8526f3524b5f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28316/", "date": "2024-06-03 07:51", "message": "Mexico: Claudia Sheinbaum stands to be the first woman to be elected president of Mexico.\n\nSheinbaum, who won the elections in Mexico this morning with about 60% of the votes, is Jewish, born to parents from Lithuania and Bulgaria, a scientist, a climate expert and a member of the left political current in Mexico. She has good relations with the US and makes sure to keep the media quiet about her being Jewish.\nShe has spoken out against Israel in the war with Hamas."}, {"id": "355d59a1-6fa1-47a9-b0de-15bbbfaaf887", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28315/", "date": "2024-06-03 07:49", "message": "A quote caught this morning by Arab media, from Yossi Cohen, the former head of the Mossad:\nWe know where Nasrallah is and if we want we can eliminate him at any moment.\n\n##\nWhy procrastinate? Asking for a friend..."}, {"id": "371ea17c-3997-47b4-af29-39837dd3b6fc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28314/", "date": "2024-06-03 07:48", "message": "The moment the Israeli was located this morning in East Nablus by the PA's security mechanisms."}, {"id": "0170d743-10b1-4787-87c5-3e9e305fb3d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28313/", "date": "2024-06-03 07:14", "message": "IDF Spokesperson: A short while ago, the IDF 'Arrow' Aerial Defense System successfully intercepted a surface-to-surface missile that was fired from the direction of the Red Sea toward Israel. Rocket and missile sirens were sounded in the area of Eilat. No injuries were reported."}, {"id": "b502ebca-c298-4fca-8835-eed414022238", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28312/", "date": "2024-06-03 06:24", "message": "Trump, to a question from journalists:\nI will declassify the 9/11 files, the Kennedy assassination files and the Epstein files..."}, {"id": "a8bc1b8d-32d1-4433-a7ca-6c558eda3a99", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28311/", "date": "2024-06-03 06:22", "message": "The IDF's operation in the Zeytoun neighborhood in Gaza City in May: before and after"}, {"id": "d68c4a36-293a-4dd3-a878-10886d8027da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28310/", "date": "2024-06-03 06:22", "message": "IDF Spokesperson: The IDF located the body of Dolev Yehud\n\nFollowing a scientific identification and a thorough analysis by the IDF in coordination with anthropological experts, the body of Dolev Yehud was found in Kibbutz Nir Oz.  \n\nDolev Yehud (35), from Kibbutz Nir Oz, was a paramedic with United Hatzalah and MDA. During the brutal October 7th terror attacks, Dolev left his house in an attempt to save lives. \nDolev was murdered by the Hamas terror organization on the 7th of October, and his body was located in Kibbutz Nir Oz. \n\nThe IDF notified Dolev's family following an identification process that was carried out by medical officials from the National Institute of Forensic Medicine and Shura military base.\nThe IDF expresses its deep condolences to the family at this difficult time.\n\nAttached is a photo of Dolev Yehud: https://IDFANC.activetrail.biz/ANC03062024019214"}, {"id": "1ce67693-ddb3-48e4-ac88-98652a6db368", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28309/", "date": "2024-06-03 06:19", "message": "The Palestinians report 25 deaths tonight in the Gaza Strip in four IDF strikes:\n\n1. 4 killed in the attack on the house of the Abu Nar family in Nuseirat (central Gaza)👆.\n\n2. 10 killed in the attack on the homes of the Abu Qater and Albar families east of the Islamic University in Khan Yunis (south of the Gaza Strip).\n\n3. 6 killed in the attack on the home of the Akel family in block 9 of the Bureij refugee camp in the center of the Gaza Strip.\n\n4. 5 killed in an attack on a group of people near the al-Ansar Mosque in the Zawayda area in the center of the Gaza Strip."}, {"id": "aa4c347e-ff1b-4e66-97dc-c4195eaecba5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28308/", "date": "2024-06-03 06:18", "message": "Civil Defense in Gaza: We rescued over 70 bodies from the Jabaliya refugee camp (after the IDF withdrew).\nThere are many more bodies under the ruins of the buildings."}, {"id": "7796e3c9-b44b-43a1-8a82-bb52c7d19fac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28305/", "date": "2024-06-03 06:18", "message": "Syria: unusual attack in northern Aleppo\n\nThe Syrian Ministry of Defense announced early in the morning that shortly after midnight, Israeli warplanes attacked Aleppo and as a result several people were killed.\n\nUnofficial sources identified with the Shiite axis report that IDF warplanes flew (as seen in the attached map) over the Jordanian border, entered Syria through the American no-fly zone in Tanaf (in the Jordan-Syria-Iraq border triangle area) and from there continued north towards Aleppo.\nAccording to the report, the copper factory was attacked in the Alhian area in northern Aleppo.\nThese sources report 17 dead and 15 wounded among the soldiers of the Syrian army and the Shiite militias - certainly a high and unusual number. The location of the attack target and the flight path to it are also unusual."}]