[{"id": "0a9b92d3-1b41-429c-8343-9b6067684ed2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28407/", "date": "2024-06-04 20:37", "message": "East Jerusalem channels:\n\n مستوطنون يقتحمون منطقة باب العامود في القدس المحتلة ويرفعون أعلام الاحتلال\n\n\"Settlers invade the Damascus Gate area in occupied Jerusalem and wave the occupation flags\"\n\n###\nHappy Jerusalem Day 🇮🇱🇮🇱🇮🇱"}, {"id": "92c33fcd-ebac-493b-80ac-2646db90d038", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28406/", "date": "2024-06-04 20:16", "message": "From what Gazans wrote about the attached video in which soldiers are seen celebrating at the A-Shukka school (behind Abu Hadaid Street) in East Rafah in the southern Gaza Strip, which was published by one of the residents of Deir al-Balah (a Fatah supporter):\n\n1. These videos are humiliating.\n2. You don't see these videos on the Al Jazeera channel.\n3. Cursed be you, Sinwar\n4. I heard that it is a soldier who is about to get married\n5. It really seems that they are \"stuck in the mud of Gaza\" as Abu Obaida said (cynicism-AA)\n6. As much as we are humiliated now, this video adds even more to the humiliation.\n7. This soldier is either engaged now or has gone to sleep with Sinwar's wife...\n8. \"They really didn't achieve any of their goals in Gaza\" (cynicism - AA).\n9. The Arab viewer only believes what the commentator of Al Jazeera al-Douri says... lol"}, {"id": "6ac32856-84ab-4c8c-bfea-2af5fed8f818", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28405/", "date": "2024-06-04 19:49", "message": "The office of the Prime Minister of Lebanon, Mikati this evening denies the report that was published this morning in the Al-Akhbar newspaper 👆 according to which warnings were received that Israel is expected to launch an extensive attack on Lebanon."}, {"id": "b7dbea9e-fe31-4df1-83d0-c0de919ff7d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28404/", "date": "2024-06-04 19:45", "message": "The spokesman for the Shuhada Al-Aqsa Hospital in Deir al-Balah (central Gaza Strip):\nWe have received 15 deaths since the IDF announced the start of the operation in the Bureij refugee camp.\n\n##\nOne of the channels covering the situation in the center of the Gaza Strip: \"It's as if the war has started again.\"\n\n##\nThe attacks in the center of the Gaza Strip continue at this time, with an emphasis on the Bureij refugee camp."}, {"id": "f339b97d-a12b-4d4f-8eeb-8014af5af3f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28403/", "date": "2024-06-04 19:43", "message": "Senior Hamas official Ghazi Hamed in an interview with the Lebanese Al-Mayadeen channel:\n\nThe ball is in Israel's court. We have no new proposals to accept or reject.\n\nOur position has not changed and we will not give up on the fundamental issues of a permanent ceasefire and the withdrawal of Israeli forces from the Strip."}, {"id": "88352611-aa2c-47a0-9008-a8eed4904f94", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28402/", "date": "2024-06-04 19:42", "message": "The Palestinians report 11 deaths as a result of IDF attacks in the last two hours in the area of ​​the Bureij and Maghazi refugee camps.\nThere are also reports of the movement of displaced persons from the eastern refugee camps in the center of the Gaza Strip (Bureij and Maghazi) towards the central western camps (Nuseirat and Deir al-Balah) following the IDF's operation this evening."}, {"id": "e39b2dfe-9eed-424f-be63-ee28074841a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28401/", "date": "2024-06-04 19:39", "message": "After meeting with Nasrallah in Beirut, Iran's new foreign minister, Ali Bagheri Kani, went to meet Syrian President Bashar Assad in Damascus today."}, {"id": "670f5cc3-5faa-42d0-85ed-7b28bab2e3ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28400/", "date": "2024-06-04 19:37", "message": "Palestinian journalists: There are no more hospitals or central medical points in the Rafah district - a field hospital of the International Medical Authority is being evacuated today from Rafah to Deir al-Balah in the center of the Gaza Strip. It was the last one active in Rafah."}, {"id": "d28e834e-16f0-42ea-85de-02a98143c1e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28399/", "date": "2024-06-04 17:34", "message": "A Gazan located in the center of the Strip posted:\nDid the printing press break down for the Israelis?\nNo evacuation notices were distributed before the operation in Bureij."}, {"id": "bd378ed9-a68b-498f-b42e-75dd14022a77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28398/", "date": "2024-06-04 17:20", "message": "Hezbollah publishes documentation from May 31 in which it claims an attack is seen in the area where the Iron Dome battery is stationed in the Za'oura area in the Golan, using a suicide drone."}, {"id": "7e00aac8-3b25-4a2a-b8fc-fc3d09bf9f83", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28397/", "date": "2024-06-04 17:17", "message": "A demonstration of Israeli Arabs in Haifa reading:\n\"boycott the occupation\"\n\"stop the genocide\""}, {"id": "3b0d4767-1ad4-4bed-85c6-be32508a6d34", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28396/", "date": "2024-06-04 17:16", "message": "Senior Hamas official Asama Hamdan clarified a short time ago at an official press conference on behalf of the movement:\n\nWe informed the mediators that we could not agree to a deal that would not guarantee a permanent ceasefire and a full withdrawal from the Gaza Strip alongside a serious prisoner deal."}, {"id": "6ecf84f7-2ea0-4aa0-b633-185104cc27b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28394/", "date": "2024-06-04 17:15", "message": "Lebanese channels claim that a Lebanese firefighting team was saved from an IDF attack while they were putting out fires in the area of ​​Kafrchouba in southern Lebanon."}, {"id": "2e4c5c46-30e2-4ed7-a46a-9cc7be9ff88c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28391/", "date": "2024-06-04 17:13", "message": "Lebanese channels report that the windows of buildings in southern Lebanon were broken, following the sonic booms created by Israeli Air Force planes."}, {"id": "7d3095f8-f813-4361-b1c8-669e7a92d2d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28390/", "date": "2024-06-04 17:11", "message": "The Palestinians reported \"belt of fire\" attacks in the center of the Strip earlier this evening."}, {"id": "acc896ba-6d11-4648-a39c-af603578cdeb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28388/", "date": "2024-06-04 15:31", "message": "The Israel Police publishes the other side of the video 👆 from yesterday, in which the terrorist Adam Faraj, an operative of Fatah's Al-Aqsa Martyrs Battalions, who was killed near the Balata refugee camp in Nablus, is seen.\n\nIn his picture shared yesterday 👆, he has a \"Mars\" scope attached to his weapon... upside down.\nIt's a wonder he only met his death now..."}, {"id": "fe9e6a85-e0c6-404e-b217-51122c429402", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28388/", "date": "2024-06-04 15:28", "message": "Yesterday, the IDF demolished 4 residential towers in Bureij, in the center of the Gaza Strip, after evacuation."}, {"id": "bc4be2ce-0523-4dcc-8360-621f91b7b573", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28387/", "date": "2024-06-04 15:27", "message": "IDF spokesperson:\n\nFighter jets of the Air Force are now attacking terrorist targets of the terrorist organization Hamas, at the same time as ground forces that are operating in a targeted manner and with intelligence guidance in the Bureij area in the center of the Gaza Strip, more details below."}, {"id": "2c694850-e53c-4330-bf53-4951efcbdaef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28386/", "date": "2024-06-04 15:27", "message": "Hezbollah announces a death in its ranks:\n\nHidar Masalmani\n\nA resident of Naqoura in southern Lebanon\n\nHe was killed in the motorcycle attack in Naqoura 👆earlier today.\n\nNumber 332"}, {"id": "516fa1df-020f-4b22-9b6e-7d6038e3d742", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28385/", "date": "2024-06-04 14:19", "message": "As of this time, Hezbollah has only accepted responsibility for two attacks in Israeli territory since this morning.\nYesterday at this time it was already responsible for 7 attacks."}, {"id": "a912038b-d4d4-4ef4-8190-79daefd55f9b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28384/", "date": "2024-06-04 12:04", "message": "The Hamas Interior Ministry confirms:\n8 policemen were killed in the IDF attack this morning in Deir al-Balah 👆\n\n##\n8 out of 8."}, {"id": "4ac5cd04-fecb-4b50-ba24-48793ae114bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28383/", "date": "2024-06-04 10:44", "message": "Lebanese channels: An Israeli drone attacked a motorcycle a short while ago in Naqoura in southern Lebanon."}, {"id": "d49fdfe7-8d26-418c-9506-194d1b95ba9c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28380/", "date": "2024-06-04 10:43", "message": "The Russian news agency Sputnik: The IDF is trying to start fires in the area of ​​Kafrchouba in southern Lebanon by firing shells and light flares."}, {"id": "27dcdd9e-b1db-4eeb-afbe-3dee5780164c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28377/", "date": "2024-06-04 10:06", "message": "A leading Gazan industry: digital begging\n\nExtremely mediocre acting with third grade English managed to raise no less than 125 thousand Euros for this Gazan.\n\nNow try to convince your son that it's worth making an effort to get good grades in school..."}, {"id": "ce8442c3-4c41-4768-9db2-62b6826abc2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28377/", "date": "2024-06-04 09:46", "message": "Unofficial Lebanese channels: 3 injured, some of them seriously, in an Israeli UAV attack on a vehicle in the Libayya - Yohmor area in the last hour (location attached)."}, {"id": "31a67083-a278-4841-92f8-3311f5f648b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28376/", "date": "2024-06-04 09:40", "message": "The IDF spokesperson informed a short time ago that following a warning of a threat of enemy aircraft infiltration in the north of the country, interceptors were launched from the Safed area towards a suspicious aerial target which turned out to be a false alarm...\n\n##\nNot for the birds..."}, {"id": "959e3c17-fbaa-4ee2-8291-a796c9a43038", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28374/", "date": "2024-06-04 09:37", "message": "Palestinian channels: The IDF carried out a controlled explosion of an explosive device located on 22nd Street in Qalqilya."}, {"id": "90394bdc-e66e-45ca-a67f-fc52b7a400b4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28374/", "date": "2024-06-04 09:35", "message": "Palestinian sources: the vehicle that was attacked this morning in Deir al-Balah 👆 belonged to Hamas police. The death toll in this attack rose to eight."}, {"id": "0a2d9d44-6f06-4f84-b544-2e4220c61619", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28373/", "date": "2024-06-04 07:21", "message": "The northern arena: where do we go from here?\n\nThe escalation in the northern sector has been increasing in the last month in a calculated and systematic manner. Since the announcement of Biden's proposal, there is a feeling that this sector is heating up even more. It is possible that Hezbollah thinks that if they increase the pressure now, as an arena that Nasrallah defined as a \"supporting arena for Gaza\", then they will be able to pressure Israel to accept the terms of the ceasefire with Hamas, with the aim of quieting the north.\n\nIsrael does not have many choices.\n\nHezbollah's many weapons and ammunition have been stockpiled for one purpose. They will not disappear on their own. And if anyone has doubts about Hezbollah's intentions, Nasrallah makes sure to make them clear often: Hezbollah will never give up on a war of attrition against Israel. This is the goal in the past, this is the goal in the present, and this is the goal in the future.\n\nEven if it is not pleasant and certainly not easy, there is no one who will do the work against Hezbollah for Israel.\nEverything is at Israel's doorstep.\n\nI wrote here a few months ago in a long article that Israel is at the right time for starting a war against Hezbollah:\n\n1. The army is prepared and Hezbollah cannot at this stage surprise Israel like Hamas did on October 7.\n\n2. There is an understanding among large parts of the Israeli public that only a hard war against Hezbollah will be able to create a situation in which the residents of the north will be able to return to their homes. There is readiness and desire.\nMany understand that it is impossible to count on a political agreement with Hezbollah. So says past experience, which enabled the situation today, and the voice of reason.\n\n3. Israel managed to erode some of Hezbollah's capabilities in recent months. Not starting from scratch.\n\nIt is true that it would have been much more convenient if Trump was in the Oval Office instead of Biden, but the current reality and the recent escalation do not allow Israel to wait 7 months for the optimistic scenario from its point of view in which Trump defeats Biden in order to get more favorable terms.\n\nJust as Israel realized in retrospect (and too late) that it made a mistake by waiting for many months in vain and not entering Rafah in order to please the US and the international community, so it will realize that delaying the inevitable in the northern arena can cost it much more than it plans and wants.\n\nWhoever runs away from the fire discovers that it is chasing him.\nThere is a difficult reality in the north and it has to be faced despite the difficulties. Postponing the end will not improve the situation. Gaza is no longer the main arena that draws the bulk of the army's forces to it. The time has come to gather the courage and the strength and take care of the northern arena with all our might. Even if it takes many months or even longer.\nThere is no other choice. No one will do it for us."}, {"id": "cbab9477-d2b3-407b-a709-694983f4094a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28372/", "date": "2024-06-04 07:18", "message": "The Palestinians report 7 dead in a vehicle attack this morning near the technical college in the north of Deir al-Balah (central Gaza)."}, {"id": "c9b5c822-44d4-48e8-8410-adb844c66ba3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28371/", "date": "2024-06-04 07:10", "message": "The documentation of the fires in the north of Israel have been filling the Arab channels across the board since yesterday.\nThe fire \"photographs well\" and creates a lot of interest - the Arabs in the Middle East are waiting to see how Israel will react."}, {"id": "f2f05f5a-084b-4d8f-8c21-d17a096b2391", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28370/", "date": "2024-06-04 07:08", "message": "A bank robbery that included shooting, this morning, in the village of Dar Salah in the eastern part of Bethlehem."}, {"id": "f03301b8-e50e-4e34-b600-d458cd360d32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28369/", "date": "2024-06-04 07:08", "message": "Lebanon: The new Iranian foreign minister (replacing the minister who was killed in the crash) in a meeting with Nasrallah in Beirut.\n\nThe Iranian minister landed yesterday in Beirut for his first official visit since his appointment.\n\nEveryone kept their shoes on (:"}, {"id": "607a1112-49d8-40e7-8ffc-6fa795bcc58e", "channel_id": 1560386984, "url": "", "date": "2024-06-04 07:06", "message": "The elimination of the Iranian adviser in Syria \n\nYesterday 👆 Saeed Aviar, member of the Iranian Revolutionary Guards, was killed in an attack attributed to Israel in Aleppo, Syria.\n\nFrom photos on social networks, it appears that along with the \"advisor's\" coffin, a coffin of an operative of the Fatemiyoun militia (circled in red) who was apparently also killed in the attack was sent.\nFatemiyoun is a Shiite mercenary militia that Iran operates for its needs mainly in Syria, consisting mostly of Afghans. It has been working for many years for Iranian interests for small sums of money and \"Iranian citizenship\".\n\nIn the photos, you can see Saeed Aviar in a \"consulting mission\" from more than four years ago with Qassem Soleimani, commander of the Quds force in the Iranian Revolutionary Guards who was eliminated in 2020 by the US.\n\nAviar is the first Iranian whose assassination is attributed to Israel since the attack near the Iranian embassy in Damascus on 4/1 (which led to the extensive Iranian response-AA)."}, {"id": "fa4de67d-97d2-4a01-8302-15f903cbc19d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28364/", "date": "2024-06-04 06:31", "message": "Fatah's al-Aqsa Martyrs Battalions in Tulkarm accept responsibility in a proclamation on their behalf for the overnight shooting attack at the Nitsani Oz checkpoint in western Tulkarm.\nAccording to the announcement published last night, some of the perpetrators of the attack returned home safely, and as for another part, their fate is \"unknown\".\n\nThe two \"missing\" are:\nAbdel Fattah Jabara\nAhmad Rajab\n\nTheir picture is attached.\n\nThe IDF spokesperson helped them find out what happened to the two:\n\nTwo armed terrorists were killed in the Tulkarm area before carrying out a shooting attack on Israeli settlements in the area\n\nDuring the night (Monday), two armed terrorists approached the fence with the aim of carrying out a shooting attack on Israeli settlements from the direction of Tulkarm in the Menashe division. An ambush of Unit 636 fighters in the area eliminated the terrorists and confiscated the weapons they intended to use."}, {"id": "2c8dbdea-6640-4841-910d-ba6f82b903b6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28363/", "date": "2024-06-04 06:30", "message": "Lebanese sources claim that Israel launched phosphorus bombs last night at Karfkela in southern Lebanon with the aim of setting fire to the area."}, {"id": "67575a39-b0f7-411a-9fe1-9804c8755308", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28360/", "date": "2024-06-04 06:29", "message": "The San Francisco police arrested about 70 anti-Israel clowns who broke into the building where the Israeli consulate in San Francisco is located yesterday."}, {"id": "08c39648-25b2-4cd9-a65a-06c2eae0d369", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28359/", "date": "2024-06-04 06:28", "message": "USA: We distributed a draft resolution supporting the implementation of President Biden's ceasefire proposal to the UN Security Council. We call on the UN Security Council to insist that Hamas accept the ceasefire agreement."}]