[{"id": "63a3588e-883a-467b-a957-f2d3d0153d21", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32437/", "date": "2024-08-14 19:48", "message": "Javier Milei cuts Argentina's inflation rate to 4% in July\n\nJavier Milei, Argentina's president and one of Israel's most supportive allies (as well as a friend of Donald Trump and Elon Musk), who was elected on an economic platform in Argentina, continues to combat inflation in his country at an impressive pace. \n\nJuly was the best month so far in terms of inflation rate: 4% compared to 25.5% in December, the month he assumed office."}, {"id": "b77e3833-ab19-4fa8-9008-666ab6eaeae9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32434/", "date": "2024-08-14 19:46", "message": "PA President Abu Mazen arrived in Turkey today and met with Erdogan."}, {"id": "aff0c659-81b4-4684-811c-3bb3345ff492", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32433/", "date": "2024-08-14 19:23", "message": "Video footage from the Taliban's victory parade👆 at the Bagram Air Base - formerly the largest US air base in Afghanistan, before the withdrawal of US forces from the country."}, {"id": "41746b94-90f2-4ada-be04-5ceb539fea61", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32432/", "date": "2024-08-14 19:21", "message": "US State Department: The resumption of ceasefire talks tomorrow is an important step. We will attend the negotiations and are prepared for a new round of discussions. We are working around the clock throughout the week to achieve a ceasefire agreement. An agreement in Gaza will help reduce tensions in the region.\n\n##\nIt seems the Americans are more enthusiastic about reaching a deal than either of the parties involved. However, enthusiasm alone won't be enough—just like in previous instances where preparations and grandiose statements ended up amounting to nothing."}, {"id": "48280b19-e392-4adb-bf8e-6e6913d79940", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32431/", "date": "2024-08-14 19:20", "message": "IDF Spokesperson: Several terrorists were eliminated in gunfire exchanges and airstrikes, including a senior terrorist, following a 12-hour operation in the Jordan Valley area\n\nIDF, Border Police, Israel Prison Service, and Shin Bet forces completed a 12-hour counter-terrorism operation today in the villages of Tubas, Tammun, and the Faraa Camp - within the area under the command of the Bika'a and Amakim Brigade.\n\nDuring the operation, Air Force aircraft carried out several airstrikes on the villages of Tammun and Tubas, resulting in the elimination of four armed terrorists. Ground forces eliminated a senior wanted terrorist and engaged in gunfire exchanges with additional terrorists in the area, with hits confirmed.\n\nDuring the operation, an IDF 'David' vehicle struck an explosive device, resulting in two soldiers being moderately injured and two others lightly injured. The injured soldiers were evacuated to a hospital for medical treatment, their families have been informed."}, {"id": "c5f8c9ff-fff9-4f46-9f02-15af8bbc8579", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32427/", "date": "2024-08-14 18:43", "message": "Ukrainian military advancement inside Russian territory in Kursk Oblast\n\nThe Ukrainians are deepening their foothold within Kursk Oblast, Russia.\n\nUkrainian President Zelensky remarks:\n\"We may be forced to impose martial law in Kursk Oblast.\"\n\nIn the meantime, Ukrainian journalists are broadcasting live from Kursk, struggling to hide their joy over the Ukrainian achievement and Russia's humiliation."}, {"id": "b42c31a2-0333-400b-a543-f8487c886ae2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32426/", "date": "2024-08-14 17:32", "message": "Unofficial Lebanese sources: the dead in Marjayoun are members of the \"al-Jama'a al-Islamiyya\" organization in Lebanon."}, {"id": "51f3dc40-c57e-4d71-af87-14f5022318ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32425/", "date": "2024-08-14 17:25", "message": "The diplomatic blitz: after the Americans, the French foreign minister is expected to land tomorrow in Beirut - you can say that they are trying to physically stop the escalation...\n\nThe presence of foreign officials in Lebanon delays Hezbollah's response."}, {"id": "5e1e3de4-7e57-406d-8eb9-6467e7be752a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32424/", "date": "2024-08-14 17:18", "message": "Summary of casualties today as a result of IDF attacks in southern Lebanon:\n\nAl-Abbasia junction in Tyre: 17 injured, 4 of them in serious condition (official).\n\nThe village of Blida: one killed and seriously injured (official).\n\nThe village of Rab el Thalathine: two wounded, one seriously (official).\n\nMarjayoun: 3 dead and 3 wounded (unofficial)."}, {"id": "c10ca9f9-862b-45a9-ad11-64645812ba60", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32422/", "date": "2024-08-14 17:16", "message": "Unofficial Lebanese sources: 3 killed in the car attack in Marjayoun in southern Lebanon."}, {"id": "2bbddc5d-1302-4045-af92-ac0c6c8afd29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32421/", "date": "2024-08-14 17:07", "message": "The Palestinians report a series of attacks by the IDF on buildings in the Hamad neighborhood in Khan Yunis - a neighborhood that the IDF cleared of its inhabitants a few days ago."}, {"id": "80c21133-6146-40b3-89ce-672ec4d5cb29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32420/", "date": "2024-08-14 17:05", "message": "An Israeli UAV recently attacked a vehicle in Marjayoun in southern Lebanon."}, {"id": "ee02e97f-de59-4814-9bcb-1edfe96b6398", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32419/", "date": "2024-08-14 17:04", "message": "Palestinian Authority Chairman Abu Mazen is expected to arrive in Turkey this evening for a two-day visit during which he will meet with Turkish President Erdogan and even deliver an \"important and extraordinary speech\" to the Turkish Parliament."}, {"id": "34e9b719-0bff-4e72-b837-42f32c5fc346", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32418/", "date": "2024-08-14 16:55", "message": "Senior Fatah official, Jibril Rajoub told Nasradio: I hope that the Doha summit tomorrow will be a lever of pressure on Netanyahu to withdraw his aggression on Gaza and for the Israeli army to withdraw to the borders recognized by the international community."}, {"id": "072eee6d-f01c-461a-8904-a9a659cdf69d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32417/", "date": "2024-08-14 16:46", "message": "The American envoy Amos Hochstein who landed in Beirut today met with senior officials in the Lebanese parliament including the speaker of the Lebanese parliament and the chairperson of the Amal Shiite movement, Nabih Berri.\nHochstein also met with senior officials in the Lebanese opposition with an emphasis on the Christian parties.\n\nAccording to official Lebanese sources, Hochstein made it clear to the Lebanese that intense talks will be held in Doha starting tomorrow for two days, in which great efforts will be made to reach an agreement for a ceasefire in Gaza (which will also affect the Lebanese arena)."}, {"id": "cfd41bab-71a8-4ee6-bc96-a83077e7d57f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32416/", "date": "2024-08-14 16:44", "message": "The Palestinians report at least 30 deaths in a series of IDF attacks in recent hours in Khan Yunis and Rafah in the southern Gaza Strip."}, {"id": "299ba011-c294-40fb-88d7-83aced74e140", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32415/", "date": "2024-08-14 14:20", "message": "Sources associated with the Iranian opposition, located in Western Europe, report a broad cyber attack against the Iranian banking system, including the Central Bank and other banks in the country. The attack causes extensive disruptions in bank operations and service to citizens."}, {"id": "5f7d1d85-3f04-42a8-b810-c91f4a989751", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32415/", "date": "2024-08-14 14:19", "message": "The supreme leader of Iran in a meeting with senior officials:\nThe enemy is trying to instill fear among our people against the military capabilities of the USA, Britain and the Zionists.\nIt's psychological warfare. The enemies are not as strong as they are shown and we have to trust ourselves.\nThe enemy's goal is to push us back economically and politically through psychological warfare.\n\n##\nFunny when it comes from him.... There are no mirrors there in Iran? A paper tiger."}, {"id": "9b28114b-b55e-4d35-9abc-9c65a6aec5a0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32411/", "date": "2024-08-14 14:19", "message": "Iraq: On the occasion of the 40th day, which the Shiites celebrate (40 days after the martyrdom of Imam Husayn ibn Ali, the grandson of the Prophet Muhammad), the Iraqis pasted Prime Minister Netanyahu's pictures on garbage trucks in the city of Karbala, which is holy to the Shiites."}, {"id": "36d1b72e-0555-4b23-9a87-bea14f829976", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32411/", "date": "2024-08-14 14:14", "message": "The Lebanese Ministry of Health officially announces that the number of injured in the Israeli drone attack 👆 today at noon at al-Abasia junction in Tyre has risen to 17, of which 4 are seriously injured."}, {"id": "de502bde-4a7a-47ba-9339-2c5ef7fc24b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32406/", "date": "2024-08-14 14:14", "message": "The Palestinians report 6 \"martyrs\" in the IDF's activity today in Tubas and Tamun.\nAttached is a picture of five of them."}, {"id": "d4654f9c-5d19-4554-bd49-bbc17743c80f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32403/", "date": "2024-08-14 12:51", "message": "Lebanese channels: An Israeli UAV attacked a motorcycle a earlier this afternoon the area of ​​Abasia junction in Tyre (South Lebanon).\n\nLebanese channels report ten wounded, three of whom are in a serious condition as a result.\n\nUnofficial Lebanese channels report one person killed in the attack."}, {"id": "efc52321-5dfa-40b4-b36e-2096b4880288", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32402/", "date": "2024-08-14 11:55", "message": "Sahil al Hindi, a member of the political bureau of Hamas states:\nWe will not be part of the ceasefire talks tomorrow whether they are in Egypt or Qatar."}, {"id": "b741ca7a-3c12-4d70-97e5-d9a28d1bc67a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32401/", "date": "2024-08-14 09:37", "message": "The feeling of descalation?\nThe French news agency reports that the airlines Air France and Transavia will resume their flights to Beirut tomorrow."}, {"id": "65b65349-afa2-4cea-bea0-8082425bb083", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32400/", "date": "2024-08-14 09:36", "message": "The Lebanese Ministry of Health with official data on the war:\n\n547 dead and 1,765 wounded in Lebanon since the beginning of the war.\n\nOver 100 thousand people were evacuated from their homes in Lebanon."}, {"id": "863b2b5f-b3ce-4b4d-9518-8e410745f11c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32399/", "date": "2024-08-14 07:42", "message": "The Lebanese Al Mayadeen (identified with the \"Axis of the Resistance\") from a senior source in the \"Resistance\":\n\nHamas will not take part in the talks on the ceasefire in Doha (Qatar) tomorrow."}, {"id": "b6803cd5-b874-40a5-9971-c1b36c0b87bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73225/", "date": "2024-08-14 07:30", "message": "Lebanese sources: Movement of displaced Lebanese towards the west of Beirut and towards the Baalbek district due to the fear of Israeli attacks on Hezbollah strongholds in Beirut's Dahieh."}, {"id": "8922ddb3-dfba-4505-9326-f07f4192a98c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32399/", "date": "2024-08-14 07:30", "message": "Afghanistan: The Taliban is holding a military parade today at the Bagram base - which was the largest American air base in Afghanistan.\n\nAmerican military equipment also appears in the parade...\n\nThe parade on the occasion of the anniversary \"of the liberation of Afghanistan from the American occupier\"."}, {"id": "b137d7e7-3c8e-4d49-bc6e-df0d4c674776", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32399/", "date": "2024-08-14 07:12", "message": "One of the IDF jeeps that was hit by an IED in Tubas this morning."}, {"id": "3498cb30-5fd8-4195-a336-7e9d159d004d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32399/", "date": "2024-08-14 07:00", "message": "Iranian revenge and Hezbollah's revenge - a brief snapshot\n\nWe are now on the 14th day since the assassination of Ismail Haniyeh in Tehran and since the Iranian announcement of \"revenge against Israel\". This year, the Iranians always took revenge by the 12th day after hoisting the revenge flags...\n\nThe Americans are throwing all their weight behind preventing regional escalation and are deploying military forces on an unprecedented scale: aircraft carriers, submarines, tens of thousands of soldiers and much more. At the same time, last night's report on the approval of a large arms deal in the amount of 20 billion dollars and the announcement by the Western countries of their commitment to the defense of Israel - are doing their part. It certainly deters Iran and Hezbollah.\n\nIn addition, today the US is sending special envoy Amos Hochstein to Beirut, at the same time as a broad diplomatic effort aimed at Thursday - negotiations on a ceasefire deal in Gaza.\nThe Iranians already sound less determined than before regarding revenge. The public announcements are more hesitant.\n\nIt is evident that everyone is waiting with eager anticipation for the results of the round of negotiations on Thursday and the Biden administration really wants it to succeed this time - this will surely also bring unprecedented pressure on Israel behind the scenes.\n\nThe big danger is that the greater the expectation from the negotiations, the greater the disappointment if the round does not succeed."}, {"id": "0b20a3a0-e9fc-4f35-a7ff-d600f3d80f6f", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73225/", "date": "2024-08-14 06:58", "message": "The operation in Tubas and Tamun:\nThe Palestinians report that the IDF forces are in possession of three bodies of Palestinians who were killed as a result of the (first ever) Israeli aircraft attack in Tamun."}, {"id": "67b4162a-dd2a-4c14-815b-9087eb02126d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32392/", "date": "2024-08-14 06:55", "message": "Lebanon: Lebanese channels claim that tonight Israeli warplanes fired shots over the airfield in Beirut and over the Dahieh area."}, {"id": "da7ae5c9-d2d4-4e1b-ae95-cc572f9049bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32391/", "date": "2024-08-14 06:54", "message": "Brazil neighborhood in Rafah in the southern Gaza Strip - the erasure of buildings."}, {"id": "d80e50ea-f8b5-424d-b262-1cac11874623", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32390/", "date": "2024-08-14 06:54", "message": "The IDF spokesman published an infographic of the location from which Hamas launched rockets towards Tel Aviv yesterday.\n\nThe launch was made from Khan Yunis right inside the humanitarian route through which the aid trucks pass from the south of the strip to the center and north.\n\nThe IDF spokesman reported that the IDF attacked the area from which the launches were carried out yesterday."}, {"id": "2326aff6-832f-4f6c-960e-1c54a50d7333", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32389/", "date": "2024-08-14 06:51", "message": "Gaza Strip:\nThe Palestinians report 12 deaths tonight in two IDF attacks in the Maghazi refugee camp in the center of the Gaza Strip:\n8 killed in the attack on the house of the Abu Nada family.\n4 killed in the attack on the Eid family home.\n\nIt was also reported that two more were killed in the attack on the Mazin family home in Beit Lahia in the north of the Gaza Strip."}, {"id": "56096436-75a1-4ce0-a21f-58100dabc1be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32387/", "date": "2024-08-14 06:50", "message": "Palestinian channels report that in the early morning the PA's security mechanisms detonated, in a controlled manner, an explosive device that was planted to hit IDF forces in Jenin."}, {"id": "1d9bda1e-9919-4901-85d4-b2d2312b6ed8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32385/", "date": "2024-08-14 06:48", "message": "The IDF announced a military operation in Tubas and Tamun in northern Samaria\n\nBefore this morning's announcement of the operation, IDF forces surrounded a building in Tubas where terrorist Faiz Dagharma - a released prisoner - was hiding. The Palestinians reported that the forces fired shoulder-fired missiles and even attacked from the air in the area of ​​the house. He was eliminated and apparently others were arrested.\nDuring the exchange of fire in Tubas, Palestinian terrorists detonated explosive devices at the forces."}, {"id": "17948261-16c6-4bfa-881d-c6b24950b6a4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32384/", "date": "2024-08-14 06:44", "message": "The US approved an arms deal worth about 20 billion dollars to Israel.\n\nThe deal includes:\nAir-to-air missiles worth $102.5 million.\nTank shells worth 774 million dollars.\nTactical vehicles worth $583 million.\nF-15s worth $18.8 billion."}, {"id": "74b38c1d-2d6a-49a9-a325-ca56b1b3a120", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32383/", "date": "2024-08-14 06:44", "message": "The Lebanese Al Mayadeen channel: The American base in the Koniko gas field in Syria was attacked by rockets.\n\nAccording to other sources, 4 Grad rockets were fired at the base.\n\n##\nThe Pentagon admitted this evening that 8 American soldiers were injured last week in an unmanned aerial vehicle attack on an American base in Syria."}, {"id": "3c58df37-c166-49ba-838a-df1b580d2aca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32382/", "date": "2024-08-14 06:42", "message": "Ahmed Abd al-Hadi, Hamas representative in Lebanon in an interview with the Russian news agency RIA Novosti:\nWe will not participate in the Gaza ceasefire talks, scheduled for Thursday."}]