[{"id": "71fe105e-a41b-4322-b145-7523b0389495", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32666/", "date": "2024-08-19 09:20", "message": "The Lebanese Ministry of Health: Two killed in an IDF attack this morning in Houla in southern Lebanon (UAV attack)."}, {"id": "ffa0530b-2ec2-40a5-80ae-4de0ab5b139a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32665/", "date": "2024-08-19 09:19", "message": "Iranian Foreign Ministry:\n\nWe do not seek to escalate the situation in the region and we support the ceasefire efforts in Gaza.\n\nThe ball is in the American court - it must prove that it is serious about a ceasefire in Gaza and the end of the war. The US has the power to stop the Israeli fighting."}, {"id": "9e2a67bc-a04b-475f-bffc-3a02d57080d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32664/", "date": "2024-08-19 07:59", "message": "The terrorist who carried on his body the explosive device that exploded yesterday in Tel Aviv (together with him) has been referred to since last night on social media as \"الاستشهادي منفذ عملية تل أبيب\"\nThe martyr who carried out the attack in Tel Aviv\n\nThere is extensive discussion on social networks about the terrorist's nationality based on security camera images on the streets of Tel Aviv.\n\nMany Arabs online claim that he has a Turkish appearance but also other nationalities, in which a Palestinian identity emerges as a real possibility.\n\nSome summed it up like this: he has Islamic citizenship!"}, {"id": "13a7e089-d0c1-4ae7-b988-835bb23be4d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32663/", "date": "2024-08-19 07:53", "message": "2. Iran would have been very happy to produce an attack with many casualties in Israel with a low profile, one that would be considered below the threshold of starting a regional war. That is, an attack that causes many deaths but not as a result of a missile launched directly from Iranian territory - a pattern of action parallel to the way Haniyeh was eliminated in Tehran - a \"local action\".\n\n3. Hezbollah, one of Iran's executive branches, has proven in the recent past that it has such capabilities.\n\n4. Hamas has a very high motivation to carry out deadly attacks on Israeli territory and has infrastructure in the West Bank.\n\nAs one Hezbollah supporter wrote:\nAllah was with the Jews tonight...\n\nWe have to give thanks for the magnitude of the miracle yesterday in Tel Aviv... and this after we had already spent almost the entire quota...\n\nFortunately, Zaka only had to collect the pieces of the body of the person who caused the explosion this time.\n\nPhoto credit: Zaka Spokesperson."}, {"id": "4dc0124d-473a-4f07-b9e2-9c25cccbde94", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32662/", "date": "2024-08-19 07:53", "message": "The explosion in Tel Aviv last night - some insights\n\nThe commander of the Tel Aviv district stated last night that the person who carried a bag on his back containing a powerful explosive device that exploded around 20:00 in the evening in Tel Aviv, was not innocent. The suspect is being investigated as to whether the intention was terror or criminal. He also noted that the direction of the attack is very relevant - this is what has been said so far officially by security officials.\n\nA few points to note:\n\n1. Failure, at least according to Hamas' announcement last night, of the negotiations for a deal.\nIt should be noted that the negotiations for the deal appeared to hold off the reactions of Iran and Hezbollah to the assassinations at the end of July."}, {"id": "4746d4f1-bf2e-4d71-a700-4b21474f025d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32659/", "date": "2024-08-19 07:15", "message": "Three more were released from prison in Israel in the last day:\n\nMuhammad Ayub Rajabi\nMajahed Koassami (from Hebron)\nYahya Jadou (from Bethlehem)\n\nTaking part in the before and after trend."}, {"id": "bca5e2a9-e7ad-4155-949d-0d70903ec05a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32658/", "date": "2024-08-19 07:13", "message": "The Palestinians complain: airlines from all over the world (including Western companies) stopped flights to Israel until next year (unconfirmed -AA), while FlyDubai of the United Arab Emirates continues to fly to and from Israel."}, {"id": "d437f946-c629-48a9-a640-cf7ada9bd974", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73541/", "date": "2024-08-19 06:58", "message": "Hezbollah announced a short time ago:\n\nIn response to the elimination (of a commander in the Radwan force - AA) in Kadmous (Tyre) 👆 we attacked with suicide drones the headquarters of the Western Brigade in Ya'ara as well as a logistics base."}, {"id": "72a0eb48-19f6-410a-b442-a92b037b250c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32656/", "date": "2024-08-19 06:56", "message": "A resident of Gaza curses the Arab countries against the background of the documentation of the displaced persons evacuating from the Maghazi refugee camp in the center of the Gaza Strip following the instructions of the IDF spokesman.\n\nWhere will the displaced people go?\n\nThe Gazan asks a question that is becoming more and more popular against the background of the continued evacuation instructions and the increasing density in the central area of ​​the Gaza Strip."}, {"id": "e6b0203e-40d8-41e2-9126-9f36c7edb46c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32655/", "date": "2024-08-19 06:45", "message": "The elections are approaching in Algeria (September 7)... how can the president attract more votes?\nThe Palestinian card...\nThe president promises at an election rally: our army is ready to go to Gaza and fight... we just need Egypt to open the border for us....\n\nWords are free.\n\n##\nI'll speak in place of Al-Sisi, the president of Egyptt: come on man, the border is open..."}, {"id": "571b81f8-c6d7-4bc2-b582-ab9b2898983d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32654/", "date": "2024-08-19 06:40", "message": "The Palestinians report that the IDF arrested Dania Hanatsheh tonight in Ramallah - one of the people released from the hostage deal with Hamas, who was released from prison in Israel last November."}, {"id": "84ee64a2-1011-4415-b8eb-3cd1d4436e3f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32653/", "date": "2024-08-19 06:38", "message": "The President of Colombia decided to ban the export of coal from Colombia to Israel: \"Colombian coal was used to make bombs that kill the children of Gaza\"\n\nHamas in a statement: We appreciate the move of the Colombian president."}, {"id": "30e306dc-4764-4640-909c-a5136019dca6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32652/", "date": "2024-08-19 06:37", "message": "Hezbollah in a proclamation:\nEarly in the morning we spotted an IDF force that had infiltrated Lebanese territory in the Ayta ash-Sha'ab area. We fired rockets and mortars - which forced them to retreat."}]