[{"id": "c0fa43b9-ea58-43f8-8355-6fc26adbe5ba", "channel_id": 1560386984, "url": "", "date": "2024-06-16 20:43", "message": "Recharging the batteries of legitimacy in preparation for the expansion of the fighting against Hezbollah?\n\nFrom the IDF spokesman's statement to the foreign media:\n\nBecause of Hezbollah's refusal to comply with UN Security Council Resolution 1701, because of Hezbollah's military infrastructure, the shooting and fire at Israel from the area south of the Litani River in southern Lebanon, and because of Lebanon's failure to enforce 1701 on Hezbollah - Israel will take all necessary measures to protect its citizens, until security is restored at the Lebanese border.\n\nIn one way or another - we will ensure the safe return of the Israelis to their homes in northern Israel. It is not negotiable."}, {"id": "7f865d4c-e3bb-4375-b5a6-784a07a749e4", "channel_id": 1560386984, "url": "", "date": "2024-06-16 19:36", "message": "Saudi Arabia: How hot was it in Mecca today?\nOne of the pilgrims chose to hide inside a Pepsi refrigerator (which the Palestinians are boycotting due to its support of Israel-AA)"}, {"id": "9f3e4084-3d8a-40cd-b86b-bc17924a5d64", "channel_id": 1560386984, "url": "", "date": "2024-06-16 19:35", "message": "The entrance to Ashdod Street in the Shabua neighborhood in the center of Rafah - the Palestinians are documenting an old model IDF APC (Zelda M113) that was apparently abandoned there.\nDuring the maneuver in Rafah as well as during the maneuver in Jabaliya, the Palestinians claimed that the IDF remotely controlled this outdated model of the APCs without soldiers inside and even stated that it is sometimes used them as a \"suicide APC\" that exploded inside Palestinian buildings."}, {"id": "199cd02e-e134-44ba-8f82-44c7f5df2938", "channel_id": 1560386984, "url": "", "date": "2024-06-16 19:33", "message": "The Palestinians report 9 deaths in the attack on the house of the al-Hatib family near the al-Rasas intersection in block 4 of the Bureij refugee camp in the center of the Gaza Strip earlier this evening."}, {"id": "489ffcaa-7495-4a57-a1d4-812ba05d74fd", "channel_id": 1560386984, "url": "", "date": "2024-06-16 18:22", "message": "The IDF spokesperson published the names of two IDF soldiers who fell in the Gaza Strip.\nSergeant Shalom Menachem fell in the explosion of the APC yesterday in Rafah (the last of the eight) and Sergeant Tzur Abraham fell today in the explosion of a tunnel shaft in the southern Gaza Strip.\n\nMay their memories be a blessing."}, {"id": "f3f7554e-a525-4d80-9905-2b5c2e48a1fa", "channel_id": 1560386984, "url": "", "date": "2024-06-16 18:20", "message": "Lebanese channels report on 3 attacks by the IDF in southern Lebanon this evening.\nAttached is footage from Kafr Chaqra."}, {"id": "a8f7ae93-8a99-458d-a138-493fa1bb89f3", "channel_id": 1560386984, "url": "", "date": "2024-06-16 18:13", "message": "The quiet in the north continues. As of this evening, there is still no offensive activity for which Hezbollah has accepted responsibility today."}, {"id": "f8ff863a-a204-48c2-b554-f6842087aee8", "channel_id": 1560386984, "url": "", "date": "2024-06-16 18:11", "message": "The Palestinian Ministry of Health in Gaza:\n\n41 dead in the Strip in the last day.\nDetails of those killed in the days leading up to today:\n\n30\n34\n30\n38\n40\n40\n283 (following the operation to rescue the abductees in Nuseirat)\n\n37,337 dead and about 85,300 wounded in the Gaza Strip since the beginning of the war.\n\n##\nSince the rescue operation in Nuseirat, we have seen a significant (and consistent) decrease in the number of deaths reported by the Palestinian Ministry of Health in Gaza.\nIt is possible to see a correlation between the low number of casualties and the decrease in the scope of the IDF's offensive activity in the Gaza Strip since the rescue of the hostages (and also compared to the week preceding the rescue operation)."}, {"id": "9b1a0c37-27c0-4e2c-b07c-848dd6e042ea", "channel_id": 1560386984, "url": "", "date": "2024-06-16 18:09", "message": "And meanwhile in the Facebook group for the market of Gaza:\nAn apartment for rent on a daily basis for married displaced persons.\n\n##\nI believe that even well-known people will be welcomed there...\n\nThe issue of the privacy of the displaced people in tents is a difficult social issue that is getting worse as the majority of the residents of the Gaza Strip live outside of permanent structures."}, {"id": "98f7f70a-089d-4134-b1c0-b83d3d6a826e", "channel_id": 1560386984, "url": "", "date": "2024-06-16 18:08", "message": "A resident of Gaza \"slaughters a calf\" in honor of the Feast of Sacrifice..."}, {"id": "0cd3e77c-65b4-4299-afde-4ff28986f1f9", "channel_id": 1560386984, "url": "", "date": "2024-06-16 18:06", "message": "Eid al-Adha prayer among the ruins of Khan Yunis in the south of the Gaza Strip."}, {"id": "026a2985-56ff-4da7-8167-b4e66e8f23ab", "channel_id": 1560386984, "url": "", "date": "2024-06-16 18:06", "message": "Escaped calf: One of the wonders of the Feast of Sacrifice in Cairo... A calf that decided to escape its destined fate \"blows up\" the holiday prayer in one of the gathering places in Cairo."}, {"id": "94f686e1-8023-4b2e-b577-5de0b688145e", "channel_id": 1560386984, "url": "", "date": "2024-06-16 12:12", "message": "As of this time, on the first day of the Feast of the Sacrifice, Hezbollah has not accepted responsibility for any attack on Israel."}, {"id": "5a1e3af5-580e-411c-ba7a-7fcd59498211", "channel_id": 1560386984, "url": "", "date": "2024-06-16 12:04", "message": "The Qatari Al Jazeera network publishes a video which it claims shows the evacuation of the IDF APC that was hit yesterday morning in Rafah."}, {"id": "471b0253-28cc-4114-874e-f79138a8bb5f", "channel_id": 1560386984, "url": "", "date": "2024-06-16 12:01", "message": "A Gazan posted a picture of the family calf they got for the Festival of Sacrifice..."}, {"id": "8ba2b0fb-2993-46bb-b9ea-369b706506d4", "channel_id": 1560386984, "url": "", "date": "2024-06-16 11:11", "message": "The chairman of the political bureau of Hamas in a speech on the occasion of the holiday: victory is near. The enemy is broken.\n\nFrom the speech of Ismail Haniyeh, Chairman of the Political Bureau of Hamas, on the occasion of the Feast of Sacrifice:\n\n\"Tufan al-Aqsa\" is a historical campaign whose first results can already be seen and are expressed in the helplessness of the leadership of the occupation and its supporters who show despair and brokenness on their part.\n\nIt is also possible to notice signs of disintegration in the occupation government that foreshadow its defeat and breakdown.\n\nThe criminal enemy who is committing barbaric genocide has failed to achieve any of his stated goals.\n\nOur nation will took revenge on October 7th for the oppression and restrictions imposed on it and it will not back down until it achieves the end of the occupation and the realization of freedom, independence and return.\n\nThe residents of the Gaza Strip sacrificed everything that was dear to them while standing firm and patient, despite all the suffering and pain they experienced.\n\nEven though the enemy is trying to destroy the capabilities of the military wing of Hamas, it shows its heroic deeds as happened yesterday in Rafah. Allah will bring about a victory that is near thanks to the military activists. Victory and freedom for our prisoners are near.\n\nThe hunger in Gaza and especially in the north of the Gaza Strip that we see in the photos coming from the Gaza Strip rests on the shoulders of the international community and especially on the countries that support the murderous occupation.\n\nThe solution to the situation in Gaza will come through negotiations on a comprehensive agreement. Hamas is serious about this.\n\n##\nHaniyeh presents a militant line. He talks about the defeat of the enemy, about an imminent victory and congratulates the people of Gaza for their firm stand. This is in fact the narrative that the Palestinian media outlets are pumping from morning to evening, using quotes taken from the Israeli media. They use this as proof of Haniyeh's narrative and fuel for its continued marketing."}, {"id": "29fc6f9a-f534-444e-9c3a-bfb9892bc746", "channel_id": 1560386984, "url": "", "date": "2024-06-16 10:54", "message": "The Lebanese report a fire in Wadi Hamul near Naqoura in southern Lebanon as a result of Israeli \"fire bombs\"."}, {"id": "0149a388-f401-4b4c-8461-5463cd388100", "channel_id": 1560386984, "url": "", "date": "2024-06-16 10:52", "message": "The name of another soldier who fell yesterday in the explosion of the APC in Rafah was cleared for publication (one of the 8 that the IDF announced yesterday).\n\nMay his memory be a blessing."}, {"id": "d337d9c2-0660-414a-9238-3ed1b082a33a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28987/", "date": "2024-06-16 08:42", "message": "Hezbollah released a video last night documenting the drone attack on the artillery headquarters at the Khirbet Ma'ar base.\n\nSources associated with the Shiite axis claim that an Iranian Shahad 101 UAV was used in the attack and add that the innovation this time is that it has an electric motor that is powered by batteries and not a gasoline engine as was the case in the past.\nAccording to these sources, an electric motor does have a shorter range, but it is quieter and emits less heat, so it is more difficult to detect.\nRegarding the short range, these sources stated that the short distance between the launch point and the target in this arena is perfectly suited for the electric motor."}, {"id": "53a1f599-d4fa-4af3-afa1-1726fb9406b0", "channel_id": 1560386984, "url": "", "date": "2024-06-16 08:38", "message": "The Palestinians report casualties as a result of parachute aid that fell a short time ago on displaced persons' tents near Al-Aqsa University in Gaza City."}, {"id": "147322bc-03a4-4d56-82ad-06b52950e63f", "channel_id": 1560386984, "url": "", "date": "2024-06-16 08:38", "message": "Regarding the circumstances in which the APC was damaged in which 8 fighters fell yesterday in Rafah, I will note that the military wing of Hamas claimed yesterday at noon that in the early morning hours its men ambushed the maneuvering forces in the Saudi neighborhood in West Rafah, in which Hamas operatives fired a Yassin 105 rocket (a type of RPG) at The operating compartment of the D9 bulldozer. According to them, when the APC arrived in order to rescue the victims in the D9, another \"Yassin 105\" was fired at the APC, which caused it to explode."}, {"id": "b98a8335-8e33-4d6f-89e9-82648707a243", "channel_id": 1560386984, "url": "", "date": "2024-06-16 08:37", "message": "Kia, original owner, Gaza. A few scratches."}, {"id": "5c497e33-82a4-4ea2-865d-21c57a525e0a", "channel_id": 1560386984, "url": "", "date": "2024-06-16 08:36", "message": "Further to this, the IDF spokesperson:\n\nThe IDF makes it clear that there is no cessation of hostilities in the southern Gaza Strip, and the battles in Rafah continue. Also, there is no change in the introduction of goods into the Gaza Strip. The axis carrying the goods will be open during the day in coordination with international organizations, for the transportation of humanitarian aid only."}, {"id": "f223b845-66e0-449d-9184-477fea20b0be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28981/", "date": "2024-06-16 08:34", "message": "The president of Chechnya, Kadyrov, arrived in Saudi Arabia yesterday to observe the Hajj."}, {"id": "fe641d51-9bac-4238-90d4-757ee66050aa", "channel_id": 1560386984, "url": "", "date": "2024-06-16 08:34", "message": "Jenin: Channels affiliated with Hamas and the Islamic Jihad in Jenin call on the military operatives not to visit the cemeteries, as is customary for the holiday, and not to appear openly because the IDF drones are gathering information about them especially at this time."}, {"id": "d4806396-1f05-4fa6-9937-070e7fb168e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28975/", "date": "2024-06-16 08:33", "message": "Viewer warning: graphic images of sheep slaughter in the Gaza Strip for the holiday.\n\nThe children stand on the sidelines and watch the act of slaughter, some not yet of school age. Others play with the heads of the sheep after the slaughter. This is an annual event in the Strip."}, {"id": "0070bb37-3d44-4b7f-9c2e-c4faacb3a895", "channel_id": 1560386984, "url": "", "date": "2024-06-16 08:31", "message": "The holiday prayer at the Temple Mount this morning."}, {"id": "a6c119b3-8a7c-4d8a-b9ba-e2d9b517dec5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28970/", "date": "2024-06-16 08:29", "message": "Photos from the morning holiday prayer at the great mosque in Gaza City - al Amri Mosque."}, {"id": "04f9ca41-fdb5-4f17-a746-5526de5f1163", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28968/", "date": "2024-06-16 08:29", "message": "Palestinian channels:\n\n#صور | من صلاة العيد في يافا المحتلة\n\n\"Photos from the prayer (Holiday of Sacrifice - AA) in occupied Jaffa.\"\n\nThe sign in the picture reads: The innocent in Gaza (are) in the heart of Jaffa.\nStop the war!"}, {"id": "ec92e96a-1ddf-4cf2-8bd6-dbd2eef1ff6c", "channel_id": 1560386984, "url": "", "date": "2024-06-16 08:26", "message": "The IDF spokesperson in Arabic announced this morning the suspension of offensive activities every day until further notice between eight in the morning and seven in the evening along the route marked on the attached map, which connects the Kerem Shalom crossing in the south of the Gaza Strip and the European Hospital in Khan Yunis, in order to facilitate the introduction of humanitarian aid into the Gaza Strip.\n\nAccording to the IDF spokesperson, the move was formulated with UN officials in order to help the humanitarian efforts in the field.\nThe change went into effect yesterday, according to the publication."}]