[{"id": "3583e108-28c3-441b-a354-b18b5e47e18c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32551/", "date": "2024-08-16 21:14", "message": "First public statement by a Hamas official since the end of the round of cease-fire talks in Qatar:\n\nSenior Hamas official Muhammad Mardawi told \"Arab TV\" a short time ago that Hamas will not accept any solution that is not compatible with the proposal that was put forth on July 2nd.\n\nMardawi adds that the Palestinian people will not pay the price of the American position covering for Israel and its crimes."}, {"id": "57bbe58d-4b1c-4aef-8b78-f3921d62a9ef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32550/", "date": "2024-08-16 21:11", "message": "Impressive footage of the attack on the towers in Khan Yunis's Hamad neighborhood, in the southern Gaza Strip, earlier today."}, {"id": "02495db3-4a58-4531-a0ce-99c56e3faf00", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32548/", "date": "2024-08-16 18:35", "message": "This is what the Turkish parliament looks like today - at least two members of parliament were injured in a mass melee following the arrest of one of the opposition members.\n\nNot boring in the Turkish parliament.\n\nThanks to follower A for the videos."}, {"id": "36d0fc4e-6534-492b-abea-824094c10726", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73404/", "date": "2024-08-16 18:06", "message": "This is what the Turkish parliament looked like yesterday ahead of Abu Mazen's extraordinary speech."}, {"id": "0379cba4-7102-4e53-9d71-07c51ec46f81", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32544/", "date": "2024-08-16 17:57", "message": "From an aerial refueling exercise conducted yesterday by the Air Force with the participation of F-35 and F-15 fighter jets."}, {"id": "12501440-2f30-4348-abb3-87eabb2a8bc8", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73404/", "date": "2024-08-16 17:54", "message": "The IDF spokesman in Arabic instructed the residents of Beit Hanoun, Manashieh and Sheikh Zayed neighborhoods in the northern Gaza Strip to evacuate the area.\nThis is an area that has already been evacuated recently."}, {"id": "02fe986c-2a29-4b54-b047-ab7b3ab6ca7b", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73404/", "date": "2024-08-16 17:53", "message": "The Palestinians report that the sixth tower in the Hamad neighborhood in Khan Yunis was bombed a short time ago - the IDF guys keep it simple - six towers were evacuated and six towers were attacked."}, {"id": "d091f359-104d-4609-99d0-2a664d75fcc3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32541/", "date": "2024-08-16 17:48", "message": "The Qatari Al Jazeera network from a \"senior source in Hamas\": what we (the mediators - AA) informed us about the results of the talks in Doha does not coincide with what was agreed upon on July 2."}, {"id": "9a035e4f-b9ba-40f0-894d-1fcc233fbe9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73404/", "date": "2024-08-16 15:01", "message": "What will Hezbollah and Iran do now? They are delaying the negotiations further and delaying their response...\nThe Iranian flag of revenge is getting worn out... 16 days have already passed..."}, {"id": "b062cfc7-5d2d-460d-96f7-9813692105d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73395/", "date": "2024-08-16 15:01", "message": "In short: there is a new offer. There is no agreement yet. It's all packaged in exaggerated positive public relations."}, {"id": "d3ba191b-d174-4789-b800-6e664260f3be", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73395/", "date": "2024-08-16 14:59", "message": "A joint statement to the USA, Qatar and Egypt upon the conclusion of the round of talks in Doha:\n\nIn the last 48 hours, senior officials from the three countries acted as mediators in intensive talks with the aim of forging a deal for a ceasefire. The talks were serious, constructive and in a positive atmosphere.\nEarlier today, the USA, with the support of Egypt and Qatar, submitted a proposal to reduce the differences between the parties based on President Biden's proposal and the UN Security Council's resolution of May 31.\nThe proposal enables the closing of the gaps between the parties in a way that will lead to the rapid implementation of the agreement.\nNext week the technical teams will continue the work on the details of the implementation of the agreement.\nThe senior officials of the 3 countries will meet again in Cairo before next weekend in order to reach an agreement based on the proposal given today."}, {"id": "5fd37ad3-4f46-4f9c-b1d7-0db11c7c1b28", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32533/", "date": "2024-08-16 14:58", "message": "Deir al-Balah exodus"}, {"id": "4cfd16a9-dd0d-4cf3-8d6f-260326bebc4e", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73393/", "date": "2024-08-16 14:57", "message": "This is what one of the Gaza channels wrote about the attack on the towers in the Hamad neighborhood:\n\n\"يقصفون شقتك السكنية أمام عينيك أثناء نزوحك\"..\n\nThey bomb your apartment, before your eyes, while you are evacuating....\n\n##\nIt's not easy for them..."}, {"id": "4f50d03a-8838-4ca9-9021-f3b9927951f2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32529/", "date": "2024-08-16 14:51", "message": "Palestinian channels report that 5 towers were bombed in Hamad neighborhood in Khan Yunis."}, {"id": "f2538723-fc49-4e5f-97e4-1a69807e02ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32528/", "date": "2024-08-16 14:49", "message": "Fighter jets attack the towers in Hamad neighborhood in Khan Yunis after the evacuation notice 👆👆"}, {"id": "fdd784e9-e54f-4d8a-ab91-1cb396075ca0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32527/", "date": "2024-08-16 12:59", "message": "A Gazan forced to evacuate following the IDF spokesman's announcement in Arabic, whining while riding a horse-drawn cart:\n\nWe are evacuating now, I swear by Allah that I do not know where we are going... We swear that we do not know where we are going.... May Allah take revenge on them... May Allah have mercy on us..."}, {"id": "743aba4b-b001-47c0-abc0-e3982bd5a588", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73377/", "date": "2024-08-16 12:51", "message": "Gaza sources report the movement of tanks near the Salah al-Din axis, near the Abu Houli junction in the south of Deir al-Balah in the center of the Gaza Strip."}, {"id": "bcc5562a-5ce2-4700-aaff-0ad13627b0e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73377/", "date": "2024-08-16 12:30", "message": "The Palestinians report that the IDF has issued specific evacuation notices to the residents of 6 towers in the Hamad neighborhood in Khan Yunis. These are the towers that are required to evacuate:\nG4\nG5\nE4\nE7\nF7\nF6"}, {"id": "c9937546-0e31-4ff7-9f5f-27a3bb38336b", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73377/", "date": "2024-08-16 12:29", "message": "A Gazan writes:\n\n‏المفروض جماعتنا يشغلوا افيخاي ادرعي مدير مكتب الأعلامي الحكومي في غز ة \nبيحرك الناس بمنشور من مكان لمكان\n\n\"Our guys\" should hire Avichay Adraee (IDF spokesman in Arabic-AA) as the director of the government information office in Gaza.\nIn one post, he manages to move people from one place to another..."}, {"id": "40cc9462-397c-4ac1-9ab0-7bbae5d20a61", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73377/", "date": "2024-08-16 12:26", "message": "Gazan sources: Yesterday and today, in the center of the Gaza Strip, Hamas executed a number of collaborators with Israel."}, {"id": "aa62477f-174e-437c-993b-464c66557f54", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73377/", "date": "2024-08-16 12:25", "message": "The Palestinians report IDF artillery fire in eastern Deir al-Balah over the past few hours as well as in the Qarara area in northern Khan Yunis - something that helps to \"speed up the evacuees\"..."}, {"id": "cf6e2387-41cd-4b5c-a649-7e2176e549dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73377/", "date": "2024-08-16 12:25", "message": "More documentation of the evacuation from eastern Deir al-Balah in the center of the Gaza Strip\n\nPlease note that the evacuation is also carried out from residential areas with buildings that were not damaged by attacks - areas where the IDF has not yet maneuvered."}, {"id": "e59d3e09-fdf2-4875-9f3d-6465f86c85a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32515/", "date": "2024-08-16 12:23", "message": "Evacuation from east of Deir al-Balah:\nPalestinian sources report that thousands of residents of eastern Deir al-Balah in the center of the Gaza Strip have evacuated to the west following the instructions of the IDF spokesman.\n\nThe municipality of Deir al-Balah published a statement that the evacuation announced today by the IDF spokesman will prevent access to 10 water wells and two water reservoirs in addition to the fact that it will endanger residents who will try to reach 3 more water wells. According to the municipality of Deir al-Balah, a serious water crisis is expected to arise in the center of the Gaza Strip."}, {"id": "d6068023-677f-4e1e-ab58-9dca99fe2a5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32514/", "date": "2024-08-16 12:20", "message": "The correspondent of the Lebanese Al-Manar channel (Hezbollah-affiliated) claims that the fire that broke out in the car in the Al-Qasmia area in southern Lebanon did not happen as a result of an attack. He did not specify the cause of the fire."}, {"id": "f2a66e58-0fc5-47b6-af43-1e7b277df1b2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32513/", "date": "2024-08-16 10:48", "message": "Arab media reports about a magnitude 5.2 earthquake that was felt a few minutes ago in Syria, Lebanon and Turkey (the epicenter of the earthquake was in the Hama district in Syria)."}, {"id": "ea2cd4a7-4712-4ab0-99be-8c3dc3bca3c6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32512/", "date": "2024-08-16 10:48", "message": "And so Mr. Salameh was eliminated, according to the IDF spokesperson..."}, {"id": "3682f749-a31d-4dda-b853-1251516d439a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32511/", "date": "2024-08-16 10:47", "message": "Hezbollah officially announces the death of\n\nIbrahim Salameh\n\nHe was killed in a UAV attack with an advantage 👆 in southern Lebanon.\n\nNumber 412"}, {"id": "16d3de02-68d6-4975-be4c-cb50b7fab36b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32510/", "date": "2024-08-16 10:46", "message": "Video of the vehicle that was attacked in Lebanon earlier today."}, {"id": "a46f0a30-615c-40bd-9dd0-5f54cbd7573d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32509/", "date": "2024-08-16 09:59", "message": "Lebanese sources are reporting an Israeli UAV attack a short time ago on a vehicle in the Qasmia area, near the village of Barj Rahal in the Tyre governorate in southern Lebanon.\nOne injured. The vehicle was passing in the area between a UNIFIL post and a Lebanese army post."}, {"id": "7e3c97a2-4173-458d-bb1e-0fe86900ba94", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32506/", "date": "2024-08-16 09:56", "message": "It's always nice to see that \"celebs\" also cooperate and take part in popular programs in the Israeli prison:\nThe Palestinian member of parliament on behalf of Hamas, Sheikh Mahmoud Khatib, from Bethlehem, was released from prison in Israel yesterday after 10 months.\nFaiz Mesek from Hebron, who went straight to his barber, and the red-haired Abdullah Abu Shahidm, from the village of Abu Shahidm in the Ramallah governorate, were also released and honored with before and after pictures.\n\nAll stuck to the prison diet."}, {"id": "e959af51-d14e-474c-af67-51d9139c89b4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32505/", "date": "2024-08-16 09:54", "message": "Ahmed Abu Damos, the East Jerusalem lawyer who managed the largest Palestinian Telegram channel (about a million followers), in which he regularly posted harsh inflammatory words against Israel.\nAs mentioned, he was released yesterday👆 after ten months of administrative detention. Attached are photos of him before and after."}, {"id": "1c04f2be-e8b6-4662-97af-30ccbe3d3ac0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32504/", "date": "2024-08-16 09:29", "message": "Meanwhile, while Hezbollah is busy with propaganda videos, unofficial Lebanese channels report that Ibrahim Salameh, a Hezbollah operative, was killed in the Israeli strike earlier today in Aitaroun in southern Lebanon."}, {"id": "4ceb5673-3154-4559-8ddc-1ea19830a25d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32503/", "date": "2024-08-16 09:28", "message": "Hezbollah has released a polished propaganda video lasting over four minutes, showcasing for the first time the underground facility \"Imad 4,\" named after Imad Mughniyeh, the Hezbollah commander killed in Syria in 2008. \n\nThe facility appears to be dug into rocky terrain and is spacious enough to accommodate truck movements. The video features missiles, rockets, and launch systems, accompanied by familiar incitement from Nasrallah with Hebrew subtitles.\n\nHezbollah aims to enhance its image in an effort to deter Israel from starting a war against it. Hezbollah was considerate enough to also release a slimmed-down version for easier viewing on mobile devices."}, {"id": "8d44611f-02ec-4e0f-bc5e-a902db080ebe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32502/", "date": "2024-08-16 09:27", "message": "The military wing of Hamas recently released a video claiming to show a suicide drone being launched towards a building in Khan Younis."}, {"id": "2702773b-2e81-4367-b9aa-d713e9139413", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32501/", "date": "2024-08-16 09:26", "message": "Lebanese channels report casualties in the IDF attack in the Aitaroun area in southern Lebanon."}, {"id": "f156a454-39b6-4a66-a56a-e8447758dbf7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32500/", "date": "2024-08-16 09:25", "message": "IDF spokesperson in Arabic recently issued new evacuation instructions for residents of the Gaza Strip:\n\n1. Residents of the eastern neighborhoods of Deir al-Balah (central Gaza, an area where the IDF has not yet maneuvered) are requested to evacuate.\n\n2. Residents of Qarara, Mawasi, Jalaa, Hamed, and al-Nasser in northern Khan Younis are requested to evacuate.\n\n3. Due to the evacuation in Khan Younis, the humanitarian area is being reduced (the section highlighted in red on the map at the expense of the humanitarian area marked in yellow).\n\n##\nAn interesting evacuation, in light of the ongoing talks today in Doha..."}, {"id": "53e1e41a-8a6b-41df-85e0-a20081dbfb2e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32494/", "date": "2024-08-16 09:23", "message": "The Ukrainian invasion of Kursk in Russia: Ukrainian civilians are leaving reviews on Google Maps for sites in Kursk...\n\nThe Ukrainians greatly enjoy sticking it to the Russians."}, {"id": "6fe3f976-db1a-45fa-99ce-dbe2dfe9208a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32493/", "date": "2024-08-16 09:21", "message": "Hamas official Hussam Badran on the negotiations in Doha:\n\n“Hamas views the talks on prisoner release and a ceasefire from a strategic perspective, aiming to end the aggression against Gaza.\n\nFrom Hamas's perspective, the current talks are part of a plan to implement what has already been agreed upon in the past.\n\nAny agreement reached must include a comprehensive ceasefire, a full withdrawal from Gaza, the return of displaced persons to their homes, and the reconstruction of the strip, alongside a prisoner exchange deal.”"}, {"id": "e46c983b-265b-4c30-9709-b16945ccf468", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32492/", "date": "2024-08-16 09:19", "message": "3. \"When I'm president, we will deport the foreign Jihad sympathisers and we will deport them very quickly, and Hamas supporters will be gone. \n\nIf you hate America, if you want to eliminate Israel, then we don't want you in our country, we really don't want you in our country.\n\nI will ban refugee settlements from terror-infested areas like the Gaza Strip, and we will arrest the pro-Hamas thugs that vandalized federal property and make life very difficult in this country for a lot of people.\""}, {"id": "3f00e5cf-2d77-40a0-9987-18ad21390900", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32491/", "date": "2024-08-16 09:15", "message": "2. \"When I'm back in the oval office I will support Israel's right to win its war on terror. They have a right to win that war. And I will give Israel the support that it needs to win, but I do want them to win fast. Wouldn't that be nice? If they could win fast. We have to let them win fast.\n\nWe will restore stability and peace in the Middle East and we will be sure that it'll be peace through strength.\""}, {"id": "aacaa6c8-091c-4622-893f-aa87153530ce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32490/", "date": "2024-08-16 09:12", "message": "1. \"Israel is a tiny little spot compared to these giant land masses. Surely a tiny spot. I actually said - is there any way of getting (more)... So tiny.\""}, {"id": "bd0d81e4-88cb-4cfe-8491-cecfff29f8ee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32489/", "date": "2024-08-16 09:10", "message": "Trump has stirred up social networks with his remarks at a conference against anti-Semitism tonight, with the Israeli flag behind him:\n\n1. Israel is so tiny... is there any way of getting (more).\n\n2. Israel should be allowed to defeat terrorism. It has a right to do so. It would be nice if it happened quickly. I will support that.\n\n3. I will deport and arrest all Hamas and Jihad supporters in the US\n\nHere are the full quotes 👇👇"}, {"id": "4865adb1-290d-4926-a5b0-b7dd78b889a8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32488/", "date": "2024-08-16 03:39", "message": "Following Abu Mazen's announcement that he will arrive in the Gaza Strip, a Gazan writes on social media:\n\nاي حد جاي ع غزة حتى لو الريس هاتلنا شباشب وشامبو معك\n\nFor everyone who comes to Gaza, even if it's the Rais (the President, Abu Mazen - AA), bring us some slippers and shampoo..."}]