[{"id": "d170918b-790a-4d61-babc-c72340df7fee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32203/", "date": "2024-08-10 20:47", "message": "A few points about the attack this morning at the \"a-Taba'een\" school in Gaza City which made a lot of noise in Arab and foreign media after the Palestinians claimed that 100 people were killed there as a result of bombs weighing a ton....\n\n1. The IDF spokesman published the names of 19 terrorists from Hamas and the Islamic Jihad who were killed on the spot. There are 5 more, including a Brigadier General from the Islamic Jihad's central camp - whose elimination has not yet been verified.\n\n2. Most of the names of the terrorists published by the IDF spokesperson appear in the list of names of the 33 dead published by unofficial Palestinian channels.\n\n3. The Hamas information office claimed that about 100 people were killed in the early morning attack, but until this time, and unusually, the Palestinian Ministry of Health in Gaza has not published the number of dead - I do not know of similar incidents where the Gaza ministry waited so long with the number of dead.\n\n4. Even after the names of the terrorists were published by the IDF spokesman, Hamas continues to lie and claim that there were no armed men in the compound and that 100 people were killed.\n\n5. The Palestinian claims that one-ton bombs were used are false - it can be seen in the photo of the IDF spokesman and in Palestinian documents that there are no craters in the school - unlike on the sites where such bombs fell in the past.\n\n6. If Hamas claims that there are 100 dead, presenting their names and ID numbers would honor them... and we can investigate in depth the circumstances of their deaths... 67 names are missing..."}, {"id": "6b15a866-62a9-4894-99c2-9c197440a166", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72984/", "date": "2024-08-10 20:42", "message": "Lebanon: The moments of the attack on the jeep of Samer al-Hajj,👆 the security officer of Hamas, in Ain al-Hilweh yesterday at the southern entrance to the city Sidon."}, {"id": "d43e7342-6742-48de-87a6-eeccfb40a7d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32201/", "date": "2024-08-10 20:40", "message": "The Lebanese Al Mayadeen channel reports that the Lebanese army has suspended its patrols with UNIFIL in southern Lebanon following an incident with a patrol by the French force in UNIFIL in the area of ​​Kfarhamam in southern Lebanon.\nAccording to Lebanese sources, during a joint patrol conducted today by the Lebanese army and the French force, the French jeep deviated from the agreed travel route and entered \"private territory\", which caused a confrontation between the Lebanese army force and the French force.\nThe French patrol then returned to the normal route and after a few minutes the \"private area\" to which the French jeep diverted was attacked by an Israeli aircraft.\nThe commander of the Lebanese army had to answer for the issue."}, {"id": "ce286d2a-f898-4da4-a266-8f0b6fc1b7f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32200/", "date": "2024-08-10 20:34", "message": "The new housing solutions in the Strip - old pipes.\nThe breeze is included in the price."}, {"id": "74b99152-c49d-45dd-8931-03946e1c7624", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32199/", "date": "2024-08-10 18:40", "message": "Hezbollah in an official announcement: in response to yesterday's elimination in Sidon, we attacked the Michve Alon base with suicide drones."}, {"id": "e9b1e16d-d20b-4ea4-8dab-87cda340708a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32198/", "date": "2024-08-10 18:40", "message": "This evening, after an evacuation warning, the IDF attacked a-Sharif tower in the north of Nuseirat in the center of the Gaza Strip."}, {"id": "933c3672-b9d7-4485-b08c-88d58232d078", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32197/", "date": "2024-08-10 17:53", "message": "I'll just mention that senior Hamas official Izzat al-Risheq officially stated that there were no armed men at the Taba'een school...\nMaybe they left their weapons at the door (:"}, {"id": "a9c11d27-3ba1-4a89-9ddb-fcf72914c7ea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32194/", "date": "2024-08-10 17:52", "message": "Joint IDF and ISA announcement:\n\nToday (Saturday), the IDF and ISA struck terrorists operating in a Hamas command and control center, which was embedded inside a mosque in the Al-Taba’een school compound. Following an intelligence investigation, it can be confirmed at this time that at least 19 Hamas and Islamic Jihad terrorists were eliminated. These terrorists operated in order to advance and carry out attacks against IDF soldiers and the State of Israel from inside the compound. \n\nThe strike was carried out using three precise munitions, which, according to professional analysis, can not cause the amount of damage that is being reported by the Hamas-run Government Information Office in Gaza. Furthermore, no severe damage was caused to the compound where the terrorists were situated.\n\nPrior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of a small warhead, aerial surveillance, and intelligence information."}, {"id": "3d8ef93e-676d-4e5f-8b8e-8cc856b5dd71", "channel_id": 1560386984, "url": "", "date": "2024-08-10 17:15", "message": "A Syrian refugee scoffs at Nasrallah's rhetoric and Hezbollah's clear inferiority complex against Israel\n\nSays the lovable Syrian tiktoker in an amusing imitation of the Lebanese accent:\n\nNasrallah said: \"Welcome, Israel, to southern Lebanon\".\nHe said: \"We are ready.\"\nThe Israeli planes fly at a low altitude (over Lebanon) and do whatever they want.\n\nWith a Kalashnikov you shoot at a plane to shoot it down?\n\nWhat did he (Nasrallah) say? \"We are ready for Israel. For war\"\n\nYou coward, you can't even shoot down low flying planes...\nWhy? Because they will destroy you...\nAnd you say \"we are ready for war\"? What kind of war are you talking about when the planes do what they want...\nI don't know what to say anymore.\nYou have become an object of ridicule...\nI swear by Allah that you have become an object of ridicule...\n\nWhoever posts the most mocking reaction to Hezbollah in the comments will appear in my next video.\"\n\n##\nMany in the Middle East see things differently than people Israel with regard to Nasrallah..."}, {"id": "0b575ca4-6eac-43ae-b444-a0693ef9bb35", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32192/", "date": "2024-08-10 15:09", "message": "Spain, Kuwait and France join the countries condemning this morning's attack in Gaza."}, {"id": "0a93fc10-ad9a-4383-8c40-b0dd9bf787a8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32191/", "date": "2024-08-10 15:09", "message": "Lebanese channels: Israeli fighter jets break the speed of sound in the skies of Beirut."}, {"id": "035fc136-6bfe-48ea-a453-1f7de0f504f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32190/", "date": "2024-08-10 15:09", "message": "It is interesting to see that precisely the denial by senior Hamas officials that there were no armed men at the school that was attacked in Gaza causes Gazans to discuss the names of the dead who are military operatives, which Hamas is hiding - and were the reason for the attack."}, {"id": "fd70e03c-5d7c-4edd-839c-fa6eeb027841", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32189/", "date": "2024-08-10 15:08", "message": "A Gazan replies to Hamas officials:\n\nAshraf al-Ghafari, a commander in the military wing of Hamas, was also killed today in an attack on \"a-Taba'een\" school. Why are they establishing a military center among the displaced? we want to live."}, {"id": "6dc4bf1c-827d-49dc-a360-00c37583a185", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32188/", "date": "2024-08-10 15:06", "message": "Silver medal 🥈 for the artistic gymnastics team of Israel in the Olympics.\n\nWell done❤️🇮🇱"}, {"id": "164baf6a-0e0f-4ae7-aa9e-5294dc974713", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32187/", "date": "2024-08-10 13:19", "message": "Belgium, Syria, Oman, Turkey, the United Arab Emirates and Iraq join the parade of countries condemning the Israeli attack on the school in Gaza."}, {"id": "cd5370bc-f77f-43a5-82cf-7c342dd3857e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32186/", "date": "2024-08-10 12:30", "message": "Gazan sources identified with Fatah: In this morning's attack on \"a-Taba'een\" school, Dr. Ashraf al-Ghafari, a senior member of Hamas and commander in its military wing, who established a military camp at the school, was killed."}, {"id": "1d364a63-58b7-48af-84e2-a8186d64039e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32185/", "date": "2024-08-10 11:12", "message": "As of this hour, unofficial Palestinian channels have published a list of 32 dead from the attack at the \"a-Taba'een\" school in Gaza City.\n\nThe Palestinian Ministry of Health in Gaza has not yet released an official number of casualties even though more than 9 hours have passed since the attack occurred."}, {"id": "2e607c27-4bfa-4ab7-9a64-059e4aad8d1a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32184/", "date": "2024-08-10 10:41", "message": "Senior Hamas official Izat al-Rashak, on the attack on the school this morning in Gaza:\n\n\"There were no armed men at the \"A-Taba'in\" school. The enemy army is lying again and inventing pretexts for attacking civilians.\nThe strict policy according to which the fighters of all the factions operate is not to be found among the citizens in order to prevent them from being harmed by Zionist attacks.\"\n\n##\nIzzat al-Risheq adopts a strict policy of: if you have to lie, then lie until the end...\n\nI don't know what they declared and what they didn't declare, he left the base at five... (:"}, {"id": "3afc017f-4eaa-4d77-a42d-829dd9719f91", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72960/", "date": "2024-08-10 10:17", "message": "A series of condemnation messages from Arab countries for the early morning attack at the \"a-Taba'een\" school in Gaza City.\nBesides the foreign ministries of Jordan and Egypt, condemnations were also published by the foreign ministries of Qatar, Saudi Arabia, Lebanon and Iran.\nAyatollah Ali al-Sistani, the highest authority in the Shiite world (residing in Iraq) published a statement (according to the Palestinians, the attack was carried out in the middle of the dawn prayer)."}, {"id": "b46fe50b-98e3-47eb-941e-9f6e46b3aabd", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72960/", "date": "2024-08-10 09:54", "message": "Additional documentation published by the Gaza Shahab news agency, from \"a-Taba'een\" school in Gaza City - the building is relatively intact.\n\nThe Civil Defense in Gaza claimed that the IDF used an \"American bomb weighing a ton\" when it attacked the school.\nThis is not what a place that was attacked with a one-ton bomb looks like."}, {"id": "d6f05db9-08c5-44cd-94b0-047ecfd91090", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72960/", "date": "2024-08-10 09:53", "message": "Documentation from \"a-Taba'een\" school that was attacked this morning in Gaza City.\nIn the photos you can see that there was no significant damage to the building itself."}, {"id": "e7da5b1a-53e8-4fb5-9985-8fbe188e9051", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32178/", "date": "2024-08-10 09:37", "message": "Brazil neighborhood in Rafah, before and after."}, {"id": "19ba4b0c-e5b8-4b04-b34f-e1726982bb57", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32174/", "date": "2024-08-10 08:53", "message": "Documentation attributed to the attack on \"a-Taba'een\" school, according to Palestinian channels.\nAccording to these sources, the attack on the school was during the Fajr prayer and the area that was attacked was the place of prayer.\n\nIt was reported from Al-Mamadani al-Ahli Hospital in Gaza that they have received 80 bodies so far from the incident and that 70 of them have been identified."}, {"id": "cc229626-8a2a-4c25-a093-7207d66bafb3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32172/", "date": "2024-08-10 08:24", "message": "The Palestinians report that identified among the dead this morning at the \"A-Taba'een\" school in Gaza City were Sheikh Muhammad Abu Saada, the head of the Hamas waqf in Gaza, as well Yousef Kahlout, professor of Arabic language studies at the Islamic University who was also a member of Hamas."}, {"id": "ce131fe3-418a-402b-936d-b02afb41d2c4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32171/", "date": "2024-08-10 07:42", "message": "Hamas Information Bureau:\nThe attack this morning at the \"A-Taba'een\" school caused the death of more than 93 people, including 11 children and 6 women.\n\n##\nThe foreign ministries of Jordan and Egypt issued condemnation notices. The Jordanian Foreign Ministry accused Israel of trying to sabotage the efforts to renew negotiations for the deal due to the timing of the attack."}, {"id": "bde44626-2f8c-4746-938f-d1f9bcde3131", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32170/", "date": "2024-08-10 07:32", "message": "Also regarding the fleeing of the Shiites from Dahieh in Beirut - the municipality of Falougha, located in the area of ​​Abda, east of Beirut, the majority of whose residents are Christians and Druze, yesterday issued a warning to the residents not to rent properties to non-residents except after a careful check of their identity, with the assistance of the municipality.\n\n###\nIn the municipality of Falougha they fear trouble that the \"Dahieh immigrants\" will bring with them."}, {"id": "c3515f1c-7c03-4892-b0b9-572379911dc6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32169/", "date": "2024-08-10 07:31", "message": "##\nIt seems that contrary to the expectations of Nasrallah, who in my estimation is not reading the map correctly this time, it is precisely his own people, the Shiites, in Dahieh, Hezbollah loyalists, who are supposedly \"standing on their feet\" in anticipation of a response to the assassination....\n\nOr as we say:\nالسحر ينقلب على الساحر\nThe magic turns on the magician\n\n#على_اجر_ونص"}, {"id": "da09e48b-e9b6-41a6-a354-b2d106fde736", "channel_id": 1560386984, "url": "", "date": "2024-08-10 07:29", "message": "Lebanon: Mass flight of residents from Dahieh, the Hezbollah stronghold in Beirut, due to fear of war\n\nThe Lebanese Al-Akhbar newspaper (affiliated with Hezbollah!) this morning publishes an article describing the mass desertion of Lebanese from the Dahieh area, which is considered a disaster-prone area in the event of a war, to \"safe areas\" that are not affiliated with Hezbollah.\nThere is an influx of the residents of Dahieh to northern Lebanon, to eastern Lebanon and also to the Christian neighborhoods in Beirut - the \"safe areas\".\nAccording to the article, the Israeli attack in Dahieh, which until then was considered an \"out of combat\" area, surprised the residents and shattered the assumption that Israel would not attack there.\nIt was also reported that some residents are in Dahieh during the day but sleep elsewhere. A noticeable decrease in economic activity in Dahieh was also reported.\nAccording to the article, the phrase \"after the war\" became commonplace among the citizens in the markets in Dahieh."}, {"id": "cac0919c-9d3a-40d4-9541-e8844de8968a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32167/", "date": "2024-08-10 07:23", "message": "Syria: UAV attack an American base\n\nSyrian media reported tonight that 3 UAVs were launched near the border towards the American air base Kharab al-Jir in the Hasakah district in eastern Syria.\nAccording to the report, one UAV was shot down and two exploded in the area of ​​the base and caused a fire.\n\nAccording to unofficial American sources, there were no casualties in the attack."}, {"id": "9e6120d3-a079-41d8-bfec-de03aa89ece3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32166/", "date": "2024-08-10 07:21", "message": "The IDF spokesman's comment on the matter was published about an hour after the attack this morning:\n\nIDF: A short while ago, directed by IDF and ISA intelligence, the IAF precisely struck Hamas terrorists operating within a Hamas command and control center embedded in the Al-Taba’een school and located adjacent to a mosque in Daraj Tuffah, which serves as a shelter for the residents of Gaza City. \n\nThe command and control center served as a hideout for Hamas terrorists and commanders, from which various attacks were planned and advanced against IDF troops and the State of Israel. \n\nPrior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of precise munitions, aerial surveillance, and intelligence information.\n\nThe Hamas terrorist organization systematically violates international law and operates from within civilian shelters, brutally exploiting the civilian population and institutions as human shields for their terror activities."}]