[{"id": "5a64e391-4fb8-4829-8385-4d555dd759e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32890/", "date": "2024-08-22 13:48", "message": "Hezbollah supporters online are furious.\nThe reason: the attached video, which was taken in the village of Deir Mimas in southern Lebanon, reveals the point from which Hezbollah operatives fired rockets at Israel today.\n\nThe videographer is heard cursing (from the bottom of his heart) the Hezbollah operatives who launched the rockets.\n\nHezbollah supporters revealed the name of the photographer, his picture and his personal number (he is a soldier in the Lebanese army, a member of the Christian community) online and called to \"execute the Zionist collaborator\".\n\nHezbollah supporters also complain on social media that even residents in the village of Ramish (beyond the village of Deir Mimas) who are not affiliated with Hezbollah, but oppose it (Christians, for example), submit reports to the IDF so that the IDF will attack the villages next to them - which are affiliated with Hezbollah and will not attack the Christian villages in southern Lebanon.\n\nThanks to follower M."}, {"id": "bd169773-bf37-4c9c-a190-05cc67255310", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32889/", "date": "2024-08-22 13:19", "message": "The destruction of the Rafah Municipality building, courtesy of Company B, Battalion 605."}, {"id": "eccc8b54-9817-4fb2-bfa4-9a767414049f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32888/", "date": "2024-08-22 13:17", "message": "The Lebanese Ministry of Health with official data:\n\n564 dead in Lebanon since the beginning of the war. The number of wounded during this period stands at 1848."}, {"id": "be42ab3f-ed06-429f-b4de-2021be74d89a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32887/", "date": "2024-08-22 13:17", "message": "President Putin claims: Ukrainian forces tried to attack the nuclear power plant in Kursk."}, {"id": "49658fe5-7dcf-4c00-96ed-e17066c83aaa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32886/", "date": "2024-08-22 13:16", "message": "The advance of the Ukrainian army inside the territory of Russia\n\nThe Russian governor of the Kursk region reports that 130,000 of the Russian citizens of the region have been evacuated from it and now only 20,000 people remain."}, {"id": "2c5e9107-1bd6-40f4-90c4-6af83a3f9aa5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32885/", "date": "2024-08-22 11:21", "message": "Deir al-Balah Municipality: Following the latest evacuation instructions from the IDF, approximately one hundred thousand residents evacuated from Deir al-Balah."}, {"id": "e1087ad9-9cfa-4084-8580-0284a0c4b1d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32884/", "date": "2024-08-22 11:21", "message": "Chicago: The participants of the Democratic Party convention are also a little tired of the pro-Palestinian demonstrations - they cover their ears as the names of the Palestinian children killed in the war in Gaza are read through a megaphone."}, {"id": "936e0c34-2700-40ed-a138-56d00df85cca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32883/", "date": "2024-08-22 11:15", "message": "Today, at the age of 93, Faruq al-Qaddumi (Abu Lutf), one of the founders of the Fatah movement and one of the movement's most prominent opponents of the Oslo Accords, died in Jordan."}, {"id": "c44df59e-022c-4fe8-9288-9e00693cb35c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32878/", "date": "2024-08-22 11:11", "message": "The Palestinians report that the IDF activity in the Tulkarm refugee camp that began early in the morning continues.\nAs you will see in the attached videos explosive charges are activated against IDF bulldozers that are \"leveling\" the infrastructure in the camp."}, {"id": "673bacae-f2de-4031-93a6-02ca12ed36c4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32877/", "date": "2024-08-22 11:06", "message": "The tension and fear of escalation are fraying the nerves of Lebanese citizens.\n\nThe Prime Minister of Lebanon issued a statement following this: I call on politicians and members of the media not to publish news and interpretations that cause panic among the Lebanese and heat up the atmosphere."}, {"id": "972a803d-af55-48fd-90a1-2d26edeea610", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32874/", "date": "2024-08-22 11:05", "message": "Posters praising the suicide bomber Jaafar Mana from the attack in Tel Aviv, were hung in Nablus, where he was from."}, {"id": "c4cbcc75-90da-440d-8012-f833627ff11a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32873/", "date": "2024-08-22 11:03", "message": "China calls on its citizens to urgently leave Lebanon."}, {"id": "68513853-d3a8-4c6b-b9dd-10db7be9140d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32872/", "date": "2024-08-22 11:03", "message": "Wasim Al-Anbar, Muaweeya Haj Ahmed and Imad Shrim, killed in the IDF aircraft attack in Tulkarm this morning - before and after."}, {"id": "458e6609-494f-4c1f-925d-4a11200f148b", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73808/", "date": "2024-08-22 08:33", "message": "The authorities in Iran have issued an official denial to the Fars news agency's report regarding the results of the investigation committee into the circumstances of the helicopter crash of the Iranian president, Raisi.\n\nThe Fars news agency removed the report as a result."}, {"id": "ee012413-def2-430f-a6bc-29e7bac71708", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73808/", "date": "2024-08-22 08:32", "message": "The chairman of the PLO, Abu Mazen, published a presidential memorandum regarding the arrival together of the Palestinian leadership in Gaza in order to end the war, start the reconstruction of Gaza and end the internal Palestinian division under the umbrella of the PLO - \"the legal representative of the Palestinian people\"."}, {"id": "221fbc89-3c02-4a62-ac0f-44b5358d773c", "channel_id": 1560386984, "url": "", "date": "2024-08-22 08:31", "message": "IDF Spokesman:\n\nThe forces of Division 162 have eliminated about 50 terrorists in the Rafah area in the last day; An ammunition depot located near a Hamas military site that was previously used as a school in Gaza City was attacked from the air"}, {"id": "2df1cadc-7239-4eaa-8482-abafb662a163", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73808/", "date": "2024-08-22 08:30", "message": "The military wing of the Islamic Jihad confirms that Jafar Mana of Nablus is the suicide bomber who carried out the attack in Tel Aviv, for which the military wing of Hamas and the Islamic Jihad accepted joint responsibility."}, {"id": "9024eac6-cca5-4012-ba19-d92acdb9a81b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32867/", "date": "2024-08-22 08:29", "message": "The Palestinian Ministry of Health in the West Bank:\n3 killed in a UAV attack in the activity of the Israeli army in Tulkarm.\n\n##\nPalestinian sources report that an Israeli aircraft attacked the building of the Qaqun Association in Tulkarm and there the three were killed."}, {"id": "5cd2983f-45cb-4c3e-85c1-f93e6da136b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73808/", "date": "2024-08-22 08:26", "message": "A video I found circularing this morning on an Iranian government propaganda channel...\n\nThe smile really got to them."}, {"id": "a02e8cb6-ac36-432b-8dc6-4edc51922c69", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73808/", "date": "2024-08-22 08:25", "message": "More from the visit of President Putin 👆 to the mosque in Grozny, the capital of Chechnya, together with the president of Chechnya, Kadyrov:\n\nPutin kisses the Quran and \"gets\" to read part of verse number 17 of Surah al-Anfal:\n\nWhen you shoot, it is not you who shoots, but Allah who shoots...\n\nThis is a verse that is very popular among Muslims when launching rockets, missiles, etc...\n\nThanks to follower D for the video."}, {"id": "83a40621-faec-4110-917b-b195878ad121", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73805/", "date": "2024-08-22 08:19", "message": "Iran: After winning the confidence of the parliament, the government of President-elect Masoud Pezeshkian held its first meeting."}, {"id": "8d65142d-b673-41da-8a97-22a4341297d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32860/", "date": "2024-08-22 08:18", "message": "The results of the IDF's activity in the Tulkarm refugee camp early in the morning."}, {"id": "bf0e735c-b803-4572-8e6e-cfe7d9c4f3b3", "channel_id": 1560386984, "url": "", "date": "2024-08-22 08:17", "message": "Palestinian sources: Israel informed the family members of Jafar Mana from the city of Nablus that their son was the one who carried out the suicide attack in Tel Aviv a few days ago."}, {"id": "ee156731-ae9e-40a8-bcb1-c8b73bfee29b", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73808/", "date": "2024-08-22 08:16", "message": "Official Gaza channels, identified as Hamas, claim:\n\nIsraeli special forces, wearing the uniforms of the Palestinian Civil Defense in Gaza, killed Gazans and arrested others when they returned from the Rafah area."}, {"id": "049bc72f-ef9f-4f65-a5bd-6898664a3717", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32860/", "date": "2024-08-22 08:15", "message": "Trump on burning the American flag near the Democratic Party convention:\nIt is disgraceful to see the American flag on fire and the \"desecration\" of police vehicles. Congress needs to get to work so that anyone who burns the American flag gets a year in prison."}, {"id": "c4ee00c1-c7a4-463d-bdff-0dd122d44e9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32856/", "date": "2024-08-22 08:13", "message": "Chicago: Outside the Democratic Party convention, a masked American, wearing a ribbon of the military arm of Hamas on his forehead, explains in English without a foreign accent, that he supports Hamas and its actions on October 7th while simultaneously attempting to deny most of the atrocities committed."}, {"id": "b5c9eb93-ee70-47d5-b7bb-8ba3b150493f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32855/", "date": "2024-08-22 08:09", "message": "US Central Command updates:\nThe American aircraft carrier Abraham Lincoln arrived in the Middle East."}, {"id": "3d51208b-da9c-480a-a90d-30cabc8ebbae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32850/", "date": "2024-08-22 08:08", "message": "A wave of early morning attacks in southern Lebanon\n\n Lebanese sources report that shortly after one o'clock in the morning, Israeli warplanes attacked 8 targets throughout southern Lebanon in the following locations:\n\nAl-Khiam\nKafrkela\nKafrchouba\nMhaibib\nRamiyeh\nAyta ash-Shaab\nKaouthariyet El Saiyad\nZibqin \n\nUnofficial Lebanese sources report two deaths in this wave of attacks.\n\n Additional sources in Lebanon claim that UNIFIL received advance warning about the wave of attacks from Israel and therefore activated an alert at its bases in southern Lebanon.\n\nIDF Spokesperson:\n\nOvernight, the IAF struck Hezbollah terror targets in more than 10 different areas in southern Lebanon. The targets included weapons storage facilities, military structures, and a launcher used by the Hezbollah terrorist organization to carry out terror attacks against the State of Israel."}]