[{"id": "f64a3c33-59a4-46d0-ba49-d2ebbec62e02", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26634/", "date": "2024-05-03 13:41", "message": "An F-35 plane landing vertically on the Burj Al Arab Hotel in Dubai."}, {"id": "497aaee1-d654-4aec-ab60-37457ec930d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26633/", "date": "2024-05-03 13:36", "message": "Paris: French security forces break into Sciences Po the Institute of Political Science to break up an anti-Israel demonstration by the students there."}, {"id": "26633802-e5d3-45ae-944b-b80f21bbeae6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26632/", "date": "2024-05-03 13:29", "message": "The Houthi military spokesman:\n\nWe announce, under the direction of Commander Abdelmalek Alhouthi, the fourth phase of our activities:\n\nWe will hit all the ships whose destination is Israel's ports, wherever we can get our hands on them (that is, the innovation is that the activity is not limited by location - AA).\n\nIf Israel starts an operation in Rafah, all the ships of the companies that have any connection to Israeli ports will be affected (for example, if a certain shipping company works with Israeli ports, all its ships, even those whose destination is not Israel, will be affected - AA)."}, {"id": "a1b97097-9f71-4798-b95e-7e30ad112af5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26631/", "date": "2024-05-03 13:27", "message": "A few points to note:\n\n1. Hezbollah said anyway that it will stop the fire as soon as there is a ceasefire in Gaza.\n\n2. The French proposal does not answer the question of implementation and enforcement. What do we do if Hezbollah does not vacate? What happens if in six months Hezbollah returns south of Litani River? After all, the non-enforcement of Resolution 1701 at the end of the Second Lebanon War is what brought us to the current situation.\nEnforcement is the heart of the matter in the Lebanese arena. What enforcement measures are there and what are the sanctions for violations by Hezbollah?\n\n3. Israel was flying in the skies of Lebanon before the war, now it will have to commit that it will stop...\n\nThe bottom line, the proposal creates a situation where Israel will be left with just a paper in hand, without any deterrence and with Hezbollah's military force threatening the residents of the north.\n\nFor the Americans and the French this is excellent. This is a disaster for Israel."}, {"id": "64406f5b-af40-412a-8f59-bb1506e93c04", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26630/", "date": "2024-05-03 13:15", "message": "About 100,000 Palestinians have left the Gaza Strip since the beginning of the war\n\nThe Palestinian ambassador in Egypt: since the beginning of the war and until April, 85 thousand Palestinians left the Gaza Strip for Egypt through the Rafah crossing.\n\nTaking the month of April into account, it can be estimated that about one hundred thousand Palestinians left the Strip since the beginning of the war."}, {"id": "55396763-c729-403d-8cb5-7d4179bcb21f", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65962/", "date": "2024-05-03 13:11", "message": "A must watch:\n\nStudents from the \"Free Palestine Army\" charge Portland police officer with shields made from trash cans.\n\n##\nNot the sharpest tools in the shed..."}, {"id": "741dedfa-99d4-4bbb-948f-3a4a76788f95", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26628/", "date": "2024-05-03 13:11", "message": "Fox News: The Iranian flag was raised by the students at the University of Irvine in California.\n\nIran is offering scholarships to students who will be expelled from US universities following the protests."}, {"id": "fe0c76e3-caa3-4607-bca9-2a2b08761d2b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26627/", "date": "2024-05-03 13:06", "message": "Footage from the last couple of days of an \"evening prayer\" at UCLA University in California, is also provoking harsh reactions among Americans on Twitter."}, {"id": "14f2a731-69e4-401e-8a07-0623de49cf97", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26626/", "date": "2024-05-03 13:05", "message": "An image that received millions of reactions on Twitter under the title: American students convert to Islam.\n\n###\nHow nice of them to take their shoes off... but why stop there? Where are the Abayas for the young women in the group to cover all their bare body parts..."}, {"id": "62cb39ef-69a4-477d-9cd0-4d6de850bdca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26625/", "date": "2024-05-03 11:05", "message": "Reuters from the Turkish Minister of Commerce:\n\nThe suspension of trade with Israel will continue until a permanent cease-fire in Gaza and until Israel allows all aid into the strip. \n\n##\nTurkey has de-facto joined the Shiite axis - like the Houthis... they are harming the Israeli economy until a ceasefire is reached. The Sultan became a Houthi pirate.\n\nIsrael should remember this when Turkey wants to resume trade between the countries."}, {"id": "599176d4-48dc-4704-a9ee-0551969c16db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26624/", "date": "2024-05-03 11:04", "message": "The Shia militias in Iraq claim:\nYesterday afternoon (May 2nd) we launched two cruise missiles from Iraq at a target in Tel Aviv and at a target in Be'er Sheva.\n\nThe militias in Iraq also claim that they attacked an Israeli target in the Dead Sea early this morning \"with appropriate weapons\".\n\n###\nSources of the Lebanese al-Mayadeen claim that the Iraqi cruise missiles were launched at the Glilot Base in Tel Aviv and the Avraham Base in Be'er Sheva."}, {"id": "768ddf40-4f55-49e3-bb51-e6ac4fd2f0d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26623/", "date": "2024-05-03 10:23", "message": "The coup in Niger: Russian soldiers reportedly enter a military base where the American troops are stationed\n\nAccording to Reuters, Russian soldiers have entered a military air base housing American forces in the capital of Niger.\n\nAs you might remember, last year there was a coup in Niger and the military junta that seized power demanded that the US terminate the agreement with it and... remove all American forces from Niger.\n\nThe American forces have not yet evacuated and now they have new \"guests\" at their base.\n\nAmerican officials state that the Russian and American soldiers remain in separate areas at the base. The American Secretary of Defense spoke out on the matter and said that there is no fear that the Russians will get their hands on American equipment.\n\n##\nThe Taliban send their regards.."}, {"id": "e162d41f-66a5-42a2-bc0b-48089d7dd3bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26622/", "date": "2024-05-03 06:58", "message": "The Lebanese Al-Akhbar claims: Hamas was presented with American-Egyptian guarantees for Israel's non-return to fighting after the Hudna agreement\n\nFollowing what I wrote here yesterday about the goals of the current administration in the US, and the things that stand behind the statements of Secretary of State Blinken against Netanyahu's remarka regarding Rafah, the Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, is publishing today that there is some kind of \"Egyptian-American guarantee\" that was presented to Hamas, that Israel will not return to fighting after the cease-fire agreement (which, as I explained yesterday, is the last central principle that will meet all of Hamas's public demands - AA).\n\nAccording to Al-Akhbar, Hamas demanded that the guarantee in this section be clearly worded. Also, Hamas demanded a Turkish guarantee in addition to the Egyptian and American guarantees, especially after the objection of the US to include Russia as a party to the agreement.\n\nThe newspaper also reported that Egypt is exerting significant pressure on Hamas because it believes that the American position is correct and that the US continues to exert pressure on Netanyahu's government in a way that causes problems within the Israeli government and even in the Israeli army, all while the US attempts to stop the ongoing wave of student protests - Something that has become a primary goal for the Biden administration.\n\nIn the same matter, Al-Akhbar notes that the mediators asked Hamas to give them more time before giving their answer, because they were convinced that Hamas's answer would be negative, which led to Egyptian-American-Israeli contacts to prevent the collapse of the talks in the last 48 hours. In this context, the newspaper noted that Egypt obtained an Israeli promise to postpone any action in Rafah at least until the end of next week.\n\nThe newspaper adds that the next few hours are critical in terms of reaching a deal."}, {"id": "17e48d0c-b896-4395-9897-72b6df6c8790", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26620/", "date": "2024-05-03 06:44", "message": "Last night's attack in Damascus, attributed to Israel\n\nSyrian sources identified with the Shiite axis report that the target of the Israeli attack in Damascus was the \"State Security School\" (of the Syrian Army - AA), near the village of Najaha, and as a result, a three-story building was severely damaged there.\nAccording to these sources, the target of the attack belonged to the Syrian army and not to Iranian elements in Syria.\n\nThe Syrian Ministry of Defense officially announced that Israel carried out an airstrike last night at 10:05 PM which resulted in the injury of 8 Syrian soldiers and damage to property."}, {"id": "a7f3aee2-3d43-47a6-906d-1a762b75374c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26619/", "date": "2024-05-02 20:40", "message": "After the report of the Bloomberg agency's reporter in Turkey 👆, the Turkish Ministry of Commerce officially announces:\n\nFrom today, the import of goods from Israel and the export of goods to it will be suspended until all aid can be brought into the Gaza Strip"}, {"id": "e52e9a00-48cf-4a45-9748-d0cac8992ce9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26618/", "date": "2024-05-02 20:19", "message": "Palestinian sources report the death of officer Muhammad Adas, one of the companions of Palestinian Authority Chairman Abu Mazen from the Presidential Guard, as a result of an IDF shot that hit him in the head during the entry of IDF forces into the village of Anbata in the Tulkarm district in the last hour."}, {"id": "61df6e67-5cf8-404e-adbb-76bf6ca1e48c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26617/", "date": "2024-05-02 20:17", "message": "Sources associated with the Syrian opposition report on limited explosions heard in the last half hour in Damascus, the capital of Syria.\n\nAccording to these sources, the Syrian air defense systems were not activated.\n\nThe sources add that an Israeli airstrike was carried out against a military post near the fifth bridge on the road leading to the Damascus border."}, {"id": "b365a348-0245-4a3e-8ae5-65e03682592e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26616/", "date": "2024-05-02 19:25", "message": "Following today's report on the death of Dr. Adnan Albarsh 👆 and another Gazan, in prison in Israel, Hamas, in an official announcement on its behalf, is trying to create symmetry with the Israeli abductees in Gaza and states that \"the death of two of our people abducted in the prison of the fascist occupation, under barbaric torture is proof of the heinous war crimes committed by the occupation.. \"\nHamas calls on the international community to act immediately and condemn \"this Nazi behavior and force Israel to reveal what happened to the thousands of Palestinians kidnapped by Israel and to return them to their families...\""}, {"id": "09b3503c-74d2-45ff-8e02-b53b0dd61f5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26615/", "date": "2024-05-02 18:47", "message": "While the President of the United States finds it difficult to condemn anti-Semitism against the Jews and Israel, a close ally of the United States, the Governor of Texas, Greg Abbott announces:\n\nAmerican Jewish Heritage Month\n\nAbbott tweets:\n\"I am proud to announce American Jewish Heritage Month in Texas.\nIt is necessary now, more than ever, that we stand in solidarity with Israel and the Jewish community.\nWe will always support Israel and celebrate the role played by American Jews in our great country.\"\n\nShow him some love in the comments on Twitter. He is a true friend of the Jewish state.\n👇👇👇\nhttps://twitter.com/GregAbbott_TX/status/1786054257533165613?t=fWmDa9E2WGn2QnZAEOCe_w&s=19"}, {"id": "f1ea4258-4434-49a3-8901-fb37ca4cb7dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26614/", "date": "2024-05-02 17:59", "message": "Palestinian channels: Settlers threw stones at Palestinian vehicles on Route 60"}, {"id": "d15fa5e2-aa14-4d88-bba3-b5736ef1976b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26613/", "date": "2024-05-02 17:54", "message": "Unlike Biden, Republican Senator Marco Rubio sounded a little more determined:\nIf you are a foreign national, staying in the US on a visa and you support Hamas, a terrorist organization... you should go (be deported - AA)... I hope we can get a vote on this in the Senate."}, {"id": "cb7afd9e-bccf-4ffa-881f-01887cb54112", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26612/", "date": "2024-05-02 17:48", "message": "A new organization calling itself the \"Ashtar Brigades\" - the Islamic resistance in Bahrain, claims to have launched a drone at the \"Traknet\" company, which deals with vessel traffic, in Eilat.\n\nThis is the first time that an organization related to the axis of resistance located in Bahrain accepts responsibility for military action against Israel.\n\n##\nBahrain is signed on the Abraham Accords security agreement with Israel."}, {"id": "802f738a-d1e2-42b1-ac06-4c751fbbac0c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26611/", "date": "2024-05-02 17:28", "message": "President Biden finds it difficult to clearly condemn anti-Semitism against Jews and against Israel on US campuses and in his own way finds it necessary to balance the weak condemnation on the matter:\n\n\"There is a right to protest, but there is no right to create chaos.\nThere is no place for the discourse of hatred or violence of any kind whether it is anti-Semitism, Islamophobia, or discrimination against American Arabs or American Palestinians.\n\nIt's just not the right way. There is no place for racism in the US. It's un-American.\""}, {"id": "a85729fa-a330-4f04-a06f-1f09aacdb967", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26610/", "date": "2024-05-02 16:56", "message": "Bloomberg's envoy to Turkey notes that Turkey has decided to suspend import and export relations with Israel.\nThe decision will take effect immediately.\nIn 2023, the volume of trade between the countries was 6.8 billion dollars, with 76% of it being exports from Turkey to Israel.\n\nArab journalistic sources estimate that Turkey will probably want to thaw relations again after a ceasefire in Gaza takes effect. According to other sources, the timing could be due to the fact that the possibility of a ceasefire in Gaza is close and therefore Erdogan is taking a \"calculated risk\" that will earn him a \"place of honor\" in the Arab public's opinion, this after much criticism has been hurled at him in recent months for continuing his ties with Israel."}, {"id": "b00e740d-e092-4163-8f19-198bba473a91", "channel_id": 1560386984, "url": "", "date": "2024-05-02 15:33", "message": "US Chief of National Intelligence:\nThe Houthis have announced that they will respect the ceasefire if it is reached in Gaza.\n\n##\nFollowing the post I wrote 👆 before - the Americans are asking through the ceasefire in Gaza to reach an end to the war in the region and the quieting of all fronts.\nThe pressure to reach an agreement in Lebanon will intensify as soon as a ceasefire is reached in Gaza.\nThe ambition of the Biden administration is to end the war in Gaza through a close agreement with Hamas, then an agreement with Lebanon and then normalization with Saudi Arabia with the laying of foundations for a Palestinian state and all this before the November elections in the USA - the Democrats will want to base their election campaign on this.\nThe pressure will only increase on Israel as time passes. The schedule is tight and therefore they exert all their weight on Israel.\nA war in Gaza or a war in the north will jeopardize the achievements they hope for in time for the elections. Time is running short."}, {"id": "59b8aac5-74b5-4b99-9f36-e4f6057c5fc6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26607/", "date": "2024-05-02 15:31", "message": "IDF spokesperson:\n\nEarlier today, IDF forces cleared the remains of another surface-to-surface missile that was intercepted in the Nahal Yalim area, near Arad, as part of the Iranian attack that took place last month.\n\nHazardous materials were cleared out and the evacuation was carried out using a crane (Rio 6x6) by IDF forces, led by the South District of the Home Front Command and together with fire and rescue forces.\n\nThe public is requested to act in accordance with the instructions of the Home Front Command when encountering a suspicious object. It is important to emphasize that falls and fragments of interceptions and missles may be dangerous.\nDon't touch them, stay away and report finding them to the police hotline 100."}, {"id": "c80f5f64-59c6-4066-b344-97a51f51a16d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26606/", "date": "2024-05-02 15:29", "message": "The Palestinian Prisoner's Club:\nDr. Adnan Albarash, head of the Orthopedics Department at Shifa Hospital in Gaza City, who was arrested by IDF forces who raided the hospital compound, died in an Israeli prison."}, {"id": "4b3af256-37a2-49f6-8435-b19269aeb890", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26605/", "date": "2024-05-02 14:27", "message": "Words of great significance were said today by the American Secretary of State Blinken on the NBC network:\n\nThere are other ways that would allow Israel to eliminate Hamas' people besides action in Rafah.\n\nRegarding Netanyahu's statement,  he said: People say things, but we concentrate on actions.\n\n##\nThese two public statements by Blinken are intended for the ears of senior Hamas officials.\n\nOver the past few months, Hamas has publicly bound itself to four conditions without which it will not sign a deal for the release of the abductees:\n\n1. The return of the displaced to their homes\n2. Withdrawal of Israeli forces\n3. Restoration of the Strip\n4. Permanent ceasefire\n\nThe first 3 issues were resolved in the last document that Israel handed over to Hamas, at least based on the publication in the Al-Akhbar newspaper.\nHowever, Netanyahu later publicly stated that Israel would enter Rafah with or without a deal.\nIn his words, Blinken explains - it is possible to reach a situation where Israel will completely stop fighting in Gaza.\nThis is the last piece of the puzzle that is missing as far as Hamas is concerned.\nBlinken hints to Hamas that the US has the ability to \"take Israel out of the matter and end the war.\"\nAfter all, I explained to you a few days ago that Hamas and the US administration are interested in ending the war. There is an alignment of interests here.\nToday Blinken clarified this publicly to Hamas so that it would sign the deal."}, {"id": "a6cd8d5d-8e0e-42ed-b805-1c830bbf77c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26603/", "date": "2024-05-02 13:13", "message": "American police officers fire rubber bullets and tear gas at the pro-Hamas students at UCLA."}, {"id": "a0e91f6d-ccd5-4f4a-85e1-e3602fe774ef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26602/", "date": "2024-05-02 13:10", "message": "Ismail Haniyeh, Chairman of the Political Bureau of Hamas in a conversation with the Egyptian Minister of Intelligence: very soon a delegation of the movement will arrive in Cairo to complete the talks in order to reach an agreement that will meet the demands of the Palestinian people and stop the aggression."}, {"id": "6dc23999-f223-44e8-b6c7-374dfcc76489", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26601/", "date": "2024-05-02 12:29", "message": "A Gazan living abroad wrote on Facebook about the floating dock that the US is building off the coast of Gaza:\n\n\"You want to tell me that the USA invested 320 million dollars in a marine pier so that they can bring beans into the Strip?\"\n\n##\nThe truth is, not only he raises an eyebrow...\nIn practice, this is 320 million dollars for improving the image of the USA.\nThe land crossings are enough. Today there is already plenty of food in Gaza and the pier has not yet opened."}, {"id": "c56fbf54-0994-4cdf-9e32-a836fcb0f9c2", "channel_id": 1560386984, "url": "", "date": "2024-05-02 12:28", "message": "UCLA:\nThe police completely dismantled all the barricades and roadblocks placed by the Hamas-supporting students and entered the \"liberation compound\", where the protesters' tents were placed, to liberate it from their presence.\nSeveral arrests were made. Police activity at the scene continues."}, {"id": "3c725bc8-e143-439b-aee7-330c170d2792", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26598/", "date": "2024-05-02 11:51", "message": "The Palestinians present to the cameras: back to school.\n\nA school in the IDP tent complex in Rafah, in the southern Gaza Strip."}, {"id": "d2e023ca-400f-4db8-a25d-97261cfd2e13", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26597/", "date": "2024-05-02 11:43", "message": "The PA Chairman's Office welcomes the fact that Colombia has severed diplomatic relations with Israel.\n\n##\nIn the meantime, the Palestinian Authority continues to have daily relations with Israel..."}, {"id": "b6d83c38-4ac6-4770-96b3-d0c3ad4a16e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26596/", "date": "2024-05-02 11:40", "message": "64 Gazans who were arrested during IDF operations in the Gaza Strip in recent months were released this morning back to the Gaza Strip."}, {"id": "c3f58561-1285-4101-a680-374d02b19f5c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26595/", "date": "2024-05-02 11:39", "message": "Palestinian channels: a Gazan man has started rebuilding his house in Khan Yunis in the south of the Gaza Strip.\n\n##\nIt will need a lot of plaster with such sloppy block placement.\nI bet it's just a show for the camera."}, {"id": "8744dc55-5e9d-4c25-a238-a0b032d72272", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26594/", "date": "2024-05-02 11:38", "message": "Another video from yesterday's unique situation at the University of North Carolina in Chapel Hill (the one that produced the \"picture of the year\" 👆 according to many Americans).\nPatriotic American students protect the US flag and keep it from touching the ground while the anti-Israeli students curse them, throw bottles at them and splash water at them.\nThe Israeli flag is also part of the situation.\nThere are reports on social media that hundreds of thousands of dollars have been donated by Americans to the group that defended the flag.\nIt inspires great pride in the American public.\n\nThanks to follower Y for the video."}, {"id": "d5ddaf10-7dca-4fb9-b8ff-2076631404a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26593/", "date": "2024-05-02 11:21", "message": "The Palestinian channels are shaking: an American police officer was recorded spitting on the Palestinian flag while guarding the American flag after it was re-raised in place of the Palestinian one."}, {"id": "5cb87724-1213-4422-ac37-9ede479ede89", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26592/", "date": "2024-05-02 06:10", "message": "Hezbollah supporters publish a martyrdom poster for all seven commanders in Hezbollah's Redwan force who were killed by the IDF in recent months.\n\nIn the middle of the poster, Wisam Al-Tawil, the most senior commander in the group."}, {"id": "8a546f34-9876-440a-b122-0e7cc2c468ad", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26591/", "date": "2024-05-02 06:07", "message": "UCLA: LAPD places snipers on the rooftops, ahead of the break-in to the Palestinian camp."}, {"id": "9a866ecd-1ba9-4623-9c85-ea407539e86e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26591/", "date": "2024-05-02 06:07", "message": "UCLA, California: Pro-Palestinian protesters strengthen the fortifications around the camp as LAPD prepares to evacuate them."}, {"id": "1fb06cfa-d354-44da-9edd-e9a8c481e1e1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26589/", "date": "2024-05-02 05:59", "message": "Anti-Israeli, Hamas-supporting students at CUNY drag the American flag across the floor while stepping on it.\n\nFor Muslims, the sole of the shoe is considered impure (this is why they take off their shoes and wash their feet before entering a mosque). For them, stepping on the flag symbolizes the highest possible level of contempt towards the flag and what it represents."}, {"id": "97e78c12-cb7e-4d74-8cf7-ab2944c832e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26588/", "date": "2024-05-02 05:57", "message": "Here's an amusing clip from last night:\n\nA CBS commentator, covering the demonstrations at UCLA, is surprised to discover a yellow flag that he has never seen before among a group of pro-Israelis at the university. He wonders if this is a new flag that represents the counter-protesters, and tries to and decipher what is written on it: Mo-shi-ach...\n\n##\nFor anyone still puzzled, this is Chabad's \"Messiah\" flag"}, {"id": "1cf724f5-6ad2-416c-86c5-81e0a9dfef7f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26587/", "date": "2024-05-02 05:48", "message": "More from UCLA: Anti-Israel protesters shout at the police:\n\nShame, shame shame.\nPalestine will be free.\nIntifada, infada."}, {"id": "c7f0917c-41b6-4cab-a0cc-fb595596ae0d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26586/", "date": "2024-05-02 05:47", "message": "California: University police at UCLA declared the Palestinian camp on the university grounds illegal..."}, {"id": "1960e57b-4ae9-42b5-a201-d79c15c8ec34", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65901/", "date": "2024-05-02 05:46", "message": "New York: An anti-Israel demonstration, with the participation of anti-Zionist Jews, was held in front of the entrance to Columbia University."}, {"id": "669caafb-170f-4d5c-bdc8-bd69a298fb64", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65901/", "date": "2024-05-02 05:46", "message": "Georgia: Violent demonstrations broke out last night in front of the Georgian Parliament building, after the Georgian parliament passed the \"Foreign Agents\" law 👆 in second reading.\n\nPro-EU protesters (who oppose the law) were dispersed by riot police."}, {"id": "39f34564-fd35-4c79-ae43-43ac3fba2241", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26580/", "date": "2024-05-02 05:43", "message": "The Shiite militias in Iraq claim to have attacked a couple of targets last night, in the Golan and in Eilat, using suicide drones."}, {"id": "82734d94-8605-458b-990a-ca9ee7073181", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26576/", "date": "2024-05-02 05:41", "message": "Tulkarm, West Bank: Palestinian media reports that the last night Palestinian Authority's Security Services killed Ahmed Abu Al-Ful, the commander of the \"death squads\" in the military wing of the Islamic Jihad in Tulkarm.\n\nHamas and the Islamic Jihad issued proclamations in which they strongly condemned the PA.\nLocal organizations in Tulkarm called for demonstrations against the Palestinian Authority.\n\nThe spokesman for the PA's Security Services presented the its version of the events:\n\nAbu Al-Ful fired at a PA patrol and they returned fire at the source of the shooting."}, {"id": "1f324d84-fb1d-4002-b99b-125521a8cff3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26574/", "date": "2024-05-01 19:33", "message": "The caption they gave in Lebanon to this video, apparently shot in Beirut:\nIf Tom and Jerry had guns..."}, {"id": "86191f98-4cbc-4aea-a205-21bc82d0d2af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26573/", "date": "2024-05-01 19:26", "message": "Hamdan also noted: We have continuous contact with Yahya Sinwar and Muhammad Deif."}, {"id": "72f97d65-45aa-41d5-a934-0da5bc597380", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26572/", "date": "2024-05-01 19:26", "message": "Senior Hamas official Osama Hamdan:\n\nIf Israel launches an attack in Rafah, we will stop the negotiations. We will not conduct negotiations under fire."}, {"id": "cd256276-a75b-49f9-bd4c-6f0d9804edb3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26571/", "date": "2024-05-01 19:15", "message": "France: As part of a demonstration on the occasion of Workers' Day in Paris today, a protester, a leftist, threw a bottle at a French policeman..."}, {"id": "b28be2bc-ba57-48f6-9517-59a060f07273", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26570/", "date": "2024-05-01 19:11", "message": "Arab channels report that the Israeli \"Kan\" channel reported this evening from an \"Israeli source briefed on the details\" thatss Israel is ready to discuss border revisions as part of an agreement to prevent war with Lebanon.\n\nIf the report is indeed true and \"the Israeli source has been updated\" with reliable information, then this is the surest way to disintegrate the remaining Israeli deterrence on the northern border.\n\nIt would be a big mistake on Israel's part to give such a big gift to Nasrallah in exchange for peace...\nThe cost will be in blood."}, {"id": "d7d5eb3f-3a10-46ed-9cec-dac755be3f02", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26569/", "date": "2024-05-01 18:48", "message": "The President of Colombia, Gustavo Petro, announced today during a speech in De Bolivar Square, on the occasion of Workers' Day, that starting tomorrow Colombia will sever diplomatic ties with Israel due to the war in Gaza.\n\n##\nThe Colombian military industry will be less than happy with the announcement..."}, {"id": "68687f4f-4bb7-4019-911e-f46d306887f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26568/", "date": "2024-05-01 18:15", "message": "The Georgian parliament approved the \"foreign agents\" law in a second reading by a majority of 83 supporters against 23 opponents.\n\nThe law, to which the European Union opposes, states that a media body financed at a rate higher than 20% by a foreign entity may be considered a \"foreign agent\" and restrictions will apply accordingly.\nThe European Union opposes this law. Supporters of the European Union in Georgia call it the \"Russian law\" - and have demonstrated against it in recent months.\n\nIn recent weeks, the Prime Minister of Georgia proposed to the European Union that he would shelve the law in exchange for Georgia's entry into the European Union to receive full membership.\nIt did not happen."}, {"id": "a58989ec-5e1c-4e2e-aa8a-f25c89cb9cff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26567/", "date": "2024-05-01 17:11", "message": "Following the report yesterday 👆\n\nIDF: For the first time since the beginning of the war: The Erez Crossing has been opened for the entry of humanitarian aid\n\nAccording to the government directive, and as part of the effort to increase the quantity and routes for humanitarian aid to the Gaza Strip, for the first time since the beginning of the war, the IDF, through the Coordination of Government Activities in the Territories (COGAT), opened the Erez Crossing of the Ministry of Defense's Land Crossings Authority today (Wednesday), to allow the entry of humanitarian aid into the Gaza Strip. As part of this effort, after careful security inspection, 30 trucks of humanitarian aid including food and medical supplies for the northern part of the Gaza Strip, arrived from Jordan and entered Gaza today.\n\nThe entry of humanitarian aid through the Erez Crossing was made possible after engineering work was carried out in the area by the Engineering Units and additional IDF forces."}, {"id": "97119742-d0d0-4613-9ae4-a11fee236903", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26564/", "date": "2024-05-01 16:42", "message": "Pro-Palestinian students yesterday took down the American flag at the University of North Carolina at Chapel Hill and raised the Palestinian flag in its place.\nCounty police officers arrived at the scene and re-raised the American flag. The pro-Israeli students stood there with Israeli flags and sang the American national anthem (as you can see in the attached video) in front of the American flag that was raised at the top of the mast.\n\nImmediately after that, the pro-Palestinians tried to remove the American flag again, and then the students in the picture came and raised the American flag and prevented the flag from touching the floor.\n\n##\nThe Americans are very sensitive to the issue of the flag and in my opinion the pro-Palestinians' injury to it plays against them in American public opinion. The pro-Israel American students made sure to show their respect for American symbols. There are many merits here for Israel and the Jewish community."}, {"id": "9c572cdd-f85f-4357-8e0f-8dc0e9eb5c9d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26563/", "date": "2024-05-01 16:37", "message": "For many Americans on social media, this is the picture of the year for 2024 so far.\nAnd there is also an Israeli aspect.\n\nThe background 👇👇"}, {"id": "5b8256c8-7f72-4a7c-9dcc-b5ada1efb023", "channel_id": 1560386984, "url": "", "date": "2024-05-01 16:36", "message": "Iran: The Fars district police use the Iranian military drone Mahajr 6 to enforce traffic laws....\n\nThe Iranian drivers hope that the UAV, which is capable of carrying bombs, is not armed..."}]