[{"id": "495d1010-569d-406a-99fc-d975992aecb6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32744/", "date": "2024-08-20 14:13", "message": "The spokesman of the Iranian Revolutionary Guards on the issue of the Iranian response to the assassination of Ismail Haniyeh in Tehran:\nThere will be a response. The waiting time for a response will be long...this is for our benefit.\n\n##\nGazans answer him: But a long time is not for the benefit of Gaza...\nThe Palestinians are very disappointed... and all the opponents of the Iranian axis on social media are mocking the Iranian delay in responding."}, {"id": "7cf806a0-fdb8-40ca-bdca-3c7812e4c9e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32739/", "date": "2024-08-20 13:21", "message": "The supermoon as photographed last night in Tehran."}, {"id": "fe506b9e-b167-4420-b0dc-f0b6e2c45517", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32738/", "date": "2024-08-20 13:21", "message": "Civil Defense in Gaza: We managed to rescue 12 dead from the Matzafa Haft school in the west of Gaza City.\nThere are more under the ruins but we do not have the necessary equipment to rescue them."}, {"id": "b331c918-66a2-4a5a-8a20-6cf6ee06db4b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32737/", "date": "2024-08-20 11:35", "message": "Further to what President Biden said, according to the Times of Israel, regarding Hamas' withdrawl from a ceasefire deal, Hamas published an official announcement a short time ago that read:\n\nWe are shocked and strongly condemn President Biden's statements according to which Hamas withdrew from the agreement.\nThe statements are misleading, biased in Israel's favor and are in fact a green light for the extreme Israeli government to continue its crimes against the Palestinians.\n\nWe emphasize that we are committed to the offer presented by the brokers on July 2nd."}, {"id": "6c221a29-c3fb-40b7-b965-7b5c4b67fbfb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32736/", "date": "2024-08-20 11:33", "message": "Elon Musk, behind you...\nThe \"Iranian Starlink\" version - an Iranian zeppelin that provides internet to the pilgrims in Karbala, Iraq to mark the fortieth day (of the death of Husayn ibn Ali, grandson of the Prophet Muhammad)."}, {"id": "12061a84-3915-4919-87ea-8f3177185349", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32735/", "date": "2024-08-20 11:32", "message": "Lebanon: The Lebanese Minister of Energy announced that on the 24th of the month a fuel tank will arrive in Beirut that will ensure the production of electricity that will provide 6 hours of electricity a day in the national grid in Lebanon."}, {"id": "4d648571-31c6-4436-9e30-107b47a8b5b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32734/", "date": "2024-08-20 10:33", "message": "The rescue attempts from the building that was attacked in the Mustafa Khaft school complex:\nIt won't be easy."}, {"id": "a568eb0f-eaaf-4bd3-b2fb-53dbf9794206", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32733/", "date": "2024-08-20 10:33", "message": "Documentation from one of the buildings at the Mustafa Khaft school that collapsed following the IDF attack.\nAccording to the Civil Defense of Gaza, 700 displaced people live in the school.\n\n##\nIf there are 700 people in a place and only ten were killed in an attack that collapsed a building, it is definitely surgical work."}, {"id": "a054a3e0-a5f8-493f-99a5-f0b8947870e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32732/", "date": "2024-08-20 10:31", "message": "The Lebanese al-Mayadeen channel updates the number of people killed in the attack on the Mustafa Khaft school in the west of Gaza City - according to the updated publication, the al-Mayadeen channel (as well as the civil defense in Gaza) claims that 10 Palestinians were killed in the attack, not 20."}, {"id": "6cd1ac5e-d5a1-460d-8408-9362e37fa283", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32731/", "date": "2024-08-20 10:29", "message": "The Lebanese Al Mayadeen channel: more than 20 dead under the ruins of the Mustafa Khaft school in the west of Gaza City that was attacked by Israel 👆"}, {"id": "794c7a55-3789-4d9b-b6d2-a26262e92c17", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32730/", "date": "2024-08-20 10:28", "message": "At 11:40, the IDF published: A short while ago, with the direction of the IDF and ISA intelligence, the IAF conducted a precise strike on terrorists who were operating within a Hamas command and control center. The command and control center was embedded and hidden by the Hamas terrorist organization inside the “Mustafa Khaft” School compound in Gaza City. Hamas terrorists used the command and control center to plan and execute attacks against IDF troops and the State of Israel. \n\nPrior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of precise munitions, aerial surveillance and additional intelligence.\n\nThe Hamas terrorist organization systematically violates international law and operates from within civilian infrastructure and shelters in the Gaza Strip, brutally exploiting the Gazan civilian population for its terrorist activities.\n\nThe IDF will continue to operate against the Hamas terrorist organization in defense of the citizens of Israel."}, {"id": "c1d4065f-8b6f-44df-a540-8d1f68a1b117", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32729/", "date": "2024-08-20 10:27", "message": "At 11:30 Palestinian channels reported an Israeli attack on the Mustafa Khaft school in the west of Gaza City.\n\nThere are dead and wounded on the spot according to Gaza sources."}, {"id": "d3b27144-d548-4dab-b1bd-3b8993798d3d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73634/", "date": "2024-08-20 08:35", "message": "The Lebanese Ministry of Health: 11 injured in the IDF attack last night in the Beqaa area."}, {"id": "95b3d54e-2efd-43c7-83df-167b45988e95", "channel_id": 1560386984, "url": "", "date": "2024-08-20 07:36", "message": "°Action against a hostile Twitter account associated with Hezbollah\n\nHere is a tweet from the Twitter account of Ali Shoaib, Hezbollah's correspondent for the Lebanese Almanar channel, in which he praises the suicide bomber who blew himself up on Sunday in Tel Aviv.\n\nPlease report him under the terrorism classification:👇\n\nhttps://x.com/alishoieb1/status/1825467866763743574?s=19"}, {"id": "867990ba-5d17-42db-8bba-bd67b17cd48e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32726/", "date": "2024-08-20 07:35", "message": "A video released tonight by Hezbollah in which a suicide drone is seen approaching a post of antennas and security systems at one of the IDF posts on the border with an explosive."}, {"id": "94d9f506-fe07-4a22-a989-2c7002da282e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32722/", "date": "2024-08-20 07:31", "message": "Gazan prisoners that Israel released this morning to the Gaza Strip."}, {"id": "440d171d-00b5-41ad-8892-58f6bb004c32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32721/", "date": "2024-08-20 07:30", "message": "The Palestinians report that this morning Israel released about 40 Gazan prisoners to the Gaza Strip, through the Kerem Shalom crossing.\nThey arrived at the European Hospital in Khan Yunis."}, {"id": "9755bc85-d64a-41f2-afbd-2692eeaf876f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32720/", "date": "2024-08-20 07:29", "message": "The six were kidnapped alive and murdered in Hamas captivity.\nAs part of the deal, their bodies were to return only in the third phase, after a permanent ceasefire, after the start of the reconstruction of the Strip - probably in many months at the very least."}, {"id": "2d4893d0-f034-4af7-8840-0e8353eb0f6c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32719/", "date": "2024-08-20 07:29", "message": "Joint IDF and ISA announcement: \n\nThe IDF and ISA rescued the bodies of the hostages Yagev Buchshtab, Alexander Dancyg, Avraham Munder, Yoram Metzger, Nadav Popplewell, and Haim Perry from the Khan Yunis area in the Gaza Strip\n\nOvernight (Monday), in a joint IDF and ISA operation, the bodies of the hostages Yagev Buchshtab, Alexander Dancyg, Avraham Munder, Yoram Metzger, Nadav Popplewell, and Haim Perry were rescued from the Khan Yunis area in the Gaza Strip. \n\nThe rescue operation was conducted under the command of the 98th Division and carried out by the Paratroopers Brigade, 'Yahalom' Unit, and the 75th Battalion, along with ISA forces.\n\nThe operation was enabled by precise intelligence from the ISA, IDF intelligence units, and the IDF Intelligence Directorate Hostage Headquarters."}, {"id": "4118a784-7605-4fc0-b16b-80514daed7a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32717/", "date": "2024-08-20 07:28", "message": "Chicago: Anti-Israeli protesters breach the security fence near the convention of the Democratic Party in the USA calling for an end to the war in Gaza. They are trying to put pressure on the Democrats to stop supplying Israel with weapons."}, {"id": "2aeaa87c-c5c9-4be5-8cb5-1752451eff7f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32716/", "date": "2024-08-20 07:26", "message": "IDF Spokesperson reported this morning: Following the sirens that sounded a short while ago in the areas of the Upper Galilee and the Golan Heights, approximately 55 projectiles were identified crossing from Lebanese territory. Some of the projectiles were intercepted, and the rest fell in open areas. No injuries were reported. \n\nIsrael Fire and Rescue Services are currently operating to extinguish fires that broke out in several areas in northern Israel due to falling projectiles.\n\nShortly after the launches, the IAF struck one of the launchers from which the projectiles were fired."}, {"id": "4581483e-1c96-4bd7-8608-6d2974c1e366", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32715/", "date": "2024-08-20 07:18", "message": "Rocket barrages from Lebanon:\nHezbollah publishes an announcement in which it accepts responsibility for launching rockets this morning at the \"Jordan Facility\" and \"Nafah Facility\" in the Golan - in response to last night's attack in the Beqaa area."}, {"id": "d07a51b5-eb53-477e-9026-5c49688211d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32714/", "date": "2024-08-20 07:18", "message": "\"Turkish love\" - ​​a Saudi tourist is beaten by Turks in Istanbul after they accused him of taking pictures of women on his cell phone."}, {"id": "3dc165fb-514e-4850-9d93-b063357faaa6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32710/", "date": "2024-08-20 07:16", "message": "More from Syria: The supermoon - as seen last night from Syria.\nThis is a phenomenon that occurs once every three years, making the moon appear larger by about 14% and brighter by about 30%.\n\nSome claim that there is a connection between this phenomenon and earthquakes."}, {"id": "fa448318-70d8-45aa-9575-73683df6ca62", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32709/", "date": "2024-08-20 07:15", "message": "Under the direction of Syrian President Assad, from now on all Palestinians are exempt from the need for visas and fees when entering Syria.\n\nSyria encourages Palestinian immigration to it.\nNice on Bashar's part (:"}, {"id": "12008677-abc0-4e35-bf81-b999ad805a7f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32708/", "date": "2024-08-20 07:15", "message": "Shazar also came to express his sympathy at Majdal Shams, the soccer field where 12 local residents, most of them children, were killed as a result of a Hezbollah rocket."}, {"id": "a3fbdbc9-491b-4544-9f0a-14e9e2b16fd8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32707/", "date": "2024-08-20 07:14", "message": "And more about mocking Iranian reactions to Israeli attacks, the Syrian exile Shazar came to visit the Temple Mount carrying the flag of the Syrian opposition opposing the rule of Bashar Assad.\n\nA video in which he mocks the Iranian ambassador and Hassan Nasrallah, which was filmed while he was on the Temple Mount, received a lot of attention on social networks (over a million views on Twitter).\n\nThe tweeters of the Shia axis are going out of their way..."}, {"id": "1438ceb9-fbdc-4b1b-9d91-1388f90690de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32706/", "date": "2024-08-20 05:29", "message": "The deputy commander of the Iranian Revolutionary Guards is trying to explain the \"delay in responding to the assassination of Haniyeh\":\n\n\"The response to the assassination of Haniyeh is a settled matter. It will occur at the right time and place.\"\n\nAmong Arab social media users, his comments are met with much ridicule: The banner of revenge is showing wear and tear; 20 days have passed, surpassing the timeframe they set when they prepared the banner."}, {"id": "4d0eead3-db45-4279-8de4-95f90d9330db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32705/", "date": "2024-08-20 05:25", "message": "According to Lebanese channels, this footage shows the Israeli attacks that took place last night in the Tyre area.\n\nThe hysteria there is evident."}, {"id": "e1202fb6-bcfa-4a75-bcec-d9d5782e70c5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32704/", "date": "2024-08-20 05:22", "message": "Hezbollah announced a death in its ranks last night:\n\nHussein Ali Suleiman\n\nHe was killed in the IDF attack last night in Deir Qanoun in southern Lebanon. According to the IDF spokesman as mentioned above, he was a key terrorist in the organization's Rocket and Nissile Unit in the Yarine area.\n\nNumber 417"}, {"id": "1c050145-cecf-4cc1-982f-8a98e7ce9526", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32702/", "date": "2024-08-20 05:20", "message": "IDF: A short while ago, IAF fighter jets struck a number of Hezbollah weapons storage facilities in the area of Beqaa in Lebanon. Following the strikes, secondary explosions were identified, indicating the presence of large amounts of weapons in the facilities struck. \n\nIn addition, an IAF aircraft eliminated the terrorist Hussein Ali Hussein in the area of Deir Qanoun in southern Lebanon. Hussein was a significant terrorist in Hezbollah's Rocket and Missile Unit in the area of Yarine. \n\nIn addition, earlier today, IDF forces identified a terrorist cell operating from a Hezbollah military structure in the area of Tayibe in southern Lebanon. IAF fighter jets struck the structure in which the terrorists were operating."}]