[{"id": "cdddb755-f86d-442b-ad2a-1a9552b08b3c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33176/", "date": "2024-08-26 22:30", "message": "According to Israeli media, the suspected vehicle was found and the initial report of the abduction was likely made in error."}, {"id": "34ec3343-a6d7-4144-9f2b-957a4987cb91", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33175/", "date": "2024-08-26 21:25", "message": "IDF, about an hour ago: a report was received regarding an incident of an abduction in the Samaria area. Upon receiving the report, forces were dispatched to the scene, and are blocking routes and conducting searches in the area. The details are under review."}, {"id": "c19bd672-1b39-4797-b91f-559c5a51ba2a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33174/", "date": "2024-08-26 21:23", "message": "Jibril Jibril (circled in red), an operative of the military wing of Hamas who was released in the last hostage deal with Hamas last November, was killed tonight.\nBeside him here in the photo is his friend Wael Masha, released in the same deal, who was also recently eliminated 👆 following an attack he carried out."}, {"id": "30c30065-0463-48ae-b462-c86f42228d50", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33169/", "date": "2024-08-26 21:20", "message": "The Palestinian Ministry of Health confirms:\n5 killed in an attack by an Israeli aircraft in Nur Shams in Tulkarm."}, {"id": "36001371-864f-4c57-b2f4-f1bae8ce95bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33166/", "date": "2024-08-26 21:18", "message": "Iran-Iraq border in Kermanshah district area:\nSeveral fuel tanks caught fire and exploded. The border crossing is closed."}, {"id": "96af827f-a990-4515-8549-0ef2a4c81d5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33165/", "date": "2024-08-26 21:17", "message": "A senior Hamas official in Basem Naim, replies to Kirby 👆:\n\nHamas does not participate in any way in the negotiations in Cairo.\n\nKirby's statements are an attempt to sell illusions to cover up the crimes of the occupation.\n\nThe US is conducting a media campaign in order to put pressure on the \"resistance\"."}, {"id": "76469653-c6d1-4f53-9ff0-0c83ddcf0124", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33164/", "date": "2024-08-26 21:16", "message": "John Kirby, communications coordinator for the National Security Council at the White House on the talks in Cairo:\n\nThe working teams are currently holding meetings in Cairo as part of the talks to reach a ceasefire agreement in Gaza.\n\nThe talks are constructive despite the Hezbollah attack. Hezbollah's attack did not affect the talks and we are happy about that.\n\nThe talks are now dealing with details, including the prisoners and the kidnapped.\n\nAll parties are represented in the talks of the working teams now in Cairo, including Hamas."}, {"id": "b832a24c-493d-40c1-9280-92ce6db605c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33163/", "date": "2024-08-26 18:47", "message": "China: Beijing hosts the world's largest robot conference.\nThe main attraction at the conference was 27 human-like robots that walked around the conference island."}, {"id": "d0048f11-487d-44e2-880f-edc41b46b844", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33162/", "date": "2024-08-26 18:46", "message": "Reactions on social networks to the arrest of the founder of Telegram in France:"}, {"id": "83e51c48-0f13-4922-9456-ba0948fbf291", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33161/", "date": "2024-08-26 18:45", "message": "The chairman of the Palestinian Authority, Abu Mazen, arrived in Saudi Arabia this evening for an unplanned visit. He is expected to meet the Saudi crown prince tomorrow.\n\nAbu Mazen was also accompanied by the Secretary General of the PLO Working Committee, Hossein al-Sheikh and the head of Palestinian intelligence, Majed Faraj."}, {"id": "44f8223a-6706-4642-bcab-45f8124c5dcd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33160/", "date": "2024-08-26 18:43", "message": "IDF: Following the sirens that sounded at 18:36 in the Upper Galilee area, a number of suspicious aerial targets were identified crossing from Lebanon into Israeli territory.  A number of fallen projectiles were identified in the area. No injuries were reported. \n\nAdditionally, following the sirens that sounded at 18:59 in the Western Galilee area, a number of suspicious aerial targets were identified approaching Israeli territory from Lebanon. The IDF Aerial Defense Array successfully intercepted most of them. A fallen projectile was identified in the area. No injuries were reported. \n\nSirens regarding rocket and missile launches were activated due to the possibility of falling shrapnel from the interception."}, {"id": "189c7644-8cd9-499a-bac6-3aa7df516201", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33159/", "date": "2024-08-26 18:42", "message": "The military wing of Hamas publishes documentation of the launch of the M-90 rocket yesterday towards Rishon Lezion.\n\nAccording to the IDF spokesman, the launcher was destroyed after launch."}, {"id": "d4ffabec-1394-4489-80db-b36399ca3c6e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33158/", "date": "2024-08-26 18:41", "message": "Al Jazeera: Hezbollah attacked the north of Israel with drones and rockets at the same time as the Israeli Chief of Staff and his American counterpart, the chairman of the US Joint Chiefs of Staff, were visiting the north."}, {"id": "7ea3fb73-b7f2-45ab-975f-245ed536b842", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33157/", "date": "2024-08-26 18:40", "message": "French President Macron on the arrest in France of the founder of Telegram, Pavel Durov (who also holds Russian citizenship):\n\nThe arrest is not political. The decision is in the hands of the judges."}, {"id": "af2deb91-2f63-4428-bda9-2880f4eb3465", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33156/", "date": "2024-08-26 18:39", "message": "Hachem Haidar, Chairman of the South Lebanon Council with statistics on the results of the war on the Lebanese side:\n\n619 dead in Lebanon since the beginning of the war.\nAbout 2000 wounded.\n4,000 houses were completely destroyed.\n20,000 houses were partially damaged.\n\nThe dimensions of the destruction now in southern Lebanon are equal to about 40-50 percent of what was caused in the Second Lebanon War in 2006 (which also included a ground maneuver in Lebanon - AA)."}, {"id": "d766c1ee-21a5-4058-976a-3dffaabfe408", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33155/", "date": "2024-08-26 18:37", "message": "Lebanese sources: The roof of an apartment in Tyre fell in as a result of breaking the sound barrier by Israeli warplanes today.\nSignificant damage was caused.\n\n##\nThe building standards could use some changes..."}, {"id": "d68943c0-9bfe-4a78-b4e2-eb25a7877869", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33154/", "date": "2024-08-26 17:24", "message": "The Palestinians report 5 deaths in a vehicle attack near the Khan Yunis anchorage in Mawasi (west of Khan Yunis).\nAmong the dead is the journalist Ali Teima - identified with Fatah."}, {"id": "5d8a75d8-a0cf-4a19-b028-d0619b4cb8fe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33153/", "date": "2024-08-26 17:13", "message": "Lebanese channels report fear and concern among the residents of Bint Jabil district in southern Lebanon, due to the uncertainty as the beginning of the school year approaches - they do not know if schools will open in their area and what will happen to the students who were displaced from southern Lebanon.\nThe Lebanese Ministry of Education has not provided answers."}, {"id": "fda9a7d5-0cf2-4cd6-8fb4-3d50de92d3be", "channel_id": 1560386984, "url": "", "date": "2024-08-26 17:12", "message": "The Iranian Chief of Staff on Hezbollah's attack: what we saw yesterday is part of the revenge for the assassination of Ismail Haniyeh\n\nIs Iran trying to piggyback on Hezbollah's revenge and seeking to lower expectations?\n\nMohammad Bagheri, the Iranian Chief of Staff, at the swearing in of the new Iranian Defense Minister:\n\nTehran cannot forget the elimination of Haniyeh and the revenge for it, whether it will be carried out by the resistance axis or by Iran, it is a done deal.\n\nIran will determine the method of revenge and the appropriate time for it and will not fall into the trap that the media are laying for it.\n\nThe Axis will avenge the assassination of Haniyeh, each according to his ability and plan and what we saw yesterday is part of it.\n\n##\nThis is a retreat by Iran from the bombastic and threatening statements of the first week after the assassination in Tehran.\n\nCold feet? The need to avenge the assassination has become a heavy burden on Iran.\nDid I already say that they are jealous of Hezbollah?"}, {"id": "331a6532-b31c-4aad-a131-3d6ef0279f99", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33151/", "date": "2024-08-26 17:08", "message": "Palestinian journalist Muhammad Badar from Ramallah was released today after 10 months in Israeli prison.\n\nHe lost a few chins in prison."}, {"id": "ccc20ff3-761a-4dff-be76-f84f093eb874", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33150/", "date": "2024-08-26 17:06", "message": "The Egyptian \"Al-Qahara\" channel, close to the regime, according to a senior Egyptian source:\n\nEgypt has repeatedly emphasized to all parties in the negotiations that it does not accept any Israeli presence at the Rafah crossing or the Philadelphi axis.\n\n##\nThis is an important report so that everyone will understand how much the leading mediators in the negotiations (including Qatar of course) are biased in favor of Hamas.\nIf the mediator has such a clear interest against a central position of one of the parties in the negotiations, how can he act as a mediator? He is abnormally biased. He has a conflict of interest."}, {"id": "3bc68dde-ca71-46c0-b8f1-8420793f5d2b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33144/", "date": "2024-08-26 12:38", "message": "Crowding on the coastline in Deir al-Balah following the evacuation instructions.\n\nThe pressure on the residents of Deir al-Balah is intensifying. This is also noticeable in discussions online."}, {"id": "18b5ebc4-87aa-40fe-b328-220d3af9a4b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33144/", "date": "2024-08-26 12:36", "message": "An interesting report in Russian media about the attack in Sidon 👆:\nAmar Khlikhel, a senior member of Hamas, was the target of the attack in Sidon and he was seriously injured as well as some of his family members.\n\n##\nUnofficial Lebanese channels do not specify the name of the target of the attack but claim that the target was slightly injured, contrary to the Russian report."}, {"id": "70b38bdd-df56-43dd-a801-8688bbeb42d4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33142/", "date": "2024-08-26 12:35", "message": "Since yesterday at 15:00 until now, Hezbollah has not accepted responsibility for any attack on Israel."}, {"id": "45db768e-d72e-466e-9616-78e02a5fde6a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33141/", "date": "2024-08-26 12:34", "message": "Lebanese sources reported earlier this afternoon that Israeli fighter jets broke the sound barrier in the skies of southern Lebanon.\n\nThese sources also report that Hezbollah subsequently launched an air-to-ground missile at the planes in the skies of southern Lebanon."}, {"id": "afc27e1f-462e-4a0a-932c-c1f91f77cdb3", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74114/", "date": "2024-08-26 09:49", "message": "The Lebanese Al Mayadeen channel claims: the target of the attack in Sidon was saved.\n\nThe Almanar network and the Lebanese Al Akhbar channel also rushed to announce that the target of the attack in Sidon had been saved.\n\nThe common denominator for all 3 of these media: they are identified with Hezbollah.."}, {"id": "3e54da7c-9265-4d36-95b8-bc8bdd8ec625", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33138/", "date": "2024-08-26 09:48", "message": "Lebanese channels: An Israeli drone attacked a Honda CRV at the entrance to the village of Ibra in Sidon (about 50 km north of the border with Israel).\nAccording to Lebanese sources, there are casualties."}, {"id": "0a338e02-476d-43aa-9aa1-44253c2f3ea8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33137/", "date": "2024-08-26 08:45", "message": "Lutsk, Ukraine: An Iranian-made Shahad 136 UAV (used by Russia) dives towards a residential building."}, {"id": "5bc1de19-37b7-4795-b91f-7c16f805b3d6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33136/", "date": "2024-08-26 08:45", "message": "The municipality of Deir al-Balah in the center of the Gaza Strip:\n\nNearly 250,000 people evacuated Deir al-Balah during the last 72 hours following the evacuation instructions of the Israeli army.\n\n4 additional water wells have become out of our reach and a total of 14 wells, which would have provided 70% of the drinking water for the residents are not in use.\n\nAid organizations have begun to leave the area."}, {"id": "1b196e1d-4bac-4057-9a80-356a2a7c2d62", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74105/", "date": "2024-08-26 07:43", "message": "Remember the \"work accident\" 👆 from 5 days ago when an explosive device went off in the Tammun area, in southern Tubas, and one of the terrorists had his lower limbs amputated?\n\nWell, his name was Yazan Maslamani, one of the senior members of the \"Tubas Battalion\" of the Islamic Jihad - and he died today of his wounds.\n\nDug his own grave..."}, {"id": "b912224c-458e-422c-8f42-180d40a4cf83", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33130/", "date": "2024-08-26 07:40", "message": "North Korea reveals today, in the presence of the supreme leader, a new suicide drone of its own production.\n\nSoon to be seen in the Middle East and Ukraine?"}, {"id": "497c95bb-718a-4afe-90d0-f25f28094b42", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33126/", "date": "2024-08-26 07:39", "message": "A fire was still burning yesterday on board the Greek oil tanker SOUNION.\nIt was attacked by the Houthis last week."}, {"id": "799edd9e-7ca6-4791-bce7-0a056afdab8b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33123/", "date": "2024-08-26 07:37", "message": "In contrast to the Lebanese Al Akhbar newspaper, the more accepted equation on social networks is - a head for a head:\n\nThe head of the Hezbollah Chief of Staff for the head of a chicken.\n\n(It's worth watching the attached video)."}, {"id": "4eec6798-3416-41fc-ac9e-2ddfb069efdf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33122/", "date": "2024-08-26 07:36", "message": "The Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, has an explosive headline:\n\nHezbollah established an equation - Tel Aviv for Dahiyeh.\n\n##\nHezbollah is trying to frame the narrative...\n\nSocial media users didn't buy it👇👇👇"}, {"id": "83fee05b-ca67-42bb-9cb7-20b3af2fd1f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33119/", "date": "2024-08-26 07:09", "message": "The chickens don't stop chasing Nasrallah and Hezbollah on social media\n\nIn my opinion, Hezbollah has never regretted launching a rocket like the one that hit the chicken coop yesterday.\n\nSome of the posts on social networks:\n\n1. The occupation government decided to move the chicken coops to the Negev after intelligence reports arrived that Hezbollah intended to attack the chickens with strategic missiles.\n\n2. Nasrallah: The enemy must understand that there is no more KFC after today.\n\n3. Nasrallah: The enemy must know - if you attack our senior officers, we will attack your chickens.\n\n4. Hezbollah yesterday intensively, strategically and metaphysically attacked the chicken coops in response to the assassination of Fuad Shukr. His head was worth a thousand chicken heads!"}, {"id": "89429e70-f8d4-4c6f-a10a-9f10c4fb010b", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74096/", "date": "2024-08-26 07:05", "message": "The Palestinian Ministry of Health in Gaza:\n\nFollowing the evacuation instructions of the IDF spokesperson, according to which the Shuhada Al-Aqsa hospital in Deir al-Balah is in the vicinity of a combat zone, there was panic among the patients and some of them fled the hospital for fear that the IDF would break into it.\n\nWe emphasize that the Shuhada Al Aqsa Hospital continues to operate and that the medical staff remains with 100 patients in the hospital.\n\nWe demand protection for the hospital and those staying there."}, {"id": "d85fcc22-d1ec-4f22-bdc8-d5079c5d7149", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33117/", "date": "2024-08-26 07:04", "message": "The Palestinian Ministry of Health in Gaza:\n1.26 million polio vaccines entered the Gaza Strip. We are now preparing for a vaccination campaign.\n\n##\nThese additional vaccines entered through Israel, of course."}, {"id": "a2a47ca1-15d2-44e3-98c6-7a27f1d4a7db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33116/", "date": "2024-08-26 07:02", "message": "France: The arrest of the founder of Telegram was extended\n\nFrench media reports that the detention of Pavel Durov, the founder of Telegram, has been extended for investigation purposes.\nAccording to French law, the detention can be extended up to 96 hours, after which Durov will be released or an indictment will be filed against him.\n\nThe Telegram company responded to his arrest and stated that it complies with all the conditions of the law used in the European Union, including the Digital Services Law, like the other companies in this industry.\nAccording to the company, Durov has nothing to hide and travels frequently throughout the European Union. It also stated that it is ridiculous to accuse the platform itself or its owner of responsibility for inappropriate use of the platform."}, {"id": "c95486fd-4364-4f31-80ad-1b828892c1a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33115/", "date": "2024-08-26 07:01", "message": "Iranian Foreign Minister:\nThere will be an Iranian response to Israel's terrorist attack in Tehran.\n\n##\nThe Iranians are jealous of Nasrallah. They would be happy to be like him, after the \"powerful revenge\" they promised with  grandiose threats, all without causing a shred of escalation."}, {"id": "85e9feaa-da1f-478c-9e73-deeee887838d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33114/", "date": "2024-08-26 06:58", "message": "A Gazan reacts to the results of the round of talks in Cairo:\nEveryone lies.\nAnd the only truth is that only we die."}, {"id": "de5b0926-7568-441a-baa5-5b8678c7ea98", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33113/", "date": "2024-08-26 06:57", "message": "The failure of the talks in Cairo\n\nReuters from two Egyptian security sources:\n\nThe negotiation talks in Cairo ended without an agreement.\nHamas and Israel did not agree on the proposals of the mediators.\n\nThe Egyptian sources doubted the chances of success of the efforts to reach an agreement.\n\nAt the same time, a senior American source told Reuters that the talks were \"constructive\" and in an atmosphere where all parties wanted to reach an agreement...\n\n##\nThere is nothing new under the sun... There is no agreement between Hamas and Israel on fundamental issues, which are black and white. This does not prevent the Americans from continuing to scatter celebratory confetti around..."}, {"id": "6ed958a2-6385-427c-afd9-a3926733c9fe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33112/", "date": "2024-08-26 06:56", "message": "Another unusual event last night:\n\nIDF: an explosive device was detonated on a civilian bus in the area of the town of Marah Rabah. Damage was caused to the bus. No injuries were reported."}, {"id": "41b8458a-09f0-4adb-90ef-1dc436167806", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33110/", "date": "2024-08-26 06:55", "message": "Yesterday's ramming attack in Ariel:\n\nThe attack was carried out by two Islamic Jihad terrorists from the Jenin refugee camp.\n\nIDF: Following the initial report, two terrorists in a vehicle arrived from the direction of the Tapu'ah Junction to the entrance of Ariel and accelerated in the opposite direction of traffic. Their vehicle collided with other vehicles and attempted to ram IDF soldiers operating in the area. The soldiers eliminated the terrorists and located a military vest and ammunition in the vehicle.\n\nAs a result of the ramming attack, an IDF soldier was lightly injured and was evacuated to the hospital to receive medical treatment and his family has been notified."}]