[{"id": "cfd6b21e-4568-4405-ab07-fc8ba43f84a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27454/", "date": "2024-05-19 09:00", "message": "The Palestinians report that the death toll in the attack on the house of the Hassan family last night in Nuseirat (central Gaza) has risen to 31."}, {"id": "77d966cb-278f-4203-b7da-3aeed4bc1280", "channel_id": 1560386984, "url": "", "date": "2024-05-19 09:00", "message": "Lebanon: The funeral procession of Sharhabil al-Seid, the senior in the military wing of Hamas who was killed in an Israeli attack, is on its way.\n\nMany participants. Not everyone is innocent."}, {"id": "af313d6d-07a5-44da-8d83-676d88a91b79", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27451/", "date": "2024-05-19 08:32", "message": "Unofficial sources identified with the Shiite axis claim that the UAV that Hezbollah launched in the last hour towards Arab al-Aramshe (Israeli territory) attacked from the air before hitting the target."}, {"id": "fd18e555-d03c-4a57-8f32-3a605c837b13", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27448/", "date": "2024-05-19 08:09", "message": "A disturbing meeting this morning from Israel's point of view:\nThe President of Azerbaijan, Ilham Aliyev, met this morning with the President of Iran, Raisi, at the border point between the countries close to Kiz Kalasi.\nThe two met on the occasion of the establishment of a dam there.\n\nAliyev is considered a friend of Israel and Azerbaijan carries out security procurement of the most significant dimensions from Israel. It holds advanced Israeli weapons and some even saw it as a pontential Israeli base against the Iranian enemy.\nSuch a public and well-documented meeting certainly does not help Israel.\nI will also note that Aliyev is close to Turkish President Erdogan.\nMore than once, the Israeli flag has been seen raised in demonstrations in the territories of Azerbaijan in recent years (for example, after the successful takeover of territory from neighboring Armenia).\n\nRaises questions..."}, {"id": "09a20c15-7e40-49dd-86cc-319a98aa0882", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27447/", "date": "2024-05-19 07:37", "message": "The Palestinians report the assassination of Zahar al-Khouli, the commander of the Hamas investigation department in the central Gaza camps, along with his right-hand man Jahad al-Hamidi in a drone attack (apparently this morning) near Barj Palestine in Deir al-Balah (central Gaza)."}, {"id": "a3c93ed2-b96d-40ea-8d69-c35931e31c32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27446/", "date": "2024-05-19 07:35", "message": "Insight for the morning:\nThe price of normalization with Saudi Arabia after the US elections will be much cheaper for Israel, even if the next president is Biden."}, {"id": "5a3974ed-2907-427e-bfff-ff05bd6a115b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27445/", "date": "2024-05-19 07:34", "message": "Gaza Strip: Gazans learn first hand that chasing aid trucks and trying to unload goods from them while driving can be a dangerous business...\nThe truck driver doesn't even stop..."}, {"id": "74afbb0f-1418-4497-95b0-1af25ce6786d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27444/", "date": "2024-05-19 07:33", "message": "Geert Wilders, the leader of the party for freedom in the Dutch parliament who announced this week that he succeeded in forming a government in the Netherlands (an ardent supporter of Israel) tweets on Twitter in the Turkish context:\n\nAtatürk ✔️\nErdogan ❌\n\n###\nKemal Atatürk was the founder of the Republic of Turkey and its first president who advocated secularism and worked to weaken the power of the religious establishment in Turkey.\nThis is compared to President Erdogan who is taking Turkey in the religious - Islamist direction."}, {"id": "081bf6f1-a8d0-426e-9e85-f8e5fd41137b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27443/", "date": "2024-05-19 07:30", "message": "The Shiite militias in Iraq claim that they attacked a target in Eilat early in the morning using a UAV."}, {"id": "e60a962a-c29b-48ee-9d4b-b36095d89e02", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27443/", "date": "2024-05-19 07:30", "message": "USA: In New York the police were a little more determined in dealing with the \"celebrators\" of the anniversary of the Palestinian Nakba."}, {"id": "1b6c3853-d5d2-49ed-a308-dd5cf3de27c6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27441/", "date": "2024-05-19 07:29", "message": "Berlin: German police officers deal with the \"Nakba celebrants\" who demonstrated in the city."}, {"id": "78cbfdd8-11cf-478b-82a3-61f8c60d5910", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27440/", "date": "2024-05-19 07:28", "message": "The Palestinians are reporting tonight that 21 people were killed in the attack on the house of the Hassan family in the new camp in Nuseirat in the center of the Gaza Strip.\nThe dead are members of the families: Hassan, Akel, Hamid, Harara and Nazar.\n\nIn another attack, the Palestinians report 6 dead at the Shahin family home on Jaffa Street in the Tapah neighborhood of Gaza City.\n\n##\nThe volume of Gazan deaths in the events reported in the Gazan media in the past day is relatively high compared to the last few weeks."}, {"id": "26730a03-a19f-46b6-95e2-53bcc48b43b5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27438/", "date": "2024-05-19 07:27", "message": "The Palestinians report air force attacks tonight and early morning in the north of the Gaza Strip in the Jabaliya refugee camp and near the Kamal Adwan hospital, along with continuous artillery fire in these areas."}, {"id": "407b5e2a-05e2-4cb7-b3cf-cf12738274c5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27437/", "date": "2024-05-19 07:26", "message": "The IDF spokesperson announced the death of two fighters in battle in the southern Gaza Strip.\n\nMay their memories be a blessing."}]