[{"id": "cdac728e-f10e-45ab-b26b-1024ecbf8a46", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29069/", "date": "2024-06-18 09:44", "message": "Gaza sources: Hamas operatives murdered an activist of the Association for the Protection of Women's and Children's Rights after he took several photos in the area of ​​Bani Suheila in eastern Khan Yunis.\n\nAccording to these sources, Abd el Aziz Baraka, a member of the Aisha Association for the Protection of Women and Children (an NGO apparently with foreign funding) and an English teacher by profession, was kidnapped by Hamas operatives to one of the schools in Khan Yunis, where he was beaten to death.\n\nBaraka came with his family members to visit relatives of Bani Suheila for the holiday and apparently the photos he took in the area were the cause of his kidnapping and murder by Hamas operatives.\nHis relatives are calling him \"martyr\", a title reserved for those who are killed in military action (for the sake of comparison, Israeli Arabs do not call those who are killed in acts of crime in Arab society in Israel \"martyr\")."}, {"id": "6d023e48-acfd-4ec1-8844-96a75dc4c2b5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29068/", "date": "2024-06-18 09:40", "message": "Lebanon: Amos Hochstein, the American special envoy on his way to a meeting with Nabih Berri, the chairman of the Lebanese parliament who is also... the chairman of the Amal Shiite movement fighting against Israel alongside Hezbollah.\nHochstein also met with the commander of the Lebanese army."}, {"id": "a5aa5b7a-1f66-495c-a257-fae0c6c67f86", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29067/", "date": "2024-06-18 09:37", "message": "The French court overturned the discriminatory decision banning Israelis and Israeli companies from participating in the arms exhibition in France."}, {"id": "899344be-b61d-46da-a84a-014b25ff0e0c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29066/", "date": "2024-06-18 09:36", "message": "Washington Post: Key members of the Senate in the Democratic Party approved a huge deal for the sale of arms to Israel worth 18 billion dollars, which also includes 50 F15 planes."}, {"id": "974e3c81-6e16-41f5-8faf-44678eaa4347", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29065/", "date": "2024-06-18 09:34", "message": "Lebanese media: American envoy Amos Hochstein arrived in Beirut after his visit to Israel yesterday."}, {"id": "e7ed094f-4631-4a83-8d7d-adda43641a8e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29064/", "date": "2024-06-18 09:34", "message": "This cartoon appeared in the British newspaper The Independent in the Arabic language and it shows the American floating dock in Gaza as a Trojan horse used to bring weapons into the Strip under the title of \"Bringing in humanitarian aid\".\n\nThe cartoon comes against the background of Palestinian accusations that the pier provided security assistance to the operation to rescue the kidnapped in the Nuseirat refugee camp."}, {"id": "c8ea3b46-6b08-4a2b-a76c-f59472684de0", "channel_id": 1560386984, "url": "", "date": "2024-06-18 09:33", "message": "Gazans report the increase in chaos in in the center of the Gaza Strip.\nShooting incidents between residents have become a matter of routine, in public and in broad daylight.\nThe background for this is said to be an increase in mental stress, overcrowding (displaced persons from the north and south fled to the center), the price increases in the markets, problems in obtaining housing and \"women's problems\" as some add.\n\nYesterday in Deir al-Balah, members of the Shahin family tried to evict a tenant who did not pay rent and he beat them and shot at them and refused to leave.\nLiving in a structure as opposed to a tent is a critical, especially as the temperatures climb and staying in a tent becomes impossible - which adds to the family quarrels (and the lack of privacy that I mentioned a few days ago).\n\nThis is a side effect of the war and the displacement of people.\n\nIn the attached video - a shooting in the market of Deir al-Balah yesterday in broad daylight. There were no Israeli forces in the area..."}, {"id": "15728461-ff8f-4543-bbbd-4b52ea40beea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29062/", "date": "2024-06-18 09:26", "message": "Palestinian channels: هنا رفح .. جنوب قطاع غزة مئات الشهداء داخل منازلهم .. ولم يتم استخراج جثامينهم بعد\n\nHundreds of \"martyrs\" are still inside their homes in Rafah in the southern Gaza Strip - their bodies have not yet been recovered.\n(I spared you the attached video)"}, {"id": "9187dd4f-b621-4636-9654-6f55aff2c1b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29061/", "date": "2024-06-18 09:25", "message": "US Central Command reported tonight that it destroyed 4 radar systems of the Houthis in strikes in Yemen.\n\n3 days ago the US Central Command announced the destruction of 7 radar systems of the Houthis in strikes in Yemen.\n\nA total of 11 radars in 3 days - I wonder if this will have an effect on the Houthis' ability to attack ships in the area."}, {"id": "378bb60e-d23a-4aef-a2e3-d30681292744", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29057/", "date": "2024-06-18 09:24", "message": "The Palestinians report 17 deaths in three attacks last night in Nuseirat in the center of the Gaza Strip:\n\n10 killed in the attack on the house of Taleb a-Ra'i in Camp 1\n\n5 killed in the attack on the home of the Almadhon family in Camp 5 near Abd El El\n\n2 killed in an attack on a group of people near Wadi Gaza"}, {"id": "b46bfa98-9b57-4eea-b111-59daa7f19c07", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29053/", "date": "2024-06-18 09:22", "message": "Digital fraud - the next generation\n\nWho said you have to be in Gaza to be poor and ask for donations for Gaza?\nA Palestinian woman staying in Cairo decided that in order to be a successful Gazan digital beggar you don't need to be physically in Gaza.... You just need a sign that says north of the Gaza Strip...\nShe was photographed handing out meat to the \"poor Gazans\" on the occasion of the holiday with extras that she recruited in Cairo for the role of the poor Gazans.\n\nGazans in the north of the Gaza Strip who were unable to get meat for the holiday were outraged by the matter, to say the least... which did not stop the professional entrepreneur from smiling all the way to the bank and continuing to raise money on behalf of Gaza."}]