[{"id": "44556088-0884-41cc-8bcc-bb8ca3fa014b", "channel_id": 1560386984, "url": "", "date": "2024-08-16 09:59", "message": "Lebanese sources are reporting an Israeli UAV attack a short time ago on a vehicle in the Qasmia area, near the village of Barj Rahal in the Tyre governorate in southern Lebanon.\nOne injured. The vehicle was passing in the area between a UNIFIL post and a Lebanese army post."}, {"id": "0177d2c2-c106-4ad3-a659-2b40264717f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32506/", "date": "2024-08-16 09:56", "message": "It's always nice to see that \"celebs\" also cooperate and take part in popular programs in the Israeli prison:\nThe Palestinian member of parliament on behalf of Hamas, Sheikh Mahmoud Khatib, from Bethlehem, was released from prison in Israel yesterday after 10 months.\nFaiz Mesek from Hebron, who went straight to his barber, and the red-haired Abdullah Abu Shahidm, from the village of Abu Shahidm in the Ramallah governorate, were also released and honored with before and after pictures.\n\nAll stuck to the prison diet."}, {"id": "8c622d5c-0ceb-49f0-8926-1747dc116e6e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32505/", "date": "2024-08-16 09:54", "message": "Ahmed Abu Damos, the East Jerusalem lawyer who managed the largest Palestinian Telegram channel (about a million followers), in which he regularly posted harsh inflammatory words against Israel.\nAs mentioned, he was released yesterday👆 after ten months of administrative detention. Attached are photos of him before and after."}, {"id": "68277523-ddd7-4d9d-8def-46ccbf2c478a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32504/", "date": "2024-08-16 09:29", "message": "Meanwhile, while Hezbollah is busy with propaganda videos, unofficial Lebanese channels report that Ibrahim Salameh, a Hezbollah operative, was killed in the Israeli strike earlier today in Aitaroun in southern Lebanon."}, {"id": "e3d6307d-fc40-48f1-961a-364cbd93fafc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32503/", "date": "2024-08-16 09:28", "message": "Hezbollah has released a polished propaganda video lasting over four minutes, showcasing for the first time the underground facility \"Imad 4,\" named after Imad Mughniyeh, the Hezbollah commander killed in Syria in 2008. \n\nThe facility appears to be dug into rocky terrain and is spacious enough to accommodate truck movements. The video features missiles, rockets, and launch systems, accompanied by familiar incitement from Nasrallah with Hebrew subtitles.\n\nHezbollah aims to enhance its image in an effort to deter Israel from starting a war against it. Hezbollah was considerate enough to also release a slimmed-down version for easier viewing on mobile devices."}, {"id": "7e514a25-e047-437e-bcda-a860a466d453", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32502/", "date": "2024-08-16 09:27", "message": "The military wing of Hamas recently released a video claiming to show a suicide drone being launched towards a building in Khan Younis."}, {"id": "f3a6da4d-2495-4a90-b0b7-bf7b0412ec2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32501/", "date": "2024-08-16 09:26", "message": "Lebanese channels report casualties in the IDF attack in the Aitaroun area in southern Lebanon."}, {"id": "20cee803-62b8-4463-93e3-681d31a0e3f0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32500/", "date": "2024-08-16 09:25", "message": "IDF spokesperson in Arabic recently issued new evacuation instructions for residents of the Gaza Strip:\n\n1. Residents of the eastern neighborhoods of Deir al-Balah (central Gaza, an area where the IDF has not yet maneuvered) are requested to evacuate.\n\n2. Residents of Qarara, Mawasi, Jalaa, Hamed, and al-Nasser in northern Khan Younis are requested to evacuate.\n\n3. Due to the evacuation in Khan Younis, the humanitarian area is being reduced (the section highlighted in red on the map at the expense of the humanitarian area marked in yellow).\n\n##\nAn interesting evacuation, in light of the ongoing talks today in Doha..."}, {"id": "fd62db17-a830-4199-8709-bc7c5f904689", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32494/", "date": "2024-08-16 09:23", "message": "The Ukrainian invasion of Kursk in Russia: Ukrainian civilians are leaving reviews on Google Maps for sites in Kursk...\n\nThe Ukrainians greatly enjoy sticking it to the Russians."}, {"id": "488636ea-2ced-4e60-b02f-801f143b1d77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32493/", "date": "2024-08-16 09:21", "message": "Hamas official Hussam Badran on the negotiations in Doha:\n\n“Hamas views the talks on prisoner release and a ceasefire from a strategic perspective, aiming to end the aggression against Gaza.\n\nFrom Hamas's perspective, the current talks are part of a plan to implement what has already been agreed upon in the past.\n\nAny agreement reached must include a comprehensive ceasefire, a full withdrawal from Gaza, the return of displaced persons to their homes, and the reconstruction of the strip, alongside a prisoner exchange deal.”"}, {"id": "0308e51b-3bbb-48ad-9efe-9e33cf5d3316", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32492/", "date": "2024-08-16 09:19", "message": "3. \"When I'm president, we will deport the foreign Jihad sympathisers and we will deport them very quickly, and Hamas supporters will be gone. \n\nIf you hate America, if you want to eliminate Israel, then we don't want you in our country, we really don't want you in our country.\n\nI will ban refugee settlements from terror-infested areas like the Gaza Strip, and we will arrest the pro-Hamas thugs that vandalized federal property and make life very difficult in this country for a lot of people.\""}, {"id": "6eb0e405-5e8b-4c48-90cd-b6d245fd9a80", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32491/", "date": "2024-08-16 09:15", "message": "2. \"When I'm back in the oval office I will support Israel's right to win its war on terror. They have a right to win that war. And I will give Israel the support that it needs to win, but I do want them to win fast. Wouldn't that be nice? If they could win fast. We have to let them win fast.\n\nWe will restore stability and peace in the Middle East and we will be sure that it'll be peace through strength.\""}, {"id": "40a42329-5533-4f22-a704-62e2c83cb74c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32490/", "date": "2024-08-16 09:12", "message": "1. \"Israel is a tiny little spot compared to these giant land masses. Surely a tiny spot. I actually said - is there any way of getting (more)... So tiny.\""}, {"id": "d676a098-1179-4127-93ed-b9660c4365d2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32489/", "date": "2024-08-16 09:10", "message": "Trump has stirred up social networks with his remarks at a conference against anti-Semitism tonight, with the Israeli flag behind him:\n\n1. Israel is so tiny... is there any way of getting (more).\n\n2. Israel should be allowed to defeat terrorism. It has a right to do so. It would be nice if it happened quickly. I will support that.\n\n3. I will deport and arrest all Hamas and Jihad supporters in the US\n\nHere are the full quotes 👇👇"}, {"id": "e5c63cea-1f46-403d-adf2-310ce32188ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32488/", "date": "2024-08-16 03:39", "message": "Following Abu Mazen's announcement that he will arrive in the Gaza Strip, a Gazan writes on social media:\n\nاي حد جاي ع غزة حتى لو الريس هاتلنا شباشب وشامبو معك\n\nFor everyone who comes to Gaza, even if it's the Rais (the President, Abu Mazen - AA), bring us some slippers and shampoo..."}, {"id": "788b0d62-2980-4bb0-bee1-8d842723dcc3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32487/", "date": "2024-08-16 03:36", "message": "Sicily, Italy: Mount Etna in a spectacular night show that caused the closure of the island's airport for many hours."}]