[{"id": "fb31ccc3-14ea-4c23-b61f-2d7b9558800d", "channel_id": 1560386984, "url": "", "date": "2024-08-14 14:20", "message": "Sources associated with the Iranian opposition, located in Western Europe, report a broad cyber attack against the Iranian banking system, including the Central Bank and other banks in the country. The attack causes extensive disruptions in bank operations and service to citizens."}, {"id": "36bc2698-6cc5-4630-ae45-37cc62c5ca53", "channel_id": 1560386984, "url": "", "date": "2024-08-14 14:19", "message": "The supreme leader of Iran in a meeting with senior officials:\nThe enemy is trying to instill fear among our people against the military capabilities of the USA, Britain and the Zionists.\nIt's psychological warfare. The enemies are not as strong as they are shown and we have to trust ourselves.\nThe enemy's goal is to push us back economically and politically through psychological warfare.\n\n##\nFunny when it comes from him.... There are no mirrors there in Iran? A paper tiger."}, {"id": "dbe3cd0c-3611-4e03-86bd-026f4b513314", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32411/", "date": "2024-08-14 14:19", "message": "Iraq: On the occasion of the 40th day, which the Shiites celebrate (40 days after the martyrdom of Imam Husayn ibn Ali, the grandson of the Prophet Muhammad), the Iraqis pasted Prime Minister Netanyahu's pictures on garbage trucks in the city of Karbala, which is holy to the Shiites."}, {"id": "193fcbbb-69ec-4e43-8c78-2ba1ba79386e", "channel_id": 1560386984, "url": "", "date": "2024-08-14 14:14", "message": "The Lebanese Ministry of Health officially announces that the number of injured in the Israeli drone attack 👆 today at noon at al-Abasia junction in Tyre has risen to 17, of which 4 are seriously injured."}, {"id": "aac95906-eb03-47ea-a390-035526a25109", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32406/", "date": "2024-08-14 14:14", "message": "The Palestinians report 6 \"martyrs\" in the IDF's activity today in Tubas and Tamun.\nAttached is a picture of five of them."}, {"id": "6cbad6dc-0fbc-41c9-8de9-cdfd0e2bf0a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32403/", "date": "2024-08-14 12:51", "message": "Lebanese channels: An Israeli UAV attacked a motorcycle a earlier this afternoon the area of ​​Abasia junction in Tyre (South Lebanon).\n\nLebanese channels report ten wounded, three of whom are in a serious condition as a result.\n\nUnofficial Lebanese channels report one person killed in the attack."}, {"id": "3935a00f-d9cf-48c1-83fc-a2a178af7d0f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32402/", "date": "2024-08-14 11:55", "message": "Sahil al Hindi, a member of the political bureau of Hamas states:\nWe will not be part of the ceasefire talks tomorrow whether they are in Egypt or Qatar."}, {"id": "fd9602d0-c131-4c6e-a163-0bee715da6e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32401/", "date": "2024-08-14 09:37", "message": "The feeling of descalation?\nThe French news agency reports that the airlines Air France and Transavia will resume their flights to Beirut tomorrow."}, {"id": "7e516a0f-6b8d-4d75-a0da-853c0fb5edfd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32400/", "date": "2024-08-14 09:36", "message": "The Lebanese Ministry of Health with official data on the war:\n\n547 dead and 1,765 wounded in Lebanon since the beginning of the war.\n\nOver 100 thousand people were evacuated from their homes in Lebanon."}, {"id": "65255f9d-7df8-4de6-be0e-58bb882d7fa9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32399/", "date": "2024-08-14 07:42", "message": "The Lebanese Al Mayadeen (identified with the \"Axis of the Resistance\") from a senior source in the \"Resistance\":\n\nHamas will not take part in the talks on the ceasefire in Doha (Qatar) tomorrow."}, {"id": "24f174b3-223e-4032-bb64-343a795ce41c", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73225/", "date": "2024-08-14 07:30", "message": "Lebanese sources: Movement of displaced Lebanese towards the west of Beirut and towards the Baalbek district due to the fear of Israeli attacks on Hezbollah strongholds in Beirut's Dahieh."}, {"id": "0475679c-4400-478e-9ef7-b44a4664550b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32399/", "date": "2024-08-14 07:30", "message": "Afghanistan: The Taliban is holding a military parade today at the Bagram base - which was the largest American air base in Afghanistan.\n\nAmerican military equipment also appears in the parade...\n\nThe parade on the occasion of the anniversary \"of the liberation of Afghanistan from the American occupier\"."}, {"id": "743ff0de-5141-4d02-8c1e-e1869b7eff2a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32399/", "date": "2024-08-14 07:12", "message": "One of the IDF jeeps that was hit by an IED in Tubas this morning."}, {"id": "b274631b-f653-43b1-b84f-9f01ea3e1497", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32399/", "date": "2024-08-14 07:00", "message": "Iranian revenge and Hezbollah's revenge - a brief snapshot\n\nWe are now on the 14th day since the assassination of Ismail Haniyeh in Tehran and since the Iranian announcement of \"revenge against Israel\". This year, the Iranians always took revenge by the 12th day after hoisting the revenge flags...\n\nThe Americans are throwing all their weight behind preventing regional escalation and are deploying military forces on an unprecedented scale: aircraft carriers, submarines, tens of thousands of soldiers and much more. At the same time, last night's report on the approval of a large arms deal in the amount of 20 billion dollars and the announcement by the Western countries of their commitment to the defense of Israel - are doing their part. It certainly deters Iran and Hezbollah.\n\nIn addition, today the US is sending special envoy Amos Hochstein to Beirut, at the same time as a broad diplomatic effort aimed at Thursday - negotiations on a ceasefire deal in Gaza.\nThe Iranians already sound less determined than before regarding revenge. The public announcements are more hesitant.\n\nIt is evident that everyone is waiting with eager anticipation for the results of the round of negotiations on Thursday and the Biden administration really wants it to succeed this time - this will surely also bring unprecedented pressure on Israel behind the scenes.\n\nThe big danger is that the greater the expectation from the negotiations, the greater the disappointment if the round does not succeed."}, {"id": "e749e927-9016-4283-8bf7-6c44716281f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73225/", "date": "2024-08-14 06:58", "message": "The operation in Tubas and Tamun:\nThe Palestinians report that the IDF forces are in possession of three bodies of Palestinians who were killed as a result of the (first ever) Israeli aircraft attack in Tamun."}, {"id": "a122ade8-ab48-434a-936d-5438ba6324cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32392/", "date": "2024-08-14 06:55", "message": "Lebanon: Lebanese channels claim that tonight Israeli warplanes fired shots over the airfield in Beirut and over the Dahieh area."}, {"id": "14077a1a-ca53-4818-a145-c32a4c8a8710", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32391/", "date": "2024-08-14 06:54", "message": "Brazil neighborhood in Rafah in the southern Gaza Strip - the erasure of buildings."}, {"id": "761a301c-15f3-4eca-8fd4-4bd839d465f4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32390/", "date": "2024-08-14 06:54", "message": "The IDF spokesman published an infographic of the location from which Hamas launched rockets towards Tel Aviv yesterday.\n\nThe launch was made from Khan Yunis right inside the humanitarian route through which the aid trucks pass from the south of the strip to the center and north.\n\nThe IDF spokesman reported that the IDF attacked the area from which the launches were carried out yesterday."}, {"id": "91aac5cb-9582-429f-ae0d-cb03f62e9cba", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32389/", "date": "2024-08-14 06:51", "message": "Gaza Strip:\nThe Palestinians report 12 deaths tonight in two IDF attacks in the Maghazi refugee camp in the center of the Gaza Strip:\n8 killed in the attack on the house of the Abu Nada family.\n4 killed in the attack on the Eid family home.\n\nIt was also reported that two more were killed in the attack on the Mazin family home in Beit Lahia in the north of the Gaza Strip."}, {"id": "01f83737-5bce-4c50-abca-54496ac997d4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32387/", "date": "2024-08-14 06:50", "message": "Palestinian channels report that in the early morning the PA's security mechanisms detonated, in a controlled manner, an explosive device that was planted to hit IDF forces in Jenin."}, {"id": "457b5377-842d-46b8-82b0-5dc1173f684f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32385/", "date": "2024-08-14 06:48", "message": "The IDF announced a military operation in Tubas and Tamun in northern Samaria\n\nBefore this morning's announcement of the operation, IDF forces surrounded a building in Tubas where terrorist Faiz Dagharma - a released prisoner - was hiding. The Palestinians reported that the forces fired shoulder-fired missiles and even attacked from the air in the area of ​​the house. He was eliminated and apparently others were arrested.\nDuring the exchange of fire in Tubas, Palestinian terrorists detonated explosive devices at the forces."}, {"id": "aa8e412a-15f4-4769-bebb-9ef20e112cd1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32384/", "date": "2024-08-14 06:44", "message": "The US approved an arms deal worth about 20 billion dollars to Israel.\n\nThe deal includes:\nAir-to-air missiles worth $102.5 million.\nTank shells worth 774 million dollars.\nTactical vehicles worth $583 million.\nF-15s worth $18.8 billion."}, {"id": "e8be3c06-e961-40e0-a2e4-432bc94bbd69", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32383/", "date": "2024-08-14 06:44", "message": "The Lebanese Al Mayadeen channel: The American base in the Koniko gas field in Syria was attacked by rockets.\n\nAccording to other sources, 4 Grad rockets were fired at the base.\n\n##\nThe Pentagon admitted this evening that 8 American soldiers were injured last week in an unmanned aerial vehicle attack on an American base in Syria."}, {"id": "0b92a78f-7ad8-4c9b-b0b7-6654e3ee55f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32382/", "date": "2024-08-14 06:42", "message": "Ahmed Abd al-Hadi, Hamas representative in Lebanon in an interview with the Russian news agency RIA Novosti:\nWe will not participate in the Gaza ceasefire talks, scheduled for Thursday."}, {"id": "b82686a1-3d26-44e3-960d-3c678eed83c5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32376/", "date": "2024-08-14 06:40", "message": "Hebron: Reports of two Palestinians injured in an explosion that happened last night inside a vehicle in the Haska area in the northwest of Hebron.\n\nThe circumstances of the explosion are being investigated."}]