[{"id": "4a45e89c-1908-4998-95e9-132c6fadf39c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28193/", "date": "2024-06-01 08:04", "message": "Gaza Strip: The Palestinians sell empty IDF ammunition boxes as firewood.\nAccording to the seller in the video, the IDF wooden box weighs about 7 kg and is sold in the market at a price of NIS 25-30 per unit.\nThe Gazans use it as a substitute for cooking gas - they use wood to light a fire on which they cook food and make coffee."}, {"id": "4c0b9b3f-7d6b-48a6-bab0-4e83133e5112", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28192/", "date": "2024-06-01 07:42", "message": "Hamas supporters are enthusiastic about the fact that in the video in which the spokesman of the Hamas military wing claimed this week that \"a soldier was kidnapped\" (something vigorously denied by the IDF spokesperson), one of the Hamas operatives is seen wearing flip flops.\n\nThroughout the week, Hamas supporters praised the \"famous flip flop\" seen in the video and now Palestinian shoe stores are offering such models for sale - like the one in the attached photo taken in Hebron."}, {"id": "766ad57c-db32-42a1-adce-7dccd5ccbf3f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28191/", "date": "2024-06-01 07:29", "message": "At the end of President Biden's press conference yesterday, he was asked by reporters, as he left the room, what his response was to the issue of Trump's conviction in court.\nBiden pauses for a moment, gives a big smile and continues without answering the reporters."}, {"id": "9d60096a-07f1-496a-85d6-8e2a40b1d2f4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28190/", "date": "2024-06-01 07:29", "message": "King of Bahrain: We are working to renew diplomatic relations with Iran."}, {"id": "6fda00e3-70d8-4c22-82ed-238ddd106a00", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28189/", "date": "2024-06-01 07:26", "message": "Senior Hamas official Muhammad Mardawi on the proposal presented by Biden last night:\n\nWe have not yet received the details of the offer.\n\nIf the Biden administration does not put pressure on the Netanyahu government, the deal will not see the light of day.\n\nA deal cannot be reached until both demands are addressed: the withdrawal of IDF forces from the Gaza Strip and a comprehensive ceasefire."}, {"id": "0802da3e-c1f1-4919-8509-ca844ded53e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28188/", "date": "2024-06-01 07:25", "message": "Lebanese media report two injured after an Israeli UAV attacked a motorcycle in Majdal Salem in southern Lebanon this morning."}, {"id": "c3e6edeb-1a0c-4ffa-be94-c1723bc03f6d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28187/", "date": "2024-06-01 07:23", "message": "Leading Palestinian channels report from the family of the terrorist who carried out the stampede attack near Nablus in which two IDF soldiers fell this week that their son stayed at a PA police station and then left it and his whereabouts are now unknown.\n\nAccording to the family, the governor of Nablus and the security mechanisms of the Palestinian Authority informed them that their son must turn himself in to the IDF and that the security mechanisms of the Palestinian Authority cannot bear the responsibility of his being inside the headquarters of the Palestinian Authority after the IDF threatened to break in if they continued to hold him without handing him over. Because of this, all PA headquarters refused to let this risk remain in their property, according to the report.\n\n##\nI will mention that the identity of the terrorist is known to Israel's security forces."}]