[{"id": "c07d35ea-ce13-41fe-bcb4-5430c6feefe4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33014/", "date": "2024-08-24 19:19", "message": "Tehran's Revolution Square: A poster featuring the images of Ismail Haniyeh and Qasem Soleimani looking toward the Temple Mount."}, {"id": "39b99cba-96bd-4e6b-8d26-7ff919af3563", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33013/", "date": "2024-08-24 19:11", "message": "Al-Jazeera, citing medical sources, reports 71 Palestinian casualties today in central and southern Gaza due to IDF airstrikes."}, {"id": "9bed0401-1b32-4dc8-8eac-f6de7d4a312a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33012/", "date": "2024-08-24 19:04", "message": "For those who don't know, this is Gazan comedian Abu Libda, one of the most famous \"celebrities\" in the Strip, even before the war (also known by his full name - Mahmoud Fat'hi).\n\nHere, Abu Libda pokes fun at Awad Barbach and does an impression of him with \"Abu Ismain.\""}, {"id": "06cf920e-7be6-4b2b-b641-b9df9a14803d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33011/", "date": "2024-08-24 19:00", "message": "More on food in the Gaza Strip: Iman Naim's recipe for Gaza-style fried spam..."}, {"id": "580ec9db-8bd1-4c31-8185-dea741f89621", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33010/", "date": "2024-08-24 18:58", "message": "Abu Khader from Deir al-Balah couldn’t remain indifferent to the clip of the new falafel stand in Netzarim 👆. Here is what he had to say on the topic:\n\n“Interpret this, Dwairi! (al-Jazeera’s military analyst who always downplays the IDF's capabilities and achievements - AA)\n\nThey’ve started setting up falafel stands… and they’re even cheaper than ‘Falafel a-Sousi’ (a famous falafel place in Gaza - AA).\nTen falafel balls for a shekel...\n\nNext time, they might set up shawarma stands…”"}, {"id": "27fd3ec9-c429-4412-9798-98e7c9725d2f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33009/", "date": "2024-08-24 18:55", "message": "What Will Happen with Deir al-Balah?\n\nA Gazan journalist who was evacuated from Rafah says:\n\n\"I believe Israel plans to evacuate everyone in Deir al-Balah, just as they did in Rafah. Although they said evacuating Rafah was impossible due to its million residents, it was eventually fully evacuated.\n\nDeir al-Balah will be evacuated gradually, but where will its million residents go? Rafah is closed, the northern Gaza Strip is closed, and the Muwasi area is full. \n\nI need an answer. If the army is evacuating us, they should provide a plan for where we can go — open Rafah, open the northern Gaza Strip, something...\"\n\n##\nAccording to the IDF’s evacuation instructions, Deir al-Balah is being evacuated gradually, and its areas are shrinking.\n\nIf Deir al-Balah is to be fully evacuated, lessons from Rafah suggest setting up barriers to guide people through controlled channels for screening, which would help prevent the movement of terrorists and hostages."}, {"id": "c34e8df1-7e79-45df-9f30-150cb275a8ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33008/", "date": "2024-08-24 18:51", "message": "Palestinian channels report that IDF forces have advanced 150 meters west of Salah a-Din Road (marked in red) in the Deir al-Balah area in central Gaza."}, {"id": "109195fe-31c3-4843-a480-7ea7083abef7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33007/", "date": "2024-08-24 18:51", "message": "The IDF spokesperson announced the deaths of Sergeant First Class Danil Pechenyuk, Sergeant First Class Nitai Metodi, and Sergeant Major Yaniv Itzhak Oren, all from the Jerusalem Brigade. They were killed in a battle in central Gaza.\n\nMay their memory be a blessing."}, {"id": "6a13d0ea-9c91-4e52-bb03-ba2d00276be1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33006/", "date": "2024-08-24 18:45", "message": "The progress of the Ukrainian forces in Kursk Oblast, Russia\n\nBelow is the map from August 18th, and above is the map from today.\n\nNote the additional areas now marked in blue near the border in the upper left corner of the updated map.\n\nThe territory under Ukrainian control has been steadily increasing."}, {"id": "d5776d41-e8b3-4625-ac9f-5a6d9a94f13b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33004/", "date": "2024-08-24 15:33", "message": "The Chairman of the Joint Chiefs of Staff of the United States has reportedly made a surprise visit to the Middle East.\n\nHe is expected to visit Jordan today, followed by Israel and other countries, with the aim of preventing regional escalation."}, {"id": "cbe24b21-c197-4d70-9cc1-ad23c6b6f214", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33003/", "date": "2024-08-24 15:32", "message": "Palestinian Reports of Fighting in East Deir al-Balah in Central Gaza\n\nSeveral Palestinian sources report exchanges of fire between IDF forces and Hamas militants in the eastern suburbs of Deir al-Balah.\n\nIn the past hour, Hamas's military wing has issued two separate statements about its fighters' engagement in eastern Deir al-Balah. At the same time, Palestinians report an attack (see the attached video) on Abu Areef Street in eastern Deir al-Balah."}, {"id": "7ef519a3-0587-47ea-9c05-4a6d69c36c84", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33002/", "date": "2024-08-24 12:58", "message": "The new Iranian foreign minister has a good sense of humor.\n\nThe Ministry of Foreign Affairs of Iran, which regularly sends UAVs to the Russian army to attack Ukraine, wishes a happy Independence Day to the Ukrainians..."}, {"id": "b729a8ce-9c86-4680-868f-fb4d2d5a74ac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33001/", "date": "2024-08-24 12:52", "message": "Iranian Foreign Minister Abbas Araghchi:\n\n\"The Israeli aggression against our sovereignty will not go unanswered.\nOur response will be accurate and calculated and we take into account all issues.\nRevenge will happen at the appropriate time and place. There is no doubt about it.\n\nWe will not fall into the trap that they have set ...\"\n\n##\nThe flag of vengeance wears out Ya Araghchi, what trap are you talking about?\nIf you want to shoot, shoot.\nDon't talk... 😁"}, {"id": "ccac11f0-eecd-4deb-9515-9bd127b7e82c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33000/", "date": "2024-08-24 10:53", "message": "The area inside the Hamad neighborhood in Khan Yunis, where IDF forces operated for the past five days.\n\nAccording to Gazan journalists - the destruction was caused by bulldozers, as well as airstrikes."}, {"id": "70a75928-9b93-4404-bc22-aebf8f04d65f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32999/", "date": "2024-08-24 10:02", "message": "Seven Hezbollah members were killed yesterday, along with one of Hezbollah's scouts who also died in the strikes.\n\nLebanese sources report an additional casualty - who was injured in Israeli attacks in southern Lebanon yesterday and died today from his wounds."}, {"id": "3947fc4d-e052-4713-aaac-45e4950bfd44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32998/", "date": "2024-08-24 09:59", "message": "Follower D points out that Adam Kadyrov 👆 conducted the weapons training under the watchful eyes of his father and President Putin."}, {"id": "dc7ae80c-b971-455a-b080-7a7f7793f1cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32997/", "date": "2024-08-24 09:58", "message": "Senior Hamas official Mahmoud Mardaoui: \n\n\"The arrival of the Hamas delegation in Cairo does not mean that we have entered into a round of talks. The delegation will receive updates from the Egyptians.\""}, {"id": "40ed7e23-82eb-43cd-9028-8ea93a3b2c39", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32996/", "date": "2024-08-24 09:56", "message": "Journalists in Gaza report that approximately 50 Palestinian bodies have arrived at Nasser Hospital in Khan Younis since this morning, including at least 11 bodies recovered from the Hamad neighborhood following the withdrawal of IDF forces from the area. \n\nThe recovery of bodies from Hamad neighborhood is still ongoing."}, {"id": "020d48a9-6341-46ca-b507-8d5792fecfe5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32995/", "date": "2024-08-24 09:55", "message": "Gaza sources: IDF forces withdrew from the Hamad neighborhood in northern Khan Yunis."}, {"id": "3727d5ef-e9b7-4747-b9a8-9d4fc420e200", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32994/", "date": "2024-08-24 09:55", "message": "The Civil Defense in Gaza claims that Israeli military strikes and operations have reduced the safe area in the Gaza Strip from 230 square kilometers to just 35 square kilometers."}, {"id": "273933d4-ebc5-430f-a334-bf98f3e46f28", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32993/", "date": "2024-08-24 09:52", "message": "UNRWA: 90 percent of the population of the Gaza Strip has been evacuated since October 2023."}, {"id": "d5f5dbd8-cffe-47e1-bc65-47efc9691803", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32992/", "date": "2024-08-24 09:52", "message": "The Qatari Al Jazeera network publishes a video it claims was filmed by IDF soldiers showing the explosion of the Great Mosque in Khan Yunis, which was established 96 years ago."}, {"id": "8ac4843e-3d1c-4ae6-85b3-b9aa4f159034", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32991/", "date": "2024-08-24 09:51", "message": "Arab sources: A delegation of senior Hamas officials will arrive in Cairo today to meet with senior Egyptian officials and be updated on the ceasefire negotiations."}, {"id": "9102dfa6-703b-49e2-baf4-f9ce070aaa80", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32990/", "date": "2024-08-24 09:50", "message": "Rafah: the area of ​​the al-Awda Mosque and Rafah municipality: before the war and now..."}, {"id": "681aee8e-23b7-4dbe-801d-8a150d86a226", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32989/", "date": "2024-08-24 09:39", "message": "Kadyrov Jr., 16, the son of Chechnya's president, shows the cameras his skills in shooting golden machine guns."}, {"id": "21fe8aa2-0aa5-4f93-866b-08728b7c9c7e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32987/", "date": "2024-08-24 09:38", "message": "The PA's security apparatus dismantle and detonate a large explosive device in a controlled manner that was planted on the Tayasir-Tubas road in Samaria.\nIt was placed on a road the IDF forces go through when entering Tubas, with the aim of hitting the forces."}, {"id": "14b04701-2033-4ba7-b4fe-e013da1440c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32985/", "date": "2024-08-24 09:17", "message": "Ukrainian soldiers wave the Ukrainian flag at Lebedevka in the Kursk region in Russian territory."}, {"id": "06f5d2fd-0f76-49e4-b563-96c275f7c997", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32984/", "date": "2024-08-24 09:16", "message": "7 Hezbollah operatives killed yesterday + one of Hezbollah's boy scouts, who was also killed in attacks yesterday.\n\nLebanese sources report that there is another dead. He was injured in IDF attacks in southern Lebanon yesterday and died today from his wounds."}, {"id": "f6ed9a02-74f4-4a12-894b-c02c4d541392", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32983/", "date": "2024-08-24 09:15", "message": "Hezbollah announced a seventh death in its ranks yesterday:\n\nAli Alhak, a resident of the village of Kouakh in northern Lebanon (Harmel), near the border with Syria.\n\nThe northerner Ali was killed, like the six before him yesterday, in IDF strikes in southern Lebanon.\n\nHezbollah is placing northern operatives in southern Lebanon... apparently there is a shortage..\n\nNumber 429"}, {"id": "191d4f15-d238-4ddc-8293-32e584b7a0fe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32982/", "date": "2024-08-24 08:42", "message": "Taiwan's Ministry of Defense reports that 38 Chinese fighter jets and 12 Chinese ships operated around Taiwan this morning. Of the aircraft, 32 violated Taiwan's airspace."}, {"id": "67c2fb1a-410f-42ae-9451-fb44dcf92a27", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32981/", "date": "2024-08-24 08:40", "message": "The Houthis in Yemen have released footage of the attack on the Greek oil tanker SOUNION yesterday. The tanker caught fire and was abandoned.\n\n##\nThe Houthis have begun investing in music in their videos..."}, {"id": "0c589bb5-7f5a-42c5-95f3-e9e60aa3c017", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32980/", "date": "2024-08-24 08:36", "message": "The attack yesterday in Syria:\n\nAccording to the official Syrian news agency, Israeli fighter jets attacked several sites in central Syria from the direction of northern Lebanon. \n\nThe agency also claims that seven civilians were injured in the attack and property was damaged."}]