[{"id": "94bb05de-a9a4-440b-970c-ca56692f82df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32700/", "date": "2024-08-19 19:25", "message": "The American Foreign Minister Blinken: Netanyahu informed me that Israel accepts the offer made by the USA. We are waiting for Hamas' answer.\n\n##\nThis is an important statement by Blinken that puts the fate of the current round of negotiations in the hands of Hamas. The ball is in their court."}, {"id": "e6f35252-6927-4949-bb53-9ffec8306da7", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73595/", "date": "2024-08-19 18:34", "message": "7 of the 9 dead were Ismail Haniyeh's companions and security guards.\n\nEven in bowling this is considered a respectable score in one shot..."}, {"id": "a9898847-060b-4ce3-8326-003d0d4c1653", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73595/", "date": "2024-08-19 18:33", "message": "The attack in the Biout es Sayed area in southern Lebanon a short time ago."}, {"id": "d33e19c5-b014-4ac8-bb0d-62de31581ca3", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73595/", "date": "2024-08-19 18:33", "message": "Lebanese channels are reporting an Israeli attack now in the Biout es Sayed area in the Tyre governorate in southern Lebanon."}, {"id": "55c4e9da-5489-4a45-a598-b11d637a1455", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73593/", "date": "2024-08-19 18:26", "message": "A powerful attack by Israel on what appears to be a particularly high-quality target in the Beqaa area, and this is happening at a time when we are still waiting for Hezbollah's response to the elimination of Fuad Shukr...\n\nThat's how it should be done! Respect."}, {"id": "ff34687b-bb3c-4a53-81bc-3dfd08f745a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73593/", "date": "2024-08-19 17:49", "message": "It seems that Independence Day came early in the Beqaa area in Lebanon..."}, {"id": "9afa4c80-3cfc-4ae0-bd5f-0511bb495e03", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32691/", "date": "2024-08-19 17:46", "message": "Spectacular documentation from the sites that were attacked in the Beqaa area. The Lebanese report three attacks carried out by Israeli aircraft."}, {"id": "9e969d55-9a12-463b-a37c-8a7b4ca203c8", "channel_id": 1560386984, "url": "", "date": "2024-08-19 17:45", "message": "Lebanese channels report on a series of attacks by the IDF near the village of Nabi Chit in the Beqaa area in the depths of Lebanon.\n\nIn the attached videos, secondary explosions and the launching of rockets can be seen, which indicates the presence of weapons and explosives. It also seems that a large fire broke out on the spot.  The target was definitely hit."}, {"id": "8d0099f9-07c5-43bf-936b-06380e0f747b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32687/", "date": "2024-08-19 17:28", "message": "The IDF spokesperson announced the fall of a commander in the paratrooper special forces in a battle in the southern Gaza Strip.\n\nMay his memory be for a blessing."}, {"id": "70f32f1d-b3cb-438d-adf0-f0a29bd5afa4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32685/", "date": "2024-08-19 17:25", "message": "A Hezbollah supporter saw fit to obscure the faces of some of those appearing at the scene of the attack in Lebanon. Probably to protect them from the IDF. \nSo here it is... with and without the blur (:"}, {"id": "e47adb3d-9550-4521-a693-4ca2db318925", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32684/", "date": "2024-08-19 17:25", "message": "Lebanese channels reported an an attack about an hour ago on a vehicle Deir Qanoun Ras el Ain in southern Lebanon (Tyre district).\n\nUnofficial Lebanese sources report a death and a number of wounded in the attack.\nAccording to these sources, they appear to be Palestinian."}, {"id": "06f27561-7296-40f4-803e-9498a9cc2be6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32683/", "date": "2024-08-19 17:18", "message": "The Palestinians report 9 deaths in an Israeli attack on a group near Ismail Haniyeh's home in the Shatti refugee camp in the west of Gaza City."}, {"id": "1c7fb49a-52a7-41b8-b858-86e081d6ea09", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32682/", "date": "2024-08-19 17:17", "message": "One of the passengers in the UN convoy recorded two minutes of the destruction he saw while in the northern Gaza Strip."}, {"id": "e774a40b-531a-47b2-8d67-6311f007b467", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32681/", "date": "2024-08-19 15:52", "message": "In response to this 👆, a friend of the Algerian president said: \n\n\"If your army wants to fight Israel, you don’t need favors from Egypt to open the border. Just come by sea.\""}, {"id": "1099d023-ed98-4ddc-8847-1144103f6601", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32680/", "date": "2024-08-19 15:51", "message": "A 36-second video illustrating the sanitation levels in Lebanon...\n\n#Ratatouille"}, {"id": "8919438c-26cd-4539-9e06-aee76f3a211e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32679/", "date": "2024-08-19 15:48", "message": "Another Lebanese woman took the news of sonic booms in Lebanon very hard. You don't need to know Arabic to understand what she means.\n\nThe breaking of the sound barrier by Israeli fighter jets has become the talk of the day in Lebanon."}, {"id": "2b79ba09-6e54-41ff-9a38-b9a8fc122963", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32678/", "date": "2024-08-19 15:47", "message": "A Lebanese woman, hearing sonic booms caused by Israeli warplanes while flying over Lebanon, was convinced she had been bombed.\n\nToday, Lebanon filed an official complaint with the United Nations about Israeli fighter jets breaking the sound barrier in its airspace."}, {"id": "2ea8a73c-1d1e-4b9a-97ef-b89dbde0475a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32677/", "date": "2024-08-19 13:16", "message": "If you come across significant accounts on social networks that glorify the suicide attacks announced by Hamas today, please send me an email or DM on Twitter and we will promote activities to delete them.\nThis is a good opportunity to clean the network from filth. The announcement by Hamas caused many to show their true faces. I believe that the administrators of the social networks will not be able to remain indifferent to the encouragement of suicide attacks."}, {"id": "eda7e13d-df79-4162-a025-4fb0bfc535cd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32676/", "date": "2024-08-19 13:14", "message": "Many Palestinians are excited and happy (!) about the announcement by the military wing of Hamas about the return of suicide attacks in Israeli territory.\n\nHere is one of the examples on Facebook by the veteran Gazan journalist, supporter of Hamas, Safinaz al-Louh.\n\nI'm attaching a link so you can report her account on Facebook (not just the post itself)\nAnd all those who are celebrating in the comments...\n\n👇👇👇\nhttps://www.facebook.com/share/FnPpSP8pf8VpEVin/?mibextid=oFDknk"}, {"id": "f2069432-08ab-4d3a-a000-985ff98dc6d4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32674/", "date": "2024-08-19 12:43", "message": "Two more videos of an attack on the Zakat building in Nuseirat in the center of the Gaza Strip yesterday evening (after an evacuation warning)."}, {"id": "e3f6e307-bf18-4196-9dc9-78e622937e4b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32673/", "date": "2024-08-19 12:37", "message": "The IDF spokesperson announced the fall of a tracker in the Border Protection Corps in the north of Israel (as a result of Hezbollah's UAV attack today).\n\nMay his memory be a blessing."}, {"id": "a4807fea-38f5-4dc4-a863-fa9b210cd99d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32671/", "date": "2024-08-19 12:36", "message": "Hezbollah announces two deaths in its ranks:\n\nAbbas Melhem\nMuhammad Kaduh\n\nThey were killed in the IDF drone attack this morning in Houla 👆\n\n416 dead for Hezbollah since the beginning of the war."}, {"id": "3b762de8-9b83-4eda-a259-ac4d3946f740", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32669/", "date": "2024-08-19 12:36", "message": "The welcoming ceremony held for the President of Russia, Putin, today in Azerbaijan."}, {"id": "ecbab43a-2a7f-4667-a453-4da848cc494d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32668/", "date": "2024-08-19 11:13", "message": "Now that Hamas has accepted responsibility for an attack of the most terrible kind that the Jihad industry has to offer - suicide attacks aimed at harming the civilian population - Israel needs to leverage this acceptance of responsibility in front of the Western audience and remind them (because many of them have forgotten) that Hamas is an Islamic terrorist organization like ISIS.\n\nHamas at this time, while conducting negotiations for a deal that the whole world is engaged in, is proud and accepts official responsibility for terrorism of the type that the West knows and must condemn.\n\nIt should be ensured that Hamas will now pay the price in world public opinion. Hamas spared us the need to prove it was involved. The military arm admitted to it proudly."}, {"id": "fcbfe55d-f257-4d69-88d2-25ce555b6aed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32667/", "date": "2024-08-19 11:11", "message": "The military wing of Hamas accepts responsibility, in cooperation with the military wing of the Islamic Jihad, for the attack in Tel Aviv last night.\nAccording to the arm's statement, the suicide attacks will return to the scene in Israeli territory, as long as the massacres, the assassinations and the displacement of the residents continue."}, {"id": "b3ce935a-211f-4c30-bb3d-705f485194d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32666/", "date": "2024-08-19 09:20", "message": "The Lebanese Ministry of Health: Two killed in an IDF attack this morning in Houla in southern Lebanon (UAV attack)."}, {"id": "f2372981-bfe5-444c-a175-a89a8d36c495", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32665/", "date": "2024-08-19 09:19", "message": "Iranian Foreign Ministry:\n\nWe do not seek to escalate the situation in the region and we support the ceasefire efforts in Gaza.\n\nThe ball is in the American court - it must prove that it is serious about a ceasefire in Gaza and the end of the war. The US has the power to stop the Israeli fighting."}, {"id": "681502f4-0c4a-4506-976b-293f9529462f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32664/", "date": "2024-08-19 07:59", "message": "The terrorist who carried on his body the explosive device that exploded yesterday in Tel Aviv (together with him) has been referred to since last night on social media as \"الاستشهادي منفذ عملية تل أبيب\"\nThe martyr who carried out the attack in Tel Aviv\n\nThere is extensive discussion on social networks about the terrorist's nationality based on security camera images on the streets of Tel Aviv.\n\nMany Arabs online claim that he has a Turkish appearance but also other nationalities, in which a Palestinian identity emerges as a real possibility.\n\nSome summed it up like this: he has Islamic citizenship!"}, {"id": "b3fc1832-6cc0-472d-9d1c-5ec6bc07a1b4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32663/", "date": "2024-08-19 07:53", "message": "2. Iran would have been very happy to produce an attack with many casualties in Israel with a low profile, one that would be considered below the threshold of starting a regional war. That is, an attack that causes many deaths but not as a result of a missile launched directly from Iranian territory - a pattern of action parallel to the way Haniyeh was eliminated in Tehran - a \"local action\".\n\n3. Hezbollah, one of Iran's executive branches, has proven in the recent past that it has such capabilities.\n\n4. Hamas has a very high motivation to carry out deadly attacks on Israeli territory and has infrastructure in the West Bank.\n\nAs one Hezbollah supporter wrote:\nAllah was with the Jews tonight...\n\nWe have to give thanks for the magnitude of the miracle yesterday in Tel Aviv... and this after we had already spent almost the entire quota...\n\nFortunately, Zaka only had to collect the pieces of the body of the person who caused the explosion this time.\n\nPhoto credit: Zaka Spokesperson."}, {"id": "4ab525d0-a592-43f1-ac83-51aa57384455", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32662/", "date": "2024-08-19 07:53", "message": "The explosion in Tel Aviv last night - some insights\n\nThe commander of the Tel Aviv district stated last night that the person who carried a bag on his back containing a powerful explosive device that exploded around 20:00 in the evening in Tel Aviv, was not innocent. The suspect is being investigated as to whether the intention was terror or criminal. He also noted that the direction of the attack is very relevant - this is what has been said so far officially by security officials.\n\nA few points to note:\n\n1. Failure, at least according to Hamas' announcement last night, of the negotiations for a deal.\nIt should be noted that the negotiations for the deal appeared to hold off the reactions of Iran and Hezbollah to the assassinations at the end of July."}, {"id": "e41d9b7f-00a7-4baf-91f0-7565b933b5d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32659/", "date": "2024-08-19 07:15", "message": "Three more were released from prison in Israel in the last day:\n\nMuhammad Ayub Rajabi\nMajahed Koassami (from Hebron)\nYahya Jadou (from Bethlehem)\n\nTaking part in the before and after trend."}, {"id": "67c96fea-9e9e-472f-8be3-597f32ed0c50", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32658/", "date": "2024-08-19 07:13", "message": "The Palestinians complain: airlines from all over the world (including Western companies) stopped flights to Israel until next year (unconfirmed -AA), while FlyDubai of the United Arab Emirates continues to fly to and from Israel."}, {"id": "d66e4a6c-7413-472e-935f-290225224b6a", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73541/", "date": "2024-08-19 06:58", "message": "Hezbollah announced a short time ago:\n\nIn response to the elimination (of a commander in the Radwan force - AA) in Kadmous (Tyre) 👆 we attacked with suicide drones the headquarters of the Western Brigade in Ya'ara as well as a logistics base."}, {"id": "9ebdc1a3-9085-4508-889e-21c840cdcdfc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32656/", "date": "2024-08-19 06:56", "message": "A resident of Gaza curses the Arab countries against the background of the documentation of the displaced persons evacuating from the Maghazi refugee camp in the center of the Gaza Strip following the instructions of the IDF spokesman.\n\nWhere will the displaced people go?\n\nThe Gazan asks a question that is becoming more and more popular against the background of the continued evacuation instructions and the increasing density in the central area of ​​the Gaza Strip."}, {"id": "75b572aa-9e39-404e-b7a5-5677aecb94e2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32655/", "date": "2024-08-19 06:45", "message": "The elections are approaching in Algeria (September 7)... how can the president attract more votes?\nThe Palestinian card...\nThe president promises at an election rally: our army is ready to go to Gaza and fight... we just need Egypt to open the border for us....\n\nWords are free.\n\n##\nI'll speak in place of Al-Sisi, the president of Egyptt: come on man, the border is open..."}, {"id": "cea6fdef-b674-467d-995b-48b40ca3fd99", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32654/", "date": "2024-08-19 06:40", "message": "The Palestinians report that the IDF arrested Dania Hanatsheh tonight in Ramallah - one of the people released from the hostage deal with Hamas, who was released from prison in Israel last November."}, {"id": "8ccb53cd-01f4-47c8-b5b1-a1914be69920", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32653/", "date": "2024-08-19 06:38", "message": "The President of Colombia decided to ban the export of coal from Colombia to Israel: \"Colombian coal was used to make bombs that kill the children of Gaza\"\n\nHamas in a statement: We appreciate the move of the Colombian president."}]