[{"id": "964f3d8e-adf3-4294-a223-0e9aa38b56eb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27294/", "date": "2024-05-16 11:11", "message": "Lebanese channels report on an Israeli drone strike on a vehicle near the village of Qana in southern Lebanon.\n\nA man was killed and another was reportedly injured in the attack."}, {"id": "6015e329-1c5e-46c7-bd83-470433a8ca07", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27291/", "date": "2024-05-16 10:25", "message": "The Lebanese army today raided the Palestinian drug den called the Shatila refugee camp.\nArmy forces arrested 15 drug dealers and raided production laboratories. One drug dealer was killed.\nAccording to Lebanese sources, Shatila is responsible for 40% of the drugs that reach Beirut."}, {"id": "eb057eee-b7a6-44eb-9f73-1ff204acc295", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27290/", "date": "2024-05-16 10:12", "message": "The Egyptians are trapped with the Rafah crossing\n\nThe Lebanese Al-Akhbar (Hezbollah-affiliated) from Egyptian sources:\nSenior Egyptian officials have informed their American counterparts in recent days that forcing changes on the border between Egypt and Gaza (Philadelphia Axis) through military force is unacceptable. Israel replied to them, through the Americans, that the issue of Israel's control of the Rafah crossing has been decided and that Israel will not withdraw from it, and that the situation must be treated as a matter of course.\n\n##\nI will mention that the Egyptians refuse to open the Rafah crossing for the movement of goods as long as Israel controls the crossing and their position is that they are willing to cooperate in the crossing only with a Palestinian entity and not with Israelis.\nTheir position stems from a fear that they will be perceived as agreeing to the new reality in which Israel controls the crossing. As a result, the crossing remains closed even though Israel is ready to open it for the entry of goods and aid from Egypt.\nLast night Ismail Haniyeh, the chairman of the political bureau of Hamas, stated that the movement is in direct contact with the \"Egyptian brothers\" on this issue.\nEgypt is in an interesting trap that will only get worse as time passes and the crossing remains closed. In the meantime, beyond the issue of goods, there is no going out and no coming in through the crossing gates. Gazans who want to go to Egypt cannot.\nUntil before Israel took control of the crossing, about 700 people per day crossed into Egypt."}, {"id": "ed25cfa9-5b53-4ae0-9449-8497f049dfa2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27289/", "date": "2024-05-16 08:23", "message": "Hezbollah:\nWe launched 60 rockets at Nafah, Kela and Yoav bases in response to the overnight attacks in the Al-Beqah area."}, {"id": "f62b69d6-519c-4c48-bf6e-e9da59133c7f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27288/", "date": "2024-05-16 08:12", "message": "IDF Spokesperson: Following the report of a stabbing attack in the Samaria area, a short while ago, a terrorist arrived at the Yitzhar junction, stabbed an IDF NCO who was in his vehicle and fled. IDF soldiers are searching for the terrorist and have blocked roads in the area. \nThe NCO was moderately injured and has been evacuated to the hospital for medical treatment. His family has been notified."}, {"id": "39c16717-cb3e-4819-8060-89ce50e89b89", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27284/", "date": "2024-05-16 08:11", "message": "The Palestinians report that the IDF dropped leaflets this morning in the Deir al-Balah area in the center of the Gaza Strip, in which the details of Hamas operatives who carried out surveillance and spying operations on residents in the Gaza Strip to monitor that they are not acting against Hamas and its interests were revealed.\nThe IDF publishes a long list of identity card numbers of Gaza residents that appeared in Hamas's surveillance reports and invites each and every resident of Gaza to check if he was also followed by Hamas's intelligence personnel, according to the reports located in the Strip."}, {"id": "98bc2850-5fb5-45d2-bbbd-2df4a7632792", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27283/", "date": "2024-05-16 08:10", "message": "Al Jazeera: About 40 rockets were launched about an hour ago from Lebanon towards the Golan and the Galilee."}, {"id": "8451bc7e-0307-49ad-9d90-491062bcdae0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27282/", "date": "2024-05-16 08:09", "message": "US Central Command:\nThe floating pier off the coast of Gaza has been completed.\nIn the coming days, the aid containers will start arriving. American soldiers did not enter the territory of the Gaza Strip as part of the construction of the pier."}, {"id": "39ec6df9-8a90-40af-aeb3-a81aa4074629", "channel_id": 1560386984, "url": "", "date": "2024-05-16 07:57", "message": "An operative of Fatah's Al-Aqsa Martyrs Brigades cooperated with an operative of the military wing of Hamas, shooting together at the Tibba checkpoint this morning in revenge for the death of three Palestinians in Tulkarm tonight during the IDF's activity there."}, {"id": "343b073e-9ada-40c0-ae5d-eda5b06308c6", "channel_id": 1560386984, "url": "", "date": "2024-05-16 07:55", "message": "Extensive IDF activity tonight in West Bank cities to capture money exchangers who aided terrorism\n\nTonight, the IDF raided money exchangers throughout the West Bank in:\nTulkarm, Ramallah, Bethlehem, Hebron, Tubas, Qalqilya, Jericho and Jenin.\nAt the center of the activity was a large chain of money exchangers called \"Al-Khalij\", which has branches all over the West Bank. According to the Palestinians, funds were confiscated and employees of this network were arrested, including the director of the network, Alaa Abiat.\nAn activity was carried out against additional exchangers and in Tulkarm 3 Palestinian deaths were recorded as a result of an exchange of fire with the IDF during the activity.\nThe security mechanisms of the Palestinian Authority were informed in advance about the extensive activity of the IDF in the West Bank.\n\nAt the end of the activity, the IDF soldiers handed out \"bills\" with a warning about the activities of the Al-Khalij network and its support for terrorism (attached)."}, {"id": "af4d1704-993a-4d5c-b180-ed4016f23052", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27276/", "date": "2024-05-16 06:38", "message": "Russian President Putin visited his Chinese counterpart Xi Jinping as part of strengthening relations between the countries (and after Putin's re-swearing in as President of Russia for the next six years).\nPutin was highly respected according to all the rules of the ceremony."}, {"id": "7adc9595-1611-4a8e-a867-f7ad36cb6712", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27275/", "date": "2024-05-16 06:36", "message": "The scenes of destruction from the Zeitoun neighborhood in the south of Gaza City, after, according to the Palestinians, IDF forces withdrew from the area yesterday."}, {"id": "0e360d5f-a7aa-4c23-a4fc-f622f4a5015e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27274/", "date": "2024-05-16 06:35", "message": "The Palestinians report that tonight about 50 trucks of goods entered from Israel through the Kerem Shalom crossing, ordered by merchants from the Strip (not humanitarian aid - AA).\nHamas does not collect taxes on these goods (because they enter without going through Gaza customs - AA), which is supposed to lower the prices of the goods for the consumer, but in reality the prices are very expensive, according to reports from Gazans shared online."}, {"id": "41f23d2e-932b-4f83-a167-31e7771a61d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27273/", "date": "2024-05-16 06:34", "message": "The American NBC network reported last night that the construction of the floating dock of the US Army for the purpose of bringing goods into the Gaza Strip, will be completed within 24-48 hours."}, {"id": "f00c9414-942d-4760-923e-d8aa3ae38663", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27272/", "date": "2024-05-16 06:34", "message": "The Shiite militias in Iraq claim that they attacked a target in Eilat and the refineries in Haifa early in the morning using drones."}, {"id": "1a06fbfb-3f94-4ece-8604-65de2d3538dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27271/", "date": "2024-05-16 06:33", "message": "The Israel Police publishes documentation of the neutralization of a terrorist who tried to stab security forces soldiers around three in the morning in the Old City of Jerusalem.\nThere are no casualties among the police officers."}, {"id": "64e9dd95-376b-46c5-bf65-8ace2d1a7191", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27267/", "date": "2024-05-16 06:32", "message": "Tonight's IDF attacks deep in Lebanon\n\nThe Lebanese Al Mayadeen channel notes that the Israeli Air Force carried out 14 attacks tonight on targets in the Baalbek area (Al Baqa district).\n\nAccording to Lebanese sources, targets were attacked in the villages: Nabi Chit, Brital, Jarud and Al-Khariba.\n\nThere were no reports of casualties, it seems that the IDF mainly attacked infrastructure.\n\nThe attached diagram published by the IDF spokesperson in September 2019 shows an area in the village of Nabi Chit where Hezbollah's precision missile factories are located.\nAccording to Lebanese sources, this may have been one of the targets of the attack."}, {"id": "d293d423-22ae-440a-ba01-163b371a8cb2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27266/", "date": "2024-05-16 06:21", "message": "The IDF spokesperson announced this morning the death of 5 soldiers of the 202nd Battalion in the Paratrooper Brigade in battle in the northern Gaza Strip.\n\nMay their memories be a blessing.\n\nIn this battle, three more soldiers of the 202nd Battalion were seriously injured."}, {"id": "40b618aa-4c32-4ec2-9269-e4fe6eb7c6bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27265/", "date": "2024-05-16 06:19", "message": "Fires broke out at the site that was attacked in Baalbek."}, {"id": "b02b0bc4-7956-4784-935f-388a1bece77b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27261/", "date": "2024-05-16 06:18", "message": "Lebanese channels reported on at least 4 powerful attacks by the Air Force in the area of ​​Nabi Chit, in Baalbek deep in Lebanon, this morning.\nSyrian sources report that echoes of the attacks are also heard on the Syrian side of the border.\n\nThis is apparently an Israeli response to Hezbollah's drone attack this evening west of Tiberias, 50 km from the border into Israeli territory."}]