[{"id": "d385d8d5-932d-4efd-b50d-c94278d410be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31805/", "date": "2024-08-04 19:07", "message": "The IDF spokesman publishes documentation of today's attacks in Houla and Beit Leif in southern Lebanon.\n\nAccording to unofficial Lebanese sources, only two people were injured in the attack in Beit Leif (on a motorcycle), while two were killed in the attack in Houla."}, {"id": "16c6dfd1-7f53-4b75-93e7-aa9669f30440", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31804/", "date": "2024-08-04 17:34", "message": "Additional documentation from Mount Etna in Sicily - a lot of ash covers large parts of the island and the houses of the residents."}, {"id": "d5923115-6bfb-453c-a61f-e61035cec6dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31803/", "date": "2024-08-04 17:32", "message": "Lebanese sources report one killed and one missing in the attack on the Hossein family home in the Almaaqab neighborhood in Houla in southern Lebanon."}, {"id": "b9ea82e3-aa9c-4067-ad6e-d9aa3a9afa47", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31802/", "date": "2024-08-04 17:32", "message": "The Lebanese are reporting casualties and extensive destruction in an IDF attack on a building in the village of Houla in southern Lebanon about an hour ago."}, {"id": "f2b3dabf-7ee8-425e-82bf-26b1f348dbce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31801/", "date": "2024-08-04 17:31", "message": "This is what the Nasser school looks like in the west of Gaza City after the IDF attack earlier today.\nAbout 30 people were killed in the attack on the \"Nasser\" and \"Hassan Salama\" schools."}, {"id": "dae539c8-bafb-4a81-a31e-a4d079cc821f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31800/", "date": "2024-08-04 17:30", "message": "The Houthis publish special documentation of the fragments of the American MQ9 UAV that they claim they shot down in the Zada ​​district of Yemen.\nIn the video, the Houthis show the missiles carried by the UAV. They are not afraid that they will explode...\n\nAnd they don't forget:\nDeath to America\nDeath to Israel"}, {"id": "6e852c60-9d82-4c17-a0ce-38ef26719bd1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31799/", "date": "2024-08-04 17:29", "message": "Yesterday, with the elimination of the 9 terrorists in Tulkarm with airstrikes, Israel came to account with those responsible for the fall of two members of the security forces and the murder of an Israeli civilian.\n\nIDF Spokesperson: Nine terrorists were eliminated yesterday (Saturday) in Tulkarm, including a terrorist who took part in the killings of Sergeant First Class (Res.) Elhanan Ariel Klein, Superintendent Yitav Lev Halevi, and Amnon Mukhtar\n\nYesterday (Saturday), the IDF and ISA eliminated nine terrorists in two IAF strikes in the area of Tulkarm. \n\nFollowing the precise elimination of a terrorist cell that was on its way to carry out a terror attack, the security forces initiated a counterterrorism operation in the Tulkarm area. \n\nAs part of the counterterrorism operation, an IDF aircraft struck an armed terrorist cell that fired at the forces in the area of Tulkarm. A large amount of weaponry was located on the eliminated terrorists.\n\nIn the precise IDF and ISA strike yesterday morning (Saturday), five terrorists were eliminated, including:\n\nHaitham Balidi, a significant Hamas terrorist in Tulkarm. Balidi was part of the terrorist cell that killed SSGT (Res.) Elhanan Ariel Klein, who was killed in a terror attack adjacent to the community of Einav, and 'Yamam' fighter Superintendent Yitav Lev Halevi, who succumbed to his wounds after being critically injured during encounters with terrorists in a counterterrorism operation in Tulkarm. \nThe terrorist Haitham Balidi was responsible for many terror attacks throughout Judea and Samaria in which Israeli civilians were injured.\n\nAlso eliminated was the Islamic Jihad terrorist Abed Al-Jabbar Al-Sabbagh, affiliated with the terrorist network in the Nur Shams Camp, who was involved in a large number of shooting and explosive attacks against Israeli communities, including Bat Hefer, Avnei Hefetz, and Einav. \n\nIn addition, the terrorists Ali Khalil and Jamal Abu Haniyeh, who murdered Amnon Mukhtar in Qalqilya, were eliminated in the strike.\n\nOver the past few months, cooperation was identified between the Hamas terrorist organization in Tulkarm and additional terrorists in Nur Shams, in an attempt to carry out terror attacks against Israeli targets."}, {"id": "345b9621-8b9b-4911-a94e-2d6af5bd3c71", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31798/", "date": "2024-08-04 15:59", "message": "The Palestinians report that Abdel Fattah al-Zarii, who is in charge of the Ministry of Economy in Gaza on behalf of Hamas, was killed in an attack on his house on Salah al-Din Street in Deir al-Balah (the central strip), a short time ago.\nHis mother was also killed in the attack."}, {"id": "bf485564-ad3c-4baa-9da6-77e37378911d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31797/", "date": "2024-08-04 15:59", "message": "Iranian sources report significant GPS disruptions in the western region of Iran (Karmanshah), where Iran's missile bases are located (the shortest range for firing from Iran to Israel is from there)."}, {"id": "7f0d7da4-125c-43ff-bd1c-ee43b07f2a08", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31794/", "date": "2024-08-04 14:57", "message": "Karbala, the holy city for the Shiites in Iraq, is hosting a \"mourning pavilion\" for the Sunni Ismail Haniyeh, alongside the Shiites who were killed last week by Israel and the US, including Hezbollah Chief of Staff Fuad Shukr."}, {"id": "978c5672-4c66-4656-839d-e0740e75b2eb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31793/", "date": "2024-08-04 14:55", "message": "The IDF spokesman in Arabic publishes an evacuation notice for all residents of the southern neighborhoods of Khan Yunis:\nJurat al-Lot, Almanara, Maen, Kizan al-Najjar, Kizan Abu Rashwan, and also the neighborhoods of al-Salam and al-Ahshash in the north of Rafah.\n\n##\nThe evacuation comes against the backdrop of rocket fire today at noon from Khan Yunis."}, {"id": "f08e3621-6254-4b9a-911b-7114b39809fc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31792/", "date": "2024-08-04 14:54", "message": "The Houthis in Yemen: We shot down an American MQ9 drone"}, {"id": "170d7422-ea07-4b73-a18c-f53b5a8805f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31789/", "date": "2024-08-04 14:53", "message": "The Palestinians report that the death toll in the attack on the two schools - \"Hassan Salame\" and \"Nasser\" in the west of Gaza City has risen to 30."}, {"id": "0d6ed139-a7fe-4560-82e1-4a826f73b1e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31788/", "date": "2024-08-04 14:52", "message": "IDF: The IDF and ISA struck terrorists operating inside Hamas command and control centers that were embedded within the Hassan Salame and Nasser schools in Gaza City\n\nA short while ago, in an intelligence-based strike, the IDF and ISA struck terrorists who were operating inside Hamas command and control centers embedded within the Hassan Salame and Nasser schools in Gaza City.\n\nThe schools were used by Hamas’ Al-Furqan Battalion as a hiding place for its terrorist operatives and as command centers used to plan and execute attacks against IDF troops and the State of Israel. Prior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of precise munitions, surveillance, and additional intelligence.\n\nThe Hamas terrorist organization systematically violates international law and operates from within civilian infrastructure, exploiting the civilian population as a human shield for their terror activities against the State of Israel."}, {"id": "e7d9a31d-c0e7-46c4-bbd1-a482a4788ead", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31787/", "date": "2024-08-04 14:50", "message": "Palestinian channels report that the number of dead rose to 25 in the attack on the school named after Hassan Salame (Hamas terrorist sentenced to 67 life sentences) in the west of Gaza City."}, {"id": "f39e4bcf-f094-49b5-b5ee-7b260e09a4f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31784/", "date": "2024-08-04 13:41", "message": "Mount Etna in Sicily, today."}, {"id": "22f17482-1d55-4359-897c-29f4ff77f3d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31783/", "date": "2024-08-04 13:11", "message": "The spokesman for the Civil Defense in Gaza reports five deaths in the attack on the school named after \"Hassan Salame\" in the Nasser neighborhood in the west of Gaza City."}, {"id": "64bd9742-cbb1-4d3e-a7b3-a866a5bb1e24", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31782/", "date": "2024-08-04 12:49", "message": "Lebanese channels report that an Israeli UAV attacked a motorcycle in the village of Beit Leif in southern Lebanon a short time ago."}, {"id": "c8970154-0e36-4ffd-9b32-ed1f30b9ff71", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31781/", "date": "2024-08-04 12:49", "message": "The military wing of Hamas accepts responsibility for launching the rockets towards Lakhish today at noon."}, {"id": "df4400ad-b22a-4a2a-bd70-d9abef720e73", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31780/", "date": "2024-08-04 12:49", "message": "Gazans in the center of the Gaza Strip rob the aid and food convoys intended for their brothers in the north of the Gaza Strip.\n\nThen they complain that there is hunger in the north of the Gaza Strip."}, {"id": "4f76a27c-726e-4244-8b78-3e540e87dd21", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31779/", "date": "2024-08-04 11:38", "message": "Following the report here 👆\n\nIDF Spokesperson: A terrorist that participated in the October 7th Massacre was eliminated; The IDF continues to operate in the Gaza Strip\n\nEarlier this week, based on IDF and ISA intelligence and using precise munition, an IAF aircraft struck and eliminated the Hamas terrorist Ismail Nofal in the area of Nuseirat, who was responsible for rocket launches toward Israeli territory and participated in the October 7th Massacre."}, {"id": "c1bdf193-2680-40c3-847b-b479a716f177", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31777/", "date": "2024-08-04 11:36", "message": "IDF Spokesperson: \n\nOn the Philadelphi Corridor: IDF Troops Located Dozens of Underground Tunnel Routes in the Area; A Three Meter High Tunnel Was Located\n\nRecently, IDF troops have been working to locate and destroy underground tunnel routes in the Philadelphi area, and so far, the troops have located and destroyed dozens of routes.\n\nAt the beginning of last week, in one of the operations to locate underground tunnel routes in the Philadelphi area, a three meter high tunnel was uncovered on the Philadelphi Corridor.\n\nAt this stage, the troops are continuing with the investigation and neutralization of the underground tunnel route, as well as other large-scale routes that were found.\n\nThe IDF will thoroughly destroy all the underground infrastructure on the Philadelphi Corridor and will act with determination to prevent their formation in the future."}, {"id": "e367a5a4-13db-43f3-8683-c80e229b5768", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31776/", "date": "2024-08-04 11:05", "message": "Afghanistan: The Taliban regime erected a mourning pavilion in honor of Ismail Haniyeh in the capital Kabul."}, {"id": "a906b202-e607-43fc-931b-8148577d3fa4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31775/", "date": "2024-08-04 11:04", "message": "Agence France-Presse: The French Ministry of Foreign Affairs calls on French citizens staying in Iran to leave the territory of the country temporarily."}, {"id": "8eb5074c-edab-4efb-9724-a0a35ed06864", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31773/", "date": "2024-08-04 11:04", "message": "The village of Taybeh, South Lebanon: The station that was attacked by an Israeli drone is responsible for supplying electricity to the drinking water pumping facilities in South Lebanon."}, {"id": "21ccc886-a726-40e0-b3e1-6fcacdbd7469", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31772/", "date": "2024-08-04 11:03", "message": "Palestinian sources report that the terrorist Amar Odeh, who carried out this morning's attack in Holon, was arrested by the Palestinian Authority's security forces on July 15 due to a post he published on Facebook and was released from custody last Tuesday."}, {"id": "57730d56-3a1b-4278-9282-36f4102c182b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31771/", "date": "2024-08-04 11:03", "message": "The Iranians continue to pump themselves up regarding the reaction to the assassination of Haniyeh\n\nToday a special meeting was held in the Iranian parliament to discuss the assassination of Haniyeh.\nMohammad Ghalibaf, the Speaker of the Iranian Parliament, stated that the Iranian forces will teach the Zionist enemy and its American supporters a historical lesson.\n\nGhalibaf added that the Iranian parliament, as the representative of the Iranian people, demands a deterrent response that will protect Iranian national interests as revenge for the assassination of the \"guest\" Haniyeh.\n\n##\nMuhammad \"Deif\" is also considered a \"guest\"... two guests in one month (:"}, {"id": "1bfa9332-5b7f-43f2-acc7-4622816a5e76", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31770/", "date": "2024-08-04 09:42", "message": "IDF: Following the sirens that sounded in the Shfela area a short while ago, approximately five launches were identified crossing from the southern Gaza Strip. A fall was identified in the area of the Hof Ashkelon Regional Council. No injuries were reported."}, {"id": "0563297b-02ae-472a-aa8d-d278593dd27b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31769/", "date": "2024-08-04 09:41", "message": "Lebanese channels: The IDF recently attacked the electricity station in the village of Taybeh in southern Lebanon."}, {"id": "66d674e1-80a6-4756-8813-a0245a1bf4be", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72477/", "date": "2024-08-04 09:41", "message": "Hamas and Islamic Jihad in an official announcement about the attack in which two elderly people were stabbed to death this morning:\n\n\"Heroic Act\""}, {"id": "0d56dff4-4112-4859-a0ed-2df68db2daa6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31767/", "date": "2024-08-04 09:40", "message": "5 rockets were launched from the Gaza Strip towards Hevel Lakhish."}, {"id": "fcd0c00b-5b23-4be4-b281-616e64dfe77d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72474/", "date": "2024-08-04 09:34", "message": "Sources associated with the Houthis in Yemen report that Hossein al-Shaabal (Abu Jihad Mastur), an officer with the equivalent of a lieutenant general, was killed \"outside Yemen's borders\", as part of the \"fifth phase\" of their operations announced by the Houthis recently.\n\nThe Houthis do not say where Abu Jihad was killed, but there are indications that he was killed in the American attack in the Babol province of Iraq last week along with the operatives of the Shiite militias loyal to Iran.\n\n##\nAs part of the activity announced by the Houthis, they publicly declared cooperation with the militias in Iraq, so it makes perfect sense that Iraq was eliminated.\n\n##\nThe Iranian \"Tasnim\" agency confirms a short time ago that the Houthi officer 👆 was killed in the American attack in Iraq last week."}, {"id": "4c6489ef-2221-49aa-b4b0-4ade0f06f285", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31763/", "date": "2024-08-04 09:00", "message": "This is the terrorist Amar Odeh of Salfit who stabbed a couple of 70-year-old adults to death at point blank range. Palestinians praise him and call him a \"hero\".\n\nThe governor of Salfit, who feels the potential damage this could cause in Salfit (closure and actions by the IDF) has already hastened to announce on the Al Jazeera network that Amar Odeh had mental problems and is defined as \"mentally ill\"."}, {"id": "5dcd2ddc-cf03-40c3-85df-f3ef87770d37", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31762/", "date": "2024-08-04 08:56", "message": "Against the backdrop of Iranian preparations for revenge against Israel for the assassination of Haniyeh, the Jordanian Foreign Minister arrived in Tehran a short time ago to meet face to face with his Iranian counterpart.\n\n##\nThe Jordanian foreign minister stated a few days ago that Jordan will not allow its territory to be turned into a war zone..."}, {"id": "eac15444-cf0d-49c1-a4dc-b53d8ad637f6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31761/", "date": "2024-08-04 08:55", "message": "South Lebanon: The member of the Hezbollah rescue team who collected the pieces of his brother's body👆, the senior Hezbollah operative Ali Abd el Ali, who was killed yesterday in an Israeli attack, sings the crowd that came to participate in the funeral: \"... you are Hezbollah (the people of God/Allah's party) ... Resistance!\""}, {"id": "22a45058-9862-44ea-8975-0b706467c8f4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31760/", "date": "2024-08-04 07:14", "message": "Today the Lebanese mark 4 years since the explosion that destroyed the port of Beirut.\n\nThe culprits have not yet been found.\n\nThe explosion killed 220 people and injured about 7000 others."}, {"id": "f19a4fbc-cf13-48e9-bc55-6fc0273cc9f6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31759/", "date": "2024-08-04 06:52", "message": "Two of the injured in the attack in Holon this morning were pronounced dead."}, {"id": "6e739db3-d762-4066-9b82-cd4c16c6c3b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31758/", "date": "2024-08-04 06:10", "message": "Iran: They are looking into whether Israel's collaborators eliminated Haniyeh\n\nAmir Hossein Rahimi, the assistant to the head of the judiciary in Iran announced that the Attorney General has ordered the arrest of anyone who \"behaved negligently\" in the issue of the assassination of Ismail Haniyeh.\n\nRahimi also added:\n\"We have no doubt that the Zionist entity is the one who committed the crime, but we are examining whether it committed the crime directly or through accomplices on its behalf.\""}, {"id": "42577e5b-0566-4703-9356-b52540489470", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31758/", "date": "2024-08-04 06:10", "message": "USA: One of Hamas' \"successes\" was a small demonstration in Brooklyn by an organization for blacks and Palestinians in which Hamas flags were raised and a comparison was made between the assassination of Haniyeh and the death of Sonya Massey, an African-American woman who was shot in her home by an American police officer about a month ago. Representatives of Neturi Karta also arrived for a demonstration."}, {"id": "ea44704b-9588-4934-9ab2-c32c915a9357", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31755/", "date": "2024-08-04 06:08", "message": "\"Where are the Arab leaders?\"\n\n\"The events of Ismail Haniyeh\" - the funeral, the Day of Rage and the World Day for Gaza are marked as a failure....\nCriticism is being directed on social media towards the leaders of Arab countries who did not attend Haniyeh's funeral in Qatar (except for the ruler of Qatar - seen in the attached photo).\nCriticism of Abu Mazen who was present at Shimon Peres' funeral in Jerusalem but did not come to Haniyeh's funeral.\nThe Day of Rage and the Day for Gaza announced by Hamas failed to bring the number of demonstrators to the streets that Hamas had expected - this is another top leader in their view who was killed in the war...\nThere was a disappointment..."}, {"id": "3f042f04-4590-463e-aabc-1eeed7ef77f4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31752/", "date": "2024-08-04 06:06", "message": "The Palestinians report 16 deaths in three attacks by the IDF tonight in the Gaza Strip\n\nThe Palestinians report 5 dead and 15 wounded in a third attack of its kind in the area of ​​the displaced persons' tents inside the Shuhada Al-Aqsa hospital complex in Deir al-Balah in the center of the Gaza Strip. The tents caught fire (documentation attached).\n\nAs the Palestinians report on 3 deaths in the attack on the house of the Abdullah Hasnat family in the area of ​​the camp west of Deir al-Balah (Abdullah's wife and son were killed).\n\nPalestinian channels also report that in the north of the Gaza Strip, 8 were killed tonight as a result of the attack on the house of the Amudi family in the Fakhoura area of ​​Jabaliya."}, {"id": "b3a58b54-d661-449a-8af8-3129209238ea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31751/", "date": "2024-08-04 06:05", "message": "After Hamas officially accepted yesterday 👆 responsibility for the attack in which Amnon Mukhtar was murdered on June 22 in Qalqilya, by its operatives: Jamal Abu Haniyeh and Ali Khalil (Abu Bakr), the Islamic Jihad releases a video in which the two terrorists attributed to the attack are seen wearing Islamic Jihad headbands and officially announce that they are Islamic Jihad men.\n\nIn doing so, the Islamic Jihad humiliated Hamas and showed that the publications of its military arm yesterday were false."}, {"id": "bb109e80-9324-40e3-aeea-2eee9233a7fe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31750/", "date": "2024-08-04 06:01", "message": "IDF spokesperson:\n\nA soldier from the 9th Battalion, 'Akvot Barzel' formation (401), was seriously injured yesterday (Saturday), in a battle in the southern Gaza Strip.\n\nThe soldier was referred for medical treatment and his family was informed.\n\n##\nThe military wing of Hamas accepted responsibility for the incident."}, {"id": "4ff20374-9736-46f1-ad4c-9036dd097d19", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31749/", "date": "2024-08-04 06:00", "message": "MDA: 4 injured in a stabbing attack in Holon, two of them in critical condition and one in serious condition."}]