[{"id": "1c2e93c7-26b0-4af9-9930-76f0178de0a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32762/", "date": "2024-08-20 19:16", "message": "\"Mousa Abu Marzouk, you’re not My Brother!\"\n\nAn Egyptian citizen responds to the complaints made by Hamas leader Mousa Abu Marzouk about Egypt not going to war against Israel to relieve Gazans.\n\nHe addresses not only Abu Marzouk but also all Palestinians who criticize Arab countries for not intervening to help Gaza, by presenting the concept of loyalty circles in Arab and Islamic society:\n\n\"My brother and I against my cousin,\nand my cousin and I against a stranger...\""}, {"id": "5619e072-bb0e-4b18-8deb-ccf904703fa9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32761/", "date": "2024-08-20 19:07", "message": "And this is what the kids in Gaza think about Abu Mazen...\n\nI don't think he's going to receive a warm welcome there..."}, {"id": "8106cc99-9982-411e-ae75-97642c3c939f", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73678/", "date": "2024-08-20 18:53", "message": "The PLO Executive Committee has established a committee of Palestinian factions aimed at ensuring the success of President Mahmoud Abbas's visit to the Gaza Strip, which he declared during his speech at the Turkish parliament."}, {"id": "efbc3be7-20d1-4530-ac93-6142b6bb9aa4", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73678/", "date": "2024-08-20 18:50", "message": "USA: Anti-Israel activists disrupt women’s conference with Kamala Harris's VP pick Tim Walz\n\nThe event was part of the 2024 Democratic National Convention, currently taking place in Chicago, Illinois. The activists are calling for an end to the killing of women in Gaza."}, {"id": "03d51478-1405-4a14-83a2-a47d3ea599b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73678/", "date": "2024-08-20 18:47", "message": "Adventures of Iranian Pilgrims in Iraq...\n\nYou may already know that in Karbala, Iraq, the fortieth day following Ashura (marking the death of Hussein ibn Ali, the grandson of the Prophet Muhammad and a significant figure in Shia Islam) is celebrated with a massive religious festival.\n\nHowever, you might not be aware of the \"tourist\" aspect of the pilgrimage.\n\nIraqi security forces conducting checks on Iranian pilgrims arriving in Karbala were surprised to find a large quantity of condoms in one pilgrim's bag.\n\nThey questioned why such a large number of condoms would be needed in a place so sacred to Shia Muslims, where major religious ceremonies are held. The Iraqi officer in charge instructed: seize the items!\n\nThe video has garnered millions of views on social media.\n\n#الزينبيات"}, {"id": "9132235b-6dd1-460d-b9e6-270d15291c71", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32756/", "date": "2024-08-20 18:40", "message": "Palestinian channels report that Gazans from the Hamad neighborhood area in Khan Younis have begun evacuating even without receiving an evacuation warning from the IDF spokesperson. \n\nThis is due to the intensity of the attacks in the area."}, {"id": "333911ee-43b4-4911-afc7-bb0fd5ed9059", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73678/", "date": "2024-08-20 18:39", "message": "Iran: On the sidelines of the parliamentary session, between votes, Iran’s newly elected President Masoud Pezeshkian and Parliament Speaker Mohammad Baqer Qalibaf, who ran against and lost to Pezeshkian, were seen together with food trays in the Majlis (parliament) cafeteria."}, {"id": "0f752986-ee47-42ce-9edc-86b873ddf5b4", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73678/", "date": "2024-08-20 18:38", "message": "Hamas official statement on IDF attack on \"Mustafa Haftar\" school in Gaza City:\n\nPresident Biden and the US administration bear full responsibility for the continuation of these massacres against our people, which would not persist without American military and political support for the extremist Zionist government."}, {"id": "a509c6ef-7f92-48f1-b38d-8796ad58ecb3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32751/", "date": "2024-08-20 18:37", "message": "Hezbollah and IDF exchange fire following fatal Israeli airstrike in South Lebanon\n\nThe Lebanese Ministry of Health confirms that there are two fatalities resulting from the IDF attack on a-Dahyra in South Lebanon, earlier today.\n\nThe IDF has officially confirmed the elimination of Hezbollah operatives in a-Dahyra. Hezbollah responded with rocket fire towards the \"Shomera\" military base in northern Israel.\n\nAccording to an additional report, a motorcyclist narrowly escaped a different Israeli attack in the al-Habiyah area."}, {"id": "2ba06ce3-8c4d-4433-97ee-fa24661f981d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32761/", "date": "2024-08-20 18:32", "message": "The Saudi energy giant Aramco has released a rendering of the stadium it plans to build in the port city of al-Khobar in eastern Saudi Arabia to host the 2034 World Cup.\n\nConstruction will begin in 2026, and the stadium will have a seating capacity of 47,000."}, {"id": "b1267830-908e-453f-aaf7-f2141c682510", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73678/", "date": "2024-08-20 18:30", "message": "After Putin’s visit to Baku👆, Azerbaijan has officially applied to join the BRICS organization. \n\nBRICS is an intergovernmental organization comprising Brazil, Russia, India, China, South Africa, Iran, Egypt, Ethiopia, and the United Arab Emirates - considered the foremost geopolitical rival to the G7 bloc of leading advanced economies."}, {"id": "59605ae8-ee42-4a77-9521-58396cd959a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32748/", "date": "2024-08-20 18:28", "message": "Palestinian channels report on Israeli attacks in the Hamad area of Khan Younis.\n\nThis neighborhood has been under heavy fire in the last 48 hours."}, {"id": "dbb6788b-a937-4ce6-bc22-7b68d41cf772", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32747/", "date": "2024-08-20 18:27", "message": "Today, \"the Resistance in Gaza\" (Hamas and other militant factions) published a letter addressed to \"the Islamic Resistance in Lebanon\" (Hezbollah). Here is a line from it:\n\nحان أيها الأبطال المجاهدون التقدم نحو فتح باب خيبر من جديد والعمل لزوال \"إسرائيل\" من الوجود\n\n\"It's time to advance towards the reopening of the gate of Khaybar and to work towards the removal of 'Israel' from existence.\"\n\n(Khaybar was inhabited by Arabian Jewish tribes until it fell to Muslim conquerors under Muhammad during the famous Battle of Khaybar in 628 CE - AA)\n\n###\n\nFriends, this is a distress call from the Palestinian resistance factions in Gaza. They are pleading for Hezbollah’s assistance, expressing their request in terms wrapped in religious Islamic elements.\n\nIt is important to note that Nasrallah, in his most recent speech, explicitly stated that the current campaign of Hezbollah aims to prevent a victory for Israel, and that the campaign has not yet reached the goal of erasing Israel from the map... These are his words.\n\nThe factions are asking Hezbollah to change the declared objective of the war. It is difficult for them..."}, {"id": "816189c7-acfd-4000-8df8-67cfeff0bc61", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32746/", "date": "2024-08-20 16:31", "message": "The Palestinians report ten deaths in a vehicle attack in the Baraqa square in the center of Deir al-Balah (in the center of the Gaza Strip)."}, {"id": "be60b1fa-ea39-46ff-91e7-b74ad1892e35", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32745/", "date": "2024-08-20 16:29", "message": "Identified Fatah sources: Masked Hamas gunmen today broke into the Bank of Palestine branch in Nuseirat in the center of the Gaza Strip, kidnapped the bank's manager and took him to an unknown location."}, {"id": "68294c03-1499-4295-a240-b13d67ad330c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32744/", "date": "2024-08-20 14:13", "message": "The spokesman of the Iranian Revolutionary Guards on the issue of the Iranian response to the assassination of Ismail Haniyeh in Tehran:\nThere will be a response. The waiting time for a response will be long...this is for our benefit.\n\n##\nGazans answer him: But a long time is not for the benefit of Gaza...\nThe Palestinians are very disappointed... and all the opponents of the Iranian axis on social media are mocking the Iranian delay in responding."}, {"id": "983d9b5f-1439-4334-ae4c-3b4d007bc54b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32739/", "date": "2024-08-20 13:21", "message": "The supermoon as photographed last night in Tehran."}, {"id": "4e779e25-1c54-457e-b005-1957e28dde75", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32738/", "date": "2024-08-20 13:21", "message": "Civil Defense in Gaza: We managed to rescue 12 dead from the Matzafa Haft school in the west of Gaza City.\nThere are more under the ruins but we do not have the necessary equipment to rescue them."}, {"id": "564e094c-6adc-4c72-bb67-c18e72a130f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32737/", "date": "2024-08-20 11:35", "message": "Further to what President Biden said, according to the Times of Israel, regarding Hamas' withdrawl from a ceasefire deal, Hamas published an official announcement a short time ago that read:\n\nWe are shocked and strongly condemn President Biden's statements according to which Hamas withdrew from the agreement.\nThe statements are misleading, biased in Israel's favor and are in fact a green light for the extreme Israeli government to continue its crimes against the Palestinians.\n\nWe emphasize that we are committed to the offer presented by the brokers on July 2nd."}, {"id": "3f4ec5b2-2aeb-4dd9-894c-42303ff5ff91", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32736/", "date": "2024-08-20 11:33", "message": "Elon Musk, behind you...\nThe \"Iranian Starlink\" version - an Iranian zeppelin that provides internet to the pilgrims in Karbala, Iraq to mark the fortieth day (of the death of Husayn ibn Ali, grandson of the Prophet Muhammad)."}, {"id": "f59abc1e-579f-4d1e-915c-47e606a7733b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32735/", "date": "2024-08-20 11:32", "message": "Lebanon: The Lebanese Minister of Energy announced that on the 24th of the month a fuel tank will arrive in Beirut that will ensure the production of electricity that will provide 6 hours of electricity a day in the national grid in Lebanon."}, {"id": "a0741482-efd7-49e7-81d5-5d60f67fa8fc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32734/", "date": "2024-08-20 10:33", "message": "The rescue attempts from the building that was attacked in the Mustafa Khaft school complex:\nIt won't be easy."}, {"id": "d7f9ed1b-66b5-492e-9f63-5b0d6738ab06", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32733/", "date": "2024-08-20 10:33", "message": "Documentation from one of the buildings at the Mustafa Khaft school that collapsed following the IDF attack.\nAccording to the Civil Defense of Gaza, 700 displaced people live in the school.\n\n##\nIf there are 700 people in a place and only ten were killed in an attack that collapsed a building, it is definitely surgical work."}, {"id": "d8c084dc-db08-493a-8d3d-e777d4aef28d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32732/", "date": "2024-08-20 10:31", "message": "The Lebanese al-Mayadeen channel updates the number of people killed in the attack on the Mustafa Khaft school in the west of Gaza City - according to the updated publication, the al-Mayadeen channel (as well as the civil defense in Gaza) claims that 10 Palestinians were killed in the attack, not 20."}, {"id": "02acd7bf-460d-4dcd-9614-d8baf3ce547b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32731/", "date": "2024-08-20 10:29", "message": "The Lebanese Al Mayadeen channel: more than 20 dead under the ruins of the Mustafa Khaft school in the west of Gaza City that was attacked by Israel 👆"}, {"id": "7b5acfad-4b03-4517-bf09-a948c18b0476", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32730/", "date": "2024-08-20 10:28", "message": "At 11:40, the IDF published: A short while ago, with the direction of the IDF and ISA intelligence, the IAF conducted a precise strike on terrorists who were operating within a Hamas command and control center. The command and control center was embedded and hidden by the Hamas terrorist organization inside the “Mustafa Khaft” School compound in Gaza City. Hamas terrorists used the command and control center to plan and execute attacks against IDF troops and the State of Israel. \n\nPrior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of precise munitions, aerial surveillance and additional intelligence.\n\nThe Hamas terrorist organization systematically violates international law and operates from within civilian infrastructure and shelters in the Gaza Strip, brutally exploiting the Gazan civilian population for its terrorist activities.\n\nThe IDF will continue to operate against the Hamas terrorist organization in defense of the citizens of Israel."}, {"id": "4ff6f58c-947a-4f5e-9578-72fb27454bab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32729/", "date": "2024-08-20 10:27", "message": "At 11:30 Palestinian channels reported an Israeli attack on the Mustafa Khaft school in the west of Gaza City.\n\nThere are dead and wounded on the spot according to Gaza sources."}, {"id": "f4772d73-669b-4533-a4b3-37cfa3adc7f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73634/", "date": "2024-08-20 08:35", "message": "The Lebanese Ministry of Health: 11 injured in the IDF attack last night in the Beqaa area."}, {"id": "02a02a4f-ac0c-4196-99d3-2654ab5eb954", "channel_id": 1560386984, "url": "", "date": "2024-08-20 07:36", "message": "°Action against a hostile Twitter account associated with Hezbollah\n\nHere is a tweet from the Twitter account of Ali Shoaib, Hezbollah's correspondent for the Lebanese Almanar channel, in which he praises the suicide bomber who blew himself up on Sunday in Tel Aviv.\n\nPlease report him under the terrorism classification:👇\n\nhttps://x.com/alishoieb1/status/1825467866763743574?s=19"}, {"id": "d8153755-7ffe-4543-aec2-1d1852c814db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32726/", "date": "2024-08-20 07:35", "message": "A video released tonight by Hezbollah in which a suicide drone is seen approaching a post of antennas and security systems at one of the IDF posts on the border with an explosive."}, {"id": "f36b8ab8-7b30-4e2a-a2c9-4773a2ef718f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32722/", "date": "2024-08-20 07:31", "message": "Gazan prisoners that Israel released this morning to the Gaza Strip."}, {"id": "957ab156-fc6a-48c7-83d2-1ac1222d6c59", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32721/", "date": "2024-08-20 07:30", "message": "The Palestinians report that this morning Israel released about 40 Gazan prisoners to the Gaza Strip, through the Kerem Shalom crossing.\nThey arrived at the European Hospital in Khan Yunis."}, {"id": "4c67f3cf-79fe-4e13-a977-9bcf1c11bb0a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32720/", "date": "2024-08-20 07:29", "message": "The six were kidnapped alive and murdered in Hamas captivity.\nAs part of the deal, their bodies were to return only in the third phase, after a permanent ceasefire, after the start of the reconstruction of the Strip - probably in many months at the very least."}, {"id": "610eb225-9832-42cf-955b-591086222962", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32719/", "date": "2024-08-20 07:29", "message": "Joint IDF and ISA announcement: \n\nThe IDF and ISA rescued the bodies of the hostages Yagev Buchshtab, Alexander Dancyg, Avraham Munder, Yoram Metzger, Nadav Popplewell, and Haim Perry from the Khan Yunis area in the Gaza Strip\n\nOvernight (Monday), in a joint IDF and ISA operation, the bodies of the hostages Yagev Buchshtab, Alexander Dancyg, Avraham Munder, Yoram Metzger, Nadav Popplewell, and Haim Perry were rescued from the Khan Yunis area in the Gaza Strip. \n\nThe rescue operation was conducted under the command of the 98th Division and carried out by the Paratroopers Brigade, 'Yahalom' Unit, and the 75th Battalion, along with ISA forces.\n\nThe operation was enabled by precise intelligence from the ISA, IDF intelligence units, and the IDF Intelligence Directorate Hostage Headquarters."}, {"id": "fc8b0c92-1d37-4a81-9b7f-86a1285547fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32717/", "date": "2024-08-20 07:28", "message": "Chicago: Anti-Israeli protesters breach the security fence near the convention of the Democratic Party in the USA calling for an end to the war in Gaza. They are trying to put pressure on the Democrats to stop supplying Israel with weapons."}, {"id": "c95e6c1e-1b17-4372-82cf-94c93b83ac86", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32716/", "date": "2024-08-20 07:26", "message": "IDF Spokesperson reported this morning: Following the sirens that sounded a short while ago in the areas of the Upper Galilee and the Golan Heights, approximately 55 projectiles were identified crossing from Lebanese territory. Some of the projectiles were intercepted, and the rest fell in open areas. No injuries were reported. \n\nIsrael Fire and Rescue Services are currently operating to extinguish fires that broke out in several areas in northern Israel due to falling projectiles.\n\nShortly after the launches, the IAF struck one of the launchers from which the projectiles were fired."}, {"id": "5360399f-dca3-4cff-8f15-101d594f30b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32715/", "date": "2024-08-20 07:18", "message": "Rocket barrages from Lebanon:\nHezbollah publishes an announcement in which it accepts responsibility for launching rockets this morning at the \"Jordan Facility\" and \"Nafah Facility\" in the Golan - in response to last night's attack in the Beqaa area."}, {"id": "05945a8b-832f-4e6b-8dae-36ae5cf619b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32714/", "date": "2024-08-20 07:18", "message": "\"Turkish love\" - ​​a Saudi tourist is beaten by Turks in Istanbul after they accused him of taking pictures of women on his cell phone."}, {"id": "224c1900-1b2f-40dc-b786-d2b840f4d15b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32710/", "date": "2024-08-20 07:16", "message": "More from Syria: The supermoon - as seen last night from Syria.\nThis is a phenomenon that occurs once every three years, making the moon appear larger by about 14% and brighter by about 30%.\n\nSome claim that there is a connection between this phenomenon and earthquakes."}, {"id": "c8682e17-f823-4512-b3f0-d90eca812b17", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32709/", "date": "2024-08-20 07:15", "message": "Under the direction of Syrian President Assad, from now on all Palestinians are exempt from the need for visas and fees when entering Syria.\n\nSyria encourages Palestinian immigration to it.\nNice on Bashar's part (:"}, {"id": "5004e953-4d8b-412a-9a53-91e6e84f83cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32708/", "date": "2024-08-20 07:15", "message": "Shazar also came to express his sympathy at Majdal Shams, the soccer field where 12 local residents, most of them children, were killed as a result of a Hezbollah rocket."}, {"id": "6d414854-0042-4213-b8fc-cd7c1d660a25", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32707/", "date": "2024-08-20 07:14", "message": "And more about mocking Iranian reactions to Israeli attacks, the Syrian exile Shazar came to visit the Temple Mount carrying the flag of the Syrian opposition opposing the rule of Bashar Assad.\n\nA video in which he mocks the Iranian ambassador and Hassan Nasrallah, which was filmed while he was on the Temple Mount, received a lot of attention on social networks (over a million views on Twitter).\n\nThe tweeters of the Shia axis are going out of their way..."}, {"id": "6bb1414c-9ee0-4b52-80e5-593a459964f2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32706/", "date": "2024-08-20 05:29", "message": "The deputy commander of the Iranian Revolutionary Guards is trying to explain the \"delay in responding to the assassination of Haniyeh\":\n\n\"The response to the assassination of Haniyeh is a settled matter. It will occur at the right time and place.\"\n\nAmong Arab social media users, his comments are met with much ridicule: The banner of revenge is showing wear and tear; 20 days have passed, surpassing the timeframe they set when they prepared the banner."}, {"id": "896e479e-5b11-48ce-90f5-ce06919d4711", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32705/", "date": "2024-08-20 05:25", "message": "According to Lebanese channels, this footage shows the Israeli attacks that took place last night in the Tyre area.\n\nThe hysteria there is evident."}, {"id": "b25d780f-36fa-4dd6-8491-3296e89f57e2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32704/", "date": "2024-08-20 05:22", "message": "Hezbollah announced a death in its ranks last night:\n\nHussein Ali Suleiman\n\nHe was killed in the IDF attack last night in Deir Qanoun in southern Lebanon. According to the IDF spokesman as mentioned above, he was a key terrorist in the organization's Rocket and Nissile Unit in the Yarine area.\n\nNumber 417"}]