[{"id": "7aaff962-da71-4e4d-9c02-ddd89d889298", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29082/", "date": "2024-06-18 14:49", "message": "Lebanese channels report another Israeli attack a short time ago in the al-Bar'aliya area north of Tyre.\n\nIn the attack on the vehicle earlier today, 8 civilians were injured, according to Lebanese media (as a result of a shot from a distance by an Israeli UAV after shooting at the target vehicle).\nNo deaths were reported yet."}, {"id": "60185a34-496a-466c-9ae6-c48c4579e494", "channel_id": 1560386984, "url": "", "date": "2024-06-18 14:26", "message": "°episode 1. The rest will come."}, {"id": "e10f3635-aeaf-4ac2-81f4-8ad2401bfc34", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29080/", "date": "2024-06-18 14:24", "message": "According to Hezbollah, the \"hoopoe\" is not Amos Hochstein, but a UAV that carried out extensive and particularly high-quality documentation in the territory of Israel.\n\nAttached is Hezbollah's \"hoopoe\" video.\nConcerning."}, {"id": "d8f1c42d-a914-4031-9765-b91d36cd58e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29079/", "date": "2024-06-18 14:21", "message": "Hezbollah publishes a \"riddle\":\n⭕️ترقبوا... ما رجع به الهدهد\n\nWait and watch... for what the hoopoe bird brings with her on her return....\n\n##\nI don't know what is behind the matter, but in the Islamic version of the story of King Solomon, the Queen of Sheba, and the hoopoe, it is said that the hoopoe was used to convey a message from King Solomon to the Queen of Sheba in which the queen was required to submit to King Solomon. The Queen showed the message to her advisors who replied: We are strong and know how to fight, but the decision is in your hands....\n\nSome claim that Amos Hochstein is playing the role of the hoopoe this time..."}, {"id": "32da39c5-171b-47b6-bdf1-93ff8b8eae92", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29078/", "date": "2024-06-18 14:14", "message": "Lebanese channels report 3 wounded in the attack on the vehicle north of Tyre 👆. One of them is the driver of the car that was attacked."}, {"id": "c6e1ef2a-a62d-47b1-92d8-04db0a47ef84", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29077/", "date": "2024-06-18 14:14", "message": "IDF: Following the sirens that sounded regarding a hostile aircraft infiltration in northern Israel, the IDF Aerial Defense Array successfully intercepted three suspicious aerial targets that crossed from Lebanon. No injuries were reported.\n\nSirens regarding rocket and missile launches were activated in the area due to the danger of falling shrapnel from the interceptor."}, {"id": "692554f0-063a-42ff-8ca0-ab79fa7f9936", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29075/", "date": "2024-06-18 14:13", "message": "Lebanese channels: An Israeli drone attacked a vehicle in the area of ​​Al-Bar'alia, north of Tyre, on the coastline, this afternoon"}, {"id": "5e3c2f3b-7403-4602-84ba-1b6f852da9cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29074/", "date": "2024-06-18 14:12", "message": "IDF spokesperson: Three terrorists were killed from the air in the Rafah sector."}, {"id": "ebb4d141-359c-4a76-ae12-cc69e75d4f37", "channel_id": 1560386984, "url": "", "date": "2024-06-18 14:10", "message": "The elections in Iran: Former Iranian Foreign Minister Javad Zarif announced his support for the only reformist candidate in the presidential elections\n\nMasoud Pezeshkian, pictured, is the only reformist candidate among the 6 candidates for the Iranian presidential elections at the end of the month, today won the official support of one of the prominent faces of Iranian diplomacy - Mohammad Javad Zarif, who is behind the strategy of winking at the West (diplomacy of smiles).\n\nPezeshkian was placed as a candidate to please the reformist stream in Iran so that they would not boycott the elections (the rest of the candidates are considered to be from the conservative stream) - after all, the real competition in the elections in Iran is on voter turnout to establish the legitimacy of the president desired by Iran's supreme leader.\nIn the last presidential election campaigns, low turnout rates were generally recorded - something that casts a shadow over the legitimacy of the elected president to some extent."}, {"id": "a9506fac-23e6-4c0d-b8d9-ba61a4286863", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29072/", "date": "2024-06-18 14:08", "message": "For the first time since the beginning of the holiday of sacrifice, Hezbollah accepts responsibility for an attack in Israel:\nWe attacked a Merkava tank using a suicide drone at 12:12 inside an Israeli military post."}, {"id": "5f8e26e0-9b91-4bf1-837f-ccf448cbb37b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29071/", "date": "2024-06-18 14:07", "message": "Lebanon: The American envoy Amos Hochstein also met with the Prime Minister of Lebanon, Mikati.\nHe is completing the full round of senior officials - political and military..."}, {"id": "0c8df00a-a682-4021-a6da-00e8229e1060", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29070/", "date": "2024-06-18 14:06", "message": "The hole that was made in the Ukrainian ship Verbena after it was hit by a Houthi missile a few days ago.\nAccording to Arab sources, it is also slowly starting to sink.\n\nThe US Central Command stated a few days ago that an Iranian ship that passed 8 nautical miles from the place where the Ukrainian ship was hit ignored its distress calls - contrary to seafaring standards."}, {"id": "3dac6fc9-3d6e-4a1b-a1c3-26a08a1f70bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29069/", "date": "2024-06-18 09:44", "message": "Gaza sources: Hamas operatives murdered an activist of the Association for the Protection of Women's and Children's Rights after he took several photos in the area of ​​Bani Suheila in eastern Khan Yunis.\n\nAccording to these sources, Abd el Aziz Baraka, a member of the Aisha Association for the Protection of Women and Children (an NGO apparently with foreign funding) and an English teacher by profession, was kidnapped by Hamas operatives to one of the schools in Khan Yunis, where he was beaten to death.\n\nBaraka came with his family members to visit relatives of Bani Suheila for the holiday and apparently the photos he took in the area were the cause of his kidnapping and murder by Hamas operatives.\nHis relatives are calling him \"martyr\", a title reserved for those who are killed in military action (for the sake of comparison, Israeli Arabs do not call those who are killed in acts of crime in Arab society in Israel \"martyr\")."}, {"id": "8a18c9a8-64ee-4a3c-a7c9-b1209fc5a269", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29068/", "date": "2024-06-18 09:40", "message": "Lebanon: Amos Hochstein, the American special envoy on his way to a meeting with Nabih Berri, the chairman of the Lebanese parliament who is also... the chairman of the Amal Shiite movement fighting against Israel alongside Hezbollah.\nHochstein also met with the commander of the Lebanese army."}, {"id": "12536a19-68b1-4bd1-8d71-de076da97ab1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29067/", "date": "2024-06-18 09:37", "message": "The French court overturned the discriminatory decision banning Israelis and Israeli companies from participating in the arms exhibition in France."}, {"id": "20fd9d02-7a3e-431b-b1eb-222ef1ce3b37", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29066/", "date": "2024-06-18 09:36", "message": "Washington Post: Key members of the Senate in the Democratic Party approved a huge deal for the sale of arms to Israel worth 18 billion dollars, which also includes 50 F15 planes."}, {"id": "22f9006b-7442-47e8-8e89-92fb3f869a70", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29065/", "date": "2024-06-18 09:34", "message": "Lebanese media: American envoy Amos Hochstein arrived in Beirut after his visit to Israel yesterday."}, {"id": "15d33d4e-e8af-460c-a318-44b06912649a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29064/", "date": "2024-06-18 09:34", "message": "This cartoon appeared in the British newspaper The Independent in the Arabic language and it shows the American floating dock in Gaza as a Trojan horse used to bring weapons into the Strip under the title of \"Bringing in humanitarian aid\".\n\nThe cartoon comes against the background of Palestinian accusations that the pier provided security assistance to the operation to rescue the kidnapped in the Nuseirat refugee camp."}, {"id": "12021a6a-b468-4155-bcf8-3a61efa2d18d", "channel_id": 1560386984, "url": "", "date": "2024-06-18 09:33", "message": "Gazans report the increase in chaos in in the center of the Gaza Strip.\nShooting incidents between residents have become a matter of routine, in public and in broad daylight.\nThe background for this is said to be an increase in mental stress, overcrowding (displaced persons from the north and south fled to the center), the price increases in the markets, problems in obtaining housing and \"women's problems\" as some add.\n\nYesterday in Deir al-Balah, members of the Shahin family tried to evict a tenant who did not pay rent and he beat them and shot at them and refused to leave.\nLiving in a structure as opposed to a tent is a critical, especially as the temperatures climb and staying in a tent becomes impossible - which adds to the family quarrels (and the lack of privacy that I mentioned a few days ago).\n\nThis is a side effect of the war and the displacement of people.\n\nIn the attached video - a shooting in the market of Deir al-Balah yesterday in broad daylight. There were no Israeli forces in the area..."}, {"id": "4345cf4c-239e-49d9-93a1-c904d7ff3663", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29062/", "date": "2024-06-18 09:26", "message": "Palestinian channels: هنا رفح .. جنوب قطاع غزة مئات الشهداء داخل منازلهم .. ولم يتم استخراج جثامينهم بعد\n\nHundreds of \"martyrs\" are still inside their homes in Rafah in the southern Gaza Strip - their bodies have not yet been recovered.\n(I spared you the attached video)"}, {"id": "91e5876c-83b7-4d1a-b21e-b160e3711445", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29061/", "date": "2024-06-18 09:25", "message": "US Central Command reported tonight that it destroyed 4 radar systems of the Houthis in strikes in Yemen.\n\n3 days ago the US Central Command announced the destruction of 7 radar systems of the Houthis in strikes in Yemen.\n\nA total of 11 radars in 3 days - I wonder if this will have an effect on the Houthis' ability to attack ships in the area."}, {"id": "3c656e35-a98a-4f56-863e-15c4dab1859f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29057/", "date": "2024-06-18 09:24", "message": "The Palestinians report 17 deaths in three attacks last night in Nuseirat in the center of the Gaza Strip:\n\n10 killed in the attack on the house of Taleb a-Ra'i in Camp 1\n\n5 killed in the attack on the home of the Almadhon family in Camp 5 near Abd El El\n\n2 killed in an attack on a group of people near Wadi Gaza"}, {"id": "cc225f89-b397-4c56-9763-59d2822d24c8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29053/", "date": "2024-06-18 09:22", "message": "Digital fraud - the next generation\n\nWho said you have to be in Gaza to be poor and ask for donations for Gaza?\nA Palestinian woman staying in Cairo decided that in order to be a successful Gazan digital beggar you don't need to be physically in Gaza.... You just need a sign that says north of the Gaza Strip...\nShe was photographed handing out meat to the \"poor Gazans\" on the occasion of the holiday with extras that she recruited in Cairo for the role of the poor Gazans.\n\nGazans in the north of the Gaza Strip who were unable to get meat for the holiday were outraged by the matter, to say the least... which did not stop the professional entrepreneur from smiling all the way to the bank and continuing to raise money on behalf of Gaza."}]