[{"id": "1487b27a-6404-459c-b744-fd162be10a1c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29052/", "date": "2024-06-17 21:26", "message": "عزت الرشق: \n\nالمقاومة وعلى رأسها كتائب القسام تُفكك مجلس الحرب الصهيوني.. الذي تَشكل قبل ثمانية أشهر لتفكيك المقاومة.\n\nSenior Hamas official Izzat al-Risheq:\nThe resistance led by the Izz ad-Din al-Qassam Brigades disbanded the Zionist War Cabinet...which was established 8 months ago to dismantle the resistance."}, {"id": "8ce8f252-6c85-462c-af40-944ebe02c7b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29051/", "date": "2024-06-17 21:24", "message": "An American company participating in the arms exhibition in France placed a sign on its counter acknowledging the Israeli citizens and Israeli companies that were excluded from the exhibition by order of a French court and at the request of the French government, due to their Israeli citizenship.\n\nThanks to follower A for the photo."}, {"id": "5292b5ab-22b3-4f47-b3f9-6891d94478fb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29050/", "date": "2024-06-17 21:23", "message": "Follower S points out that if you want to find the company where the watermelons came from👆 you just have to look at the sticker on the floor in the picture..."}, {"id": "d1c8798a-0dd0-433b-ab2f-6577b8dcb03b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29049/", "date": "2024-06-17 19:36", "message": "\"Hot goods\" entered the Strip today through trucks that passed through Kerem Shalom: watermelons on their way to Abu Kader with nicotine.\n\nNext time check them better at the crossing. This watermelon is worth more than 15 thousand NIS in Gaza..."}, {"id": "22ec569b-c92b-45ac-82f6-9166070cf2fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29046/", "date": "2024-06-17 19:02", "message": "Lebanese channels report on a series of attacks by the IDF this evening in southern Lebanon.\nAccording to these sources, there are casualties in the attacks in Chira and Aitaroun."}, {"id": "4e970584-fe35-4d02-b929-3925667f333f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29045/", "date": "2024-06-17 18:59", "message": "Palestinian channels report 12 dead and a number of wounded in an Israeli attack on a force securing goods and humanitarian aid trucks in East Rafah."}, {"id": "38b007c1-4628-43c0-8c33-63bf45cc879e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29044/", "date": "2024-06-17 15:33", "message": "Rafah sector: The IDF spokesperson publishes aerial footage of the Swedish village in the southwest of Rafah that was cleared by the soldiers of the 162nd division, after they also took control of the Philadelphi axis.\nAccording to the IDF spokesperson, hundreds of terrorists were killed during the fighting in Rafah. Hundreds of tunnel shafts and about 25 tunnels have been uncovered so far.\nThe activity continues."}, {"id": "e7e08bde-945e-4693-b67d-408727b6eaa0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29043/", "date": "2024-06-17 13:42", "message": "The Palestinian Ministry of Health in Gaza:\n\n10 deaths in the last day in the Gaza Strip.\n\n##\nThis is the lowest number of Palestinian deaths per day announced by the Palestinian Ministry of Health in Gaza since the beginning of the war (excluding the hudna days in November)."}, {"id": "549552e3-b05c-4fce-8e6e-346725f880a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29043/", "date": "2024-06-17 13:20", "message": "Hamas in an official announcement: the burning of the exit hall at the Rafah crossing by the occupation army is a war crime\n\n##\nIn the pictures: before and after"}, {"id": "35ab5997-e078-45ec-a689-3c0744485b0d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68995/", "date": "2024-06-17 13:00", "message": "Hezbollah officially announces the death of:\n\nMuhammad Ayoub - he was killed in the car attack in Selaa in southern Lebanon, earlier today.\n\nNumber 345"}, {"id": "4b3b0be0-0bd3-433f-967b-07f4089fd46e", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:21", "message": "Palestinian channels have been reporting on the movement of Israeli tanks and heavy equipment from the Philadelphi axis area towards the center of Rafah city and the area of ​​Al-Awda Square - where, according to these sources, the maneuvering forces are setting residents' houses on fire.\nAlong with the advance of the forces to the north, accompanying artillery fire was reported as well as an attack on a group of people using a UAV in the area of ​​the Khirbat al-Adas neighborhood in the north of Rafah (it also appears on the map)."}, {"id": "412358f8-85d4-4c28-ac9e-d783f9051b3d", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:10", "message": "Here is a link to the publication of the report itself for those who are interested:\n\nhttps://reliefweb.int/report/occupied-palestinian-territory/famine-review-committee-review-famine-early-warning-systems-network-fews-net-ipc-compatible-analysis-northern-governorates-gaza-strip-conclusions-and-recommendations-may-2024"}, {"id": "0058f1ab-e098-4ade-835c-c0946aec5460", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:08", "message": "##\nFor the followers of the channel this is no secret. For months I have been writing here that there is no hunger in Gaza and provided examples of this. There is now an official report.\n\nWhat is even more interesting here is the hypocritical media silence.\n\nThis report is newsworthy.\n\nThanks to follower D who sent me the report."}, {"id": "4a6abd21-defa-4573-afdf-67f883e6278a", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:08", "message": "The \"UN Office for the Coordination of Humanitarian Affairs in the Occupied Palestinian Territory\" publishes a report: it cannot be determined that there is a famine in Gaza\n\nThe report published on June 8 on behalf of an official committee appointed to check whether there is hunger in Gaza (following the concern in the international community) stated:\nNo evidence was found that there is a famine in Gaza and therefore it cannot be determined that there is a famine in Gaza.\n\nThe way the conclusions were worded shows that the authors of the report were displeased that these were the conclusions they reached, and they went to the trouble to add that this does not mean that the situation is not difficult in Gaza and even more so. The bottom line is that the authors of the report cannot determine that there is famine.\nAnd this is the official body that is used to determine international standards in the field of hunger."}, {"id": "2310e642-7f4b-44d9-9b26-f398ae356d53", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:03", "message": "The person killed in the car attack in Selaa in southern Lebanon is Muhammad Ayoub. According to Iranian sources, he was the commander of the artillery division of the Nasser unit in Hezbollah, which is responsible together with the Aziz unit for the entire sector of southern Lebanon.\n\nI will mention that last week Israel killed Taleb Abdullah, the commander of the Nasser unit (\"member of the General Staff\" in Hezbollah)."}, {"id": "5f787ed0-394b-4fdf-bf76-62835d6e3c07", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:00", "message": "Lebanese sources: the attack on the vehicle in Sela was carried out near the home of one of the occupants of the vehicle."}, {"id": "db86c8d7-3385-4c7c-87c5-11976480b27a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29029/", "date": "2024-06-17 10:59", "message": "Additional photos of the vehicle that was attacked near Sela in southern Lebanon."}, {"id": "c394e235-7d8b-4d51-99aa-3dcec1bbe6d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29026/", "date": "2024-06-17 10:59", "message": "Unofficial Lebanese channels report two deaths in an Israeli drone attack around noon on a vehicle near the village of Sela in southern Lebanon."}, {"id": "45553960-fd8a-4a23-9ab6-b769499cc31a", "channel_id": 1560386984, "url": "", "date": "2024-06-17 10:55", "message": "Lebanese channels report that many residents visit all the villages of southern Lebanon, pray in the local mosques and visit the cemeteries, as is the custom of the holiday (Feast of Sacrifice).\n\n##\nThis is what is behind the relative calm yesterday and today on the part of Hezbollah in the northern sector."}, {"id": "a529e5ca-cbd3-4b10-99d0-1280f80194e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29020/", "date": "2024-06-17 10:54", "message": "Photos showing the sinking of the Greek ship Tutor that was damaged as a result of a Houthi explosive on June 12.\n\nAlso attached is a video from the moments before the boat was hit, after the threat was identified by the ship's security team, as well as another video after the hit.\n\nAs a result of the impact, a member of the ship's crew went missing. The rest of the crew were rescued that day by US-led coalition forces."}, {"id": "83beb203-73b0-4855-a07b-83990a197496", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29038/", "date": "2024-06-17 10:52", "message": "The Palestinians report movement of displaced persons from the area of ​​a-Sika and Kashku streets, as well as from the area of ​​Shafut in the neighborhood of Zeytoun (southeast of Gaza City), following the movement of maneuvering forces and tanks (further to the report here👆) since this morning"}, {"id": "e20e26b2-9599-48a1-9b85-3981e1b5031f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29017/", "date": "2024-06-17 07:31", "message": "South Lebanon: Also in the villages of Tayrharfa and Ayta ash-Shab, the residents of southern Lebanon (who fled the terror of the war) are taking advantage of the holiday and the relative peace on the border with Israel to reach their homes and assess the damage from the Israeli attacks."}, {"id": "395e5458-33e5-44d1-86c9-27c199d1a9b6", "channel_id": 1560386984, "url": "", "date": "2024-06-17 07:30", "message": "Lebanese channels report that the IDF is firing machine guns at residents of South Lebanon who came, on the occasion of the holiday, to visit their homes in the village of Chahira, in order to witness the destruction caused by the IDF attacks."}, {"id": "b4b15faa-5dac-4f6c-abc7-737756623ed3", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:31", "message": "Published yesterday on Lebanese channels:\nA \"Lebanese bear\" was observed in the wild in the western part of the Baqaa district."}, {"id": "bbc43c83-4221-480b-8f2a-80270503e0dd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29013/", "date": "2024-06-17 06:30", "message": "Deadly fever on pilgrimage to Mecca\n\nThe Jordanian Ministry of Foreign Affairs: 14 Jordanian pilgrims who came to perform the Hajj, who are not a part of the official Jordanian delegation, died as a result of the intense heat on Mount Arafah.\n17 more Jordanians are identified as missing.\n\nOne of the Jordanian pilgrims who died wished, on his way to the mountain, victory for the Gazans (over Israel in Gaza).\nAttached is the video he shot expressing this wish."}, {"id": "bf29fd04-97ec-4ec1-9857-d9455310035e", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:28", "message": "The Palestinians report the movement of maneuvering forces and tanks, accompanied by aircraft, in the area of ​​the Zeytoun neighborhood in the southeast of Gaza City."}, {"id": "e67dcd79-ce90-455f-8b97-86793202a0dc", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:28", "message": "The White House: The American special envoy Amos Hochstein is expected to arrive in Israel today (Monday).\n\n##\nHochstein will try to promote the reduction of tensions between Israel and Hezbollah to further the goal of the Biden administration to reach a diplomatic agreement that will prevent war in the north."}, {"id": "0627d4df-e5e1-43e3-83ca-04652f017f87", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:25", "message": "Palestinian channels: IDF soldiers set fire to the \"departure hall\" at the Rafah crossing."}, {"id": "13227f6a-53c6-4d4e-a62a-ec80d8419acc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29008/", "date": "2024-06-17 06:25", "message": "Two events in the last few days in which President Biden froze in place and did not move his gaze for several long seconds, are creating a storm on social networks centered on a discussion about his fitness to run in the presidential elections this coming November.\nThe discussion on the network about the possibility of replacing him with another candidate has become more public in the last day."}]