[{"id": "fabfdf8d-51ea-4218-bea7-eaa16e747d05", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28186/", "date": "2024-05-31 21:51", "message": "Lebanon: Lebanese media reports a dead and 3 wounded in the Israeli attack in Aadloun and a dead and wounded in the Israeli attack in Ein Kana (video attached from Ein Kana).\nIn addition, 3 additional IDF attacks were reported in Khiam in southern Lebanon (no casualties in Khiam)."}, {"id": "5e9ac31c-e5a5-4a2a-a0ca-b0e9890df5c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28185/", "date": "2024-05-31 21:48", "message": "The Saudi Asharq channel from sources in Hamas:\n\nThe proposal that Biden is talking about does not refer to two points that we agreed on in the previous proposal:\n\n1. Guarantees for a complete cessation of hostilities.\n2. The withdrawal of Israeli forces from the Strip.\n\nHamas is open to any proposal based on a complete cessation of fighting and withdrawal of Israeli forces from the Strip."}, {"id": "f1949b0b-463b-4da2-9da7-b8624af3f9a0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28181/", "date": "2024-05-31 21:48", "message": "Lebanese Lebanese media reports on Israeli attacks at a distance of about 40 km from the Israeli border in Lebanon. Casualties reported.\n\nAfter the Israeli attacks in Lebanon👆 (there were additional attacks in Tayrharfa, Marwahin and Jabin), the Lebanese Al Mayadeen reports a rocket barrage from Lebanon towards Kiryat Shmona and Beit Hillel."}, {"id": "9ed5ae7b-9de9-47ee-a3cf-8be913db9f13", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28180/", "date": "2024-05-31 21:41", "message": "Hezbollah announces a second death for today in its ranks:\n\nAbbas Busi, a resident of Bint Jabil.\n\nHe was apparently killed in the attack on the motorcycle in Yaroun 👆\n\nNumber 327"}, {"id": "42893d12-4b9f-4891-9040-6357a3305903", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28179/", "date": "2024-05-31 21:37", "message": "Nasrallah: It will be dangerous for the entire region if Israel wins. History is being written now. You need patience and time.\n\nThis evening, Nasrallah delivered a 63-minute long speech at an event in honor of the Lebanese Shiite cleric Ali Kourani, who died of a heart attack on May 19.\n\nNasrallah devoted the first half of the speech to words of praise for the Shiite elder. A part of about ten minutes was dedicated to the internal arena in Lebanon and the issue of not appointing a Lebanese president, and the rest was dedicated to the war against Israel.\n\nIn this part, Nasrallah enjoyed quoting senior Israeli officials as proof that the situation in Israel is the most difficult it has known since its establishment. In this context, he points out that Netanyahu, in his insistence on continuing to fight, is taking Israel to the abyss. Nasrallah devoted more than six minutes to delighting in a quote he attributes to cabinet member Gadi Eisenkot, whom he defines as the inventor of the \"Dahiya doctrine\". According to Nasrallah, Eisenkot said that an entire Israeli division is required to fight for weeks against the Jabaliya battalion, which Israel announced it had already disbanded in the past.\nNasrallah quotes the governor of the Bank of Israel who said according to Nasrallah that Israel is in an economic catastrophe.\n\nNasrallah quotes the Israelis to sow confidence, patience and hope among his listeners from the axis of resistance.\nHe emphasizes that it will be very dangerous for the peoples of the region and the countries of the region from a security, economic and political point of view if Israel wins and therefore everyone must continue their firm stand.\nHe points out on the other hand that if Israel is defeated there will be a very big and very positive change in terms of the axis of resistance and the peoples of the region, therefore he states that we must act like Netanyahu who declared that this is a war of existence for Israel.\nNasrallah claims that the axis of resistance should act according to the premise that this is a war of existence for the axis members as well.\nAccording to him, history is being written now and the future is clear: it is only a question of time, patience, long-suffering, exhaustion and standing firm. According to Nasrallah, this is how the resistance axis will succeed in defeating Israel.\nHe further adds that thanks to the students in the USA and thanks to the awakening of the peoples of the world, they are all now part of the resistance axis, as the supreme leader of Iran said, and the resistance is in its best condition yet. Unlike Israel.\nNasrallah instills hope among the members of the resistance axis: we will pray in Al-Aqsa and Palestine will be liberated from the river to the sea.\n\n##\nThe main message from Nasrallah's words that should penetrate to each and every citizen of Israel is that this is an existential war whose results will affect the entire region and reshape it. Whoever is tolerant and shows patience is the one who will win. Those who look for shortcuts will find that the Middle East is not forgiving.\nIsrael must not lose the campaign even if it takes a decade. The pressure to reach a quick end as soon as possible is a disastrous concept from Israel's point of view, when in front of it stands the concept of the Shiite axis that sees the campaign decades ahead.\nIsrael wants to win the 100 meter run, but it will find out that it is a tiring but necessary marathon run. There is no other solution. There are no magic solutions."}, {"id": "9930b193-5392-4934-83af-e3c71413d890", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28178/", "date": "2024-05-31 21:32", "message": "Biden in a \"special speech\": there is a new Israeli proposal for a deal with Hamas\n\nAfter a lot of promos, the American president gave a short speech in which he revealed that Israel submitted a new proposal for a deal with Hamas that would include the release of the hostages.\nAccording to Biden, the deal consists of three phases where the first phase, which will last 6 weeks, will include the withdrawal of Israeli forces from the Strip and the exchange of prisoners for hostages. According to him, the second phase could be an exchange deal that would include the Israeli soldiers who were captured, and in the third phase, an intensive rehabilitation of the Strip would begin.\nBiden urges Israel to accept the offer, which he says she herself offered...\nBiden urges Hamas to prove that it is indeed interested in a ceasefire and accept the deal.\nBiden points out that if Hamas does not accept the Israeli offer, the fighting will continue.\nAccording to him, the deal will lead to the end of the fighting and the \"acceptance of Israel in the region\" (Normalization Agreement - AA).\n\n##\nAt face value, I don't see any dramatic innovation here. Everything is based on the previous well-known 3-step proposals, as previously published by the Al-Akhbar newspaper and the Al-Jazeera network.\nI will be very surprised if Biden's speech tonight and the \"new proposal\" lead to a significant change and reaching a deal.\nThe speech reflects the hopes and wishes of the White House, but clashes with the ground of reality of the Middle East."}, {"id": "b250046a-3d7e-4fa7-a147-c54ac2b56e21", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28177/", "date": "2024-05-31 17:33", "message": "Hezbollah announces a death in its ranks:\n\nHaider Jahir - combat medic.\n\nHe was killed in an attack on the rescue vehicle earlier today in Naqoura in southern Lebanon.\n\nNumber 326"}, {"id": "c48c432c-3599-4ddf-9692-62d33ec33872", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28176/", "date": "2024-05-31 16:58", "message": "Unofficial Lebanese sources: two dead in the motorcycle attack in Yaroun."}, {"id": "56bb5c0a-9eff-4daf-8f4c-154810043721", "channel_id": 1560386984, "url": "", "date": "2024-05-31 16:57", "message": "Lebanese media: An Israeli UAV attacked a motorcycle in Yaroun in southern Lebanon a few hours ago."}, {"id": "c14e192a-8f15-4091-8624-f8f63cd1ecc3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28174/", "date": "2024-05-31 16:39", "message": "Hamas-identified channels: Since the withdrawal of the IDF forces, the Palestinian rescue forces have rescued more than 70 bodies of Gazans from the Jabaliya and Beit Lahia areas in the north of the Gaza Strip."}, {"id": "119adf0b-7785-474b-b1fe-1a633fa13a4a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28171/", "date": "2024-05-31 13:31", "message": "Some good news for Israel from the World Health Organization (of the United Nations):\n\nAn Israeli physician, Dr. Asher Shalmon, was appointed a member of the organization's executive committee.\nBeyond that, the organization approved a resolution condemning Hamas's military use of medical facilities such as hospitals and clinics as well as ambulances.\nThe call for the unconditional release of the Israeli abductees in Gaza was also accepted, recognizing that they do not receive any of the rights they deserve.\n\n##\nIt may sound trivial to you, but the ratification of such a decision by one of the UN agencies (which is always biased against Israel) is a real achievement that could help Israel in the legal arena, especially with regard to the targeting of operatives and terrorist activity in medical facilities across the Strip."}, {"id": "ace158c6-1224-4666-9837-2b41ab0e4ab9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28170/", "date": "2024-05-31 13:29", "message": "Police make an arrest in the Temple Mount area a short time ago."}, {"id": "e78e1679-d7e8-4f9b-a9a8-51ebb2c171b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28169/", "date": "2024-05-31 13:29", "message": "Iranian President Raisi's personal belongings found in the crashed helicopter: blackened rings and a \"mehr\" - a prayer stone made of clay that Raisi placed in front of him during the prayer (the Shiites usually press their foreheads to \"mehr\" while kneeling on the ground)."}, {"id": "ca738f9a-87e7-41b9-be20-016721e6d080", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28168/", "date": "2024-05-31 13:27", "message": "The military spokesman of the Houthis:\nWe responded to the American-British attack tonight in Yemen by firing ballistic missiles at the American aircraft carrier\nDwight Eisenhower.\nWe hit the target accurately.\n\nThe American attack killed 16 and injured 41, including civilians."}, {"id": "21abe471-ac8f-4073-8621-18b08693380d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28168/", "date": "2024-05-31 13:26", "message": "More documentation from Jabaliya following the withdrawal of the IDF"}, {"id": "576ca58e-ad34-4b60-b623-5295e8ebf2c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28162/", "date": "2024-05-31 13:26", "message": "Palestinian channels: After the withdrawal of IDF forces from Jabaliya, they return to the camp (in the north of the Strip) which looks as if it was hit by an earthquake."}, {"id": "73e78374-76a2-49fd-95a5-1fc7e1084f89", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28161/", "date": "2024-05-31 13:24", "message": "Hezbollah: We attacked the Iron Dome batteries in Zaura using suicide drones. We hit the target.\n\nIDF: Following the sirens that sounded earlier today regarding a hostile aircraft infiltration in northern Israel, two explosive UAVs that crossed from Lebanon fell in the Zaura area in the northern Golan Heights. No injuries were reported and the incident is under review. \n\nIn addition, earlier today one launch from Lebanon toward the area of Metula fell in an open area, no injuries or damage were reported. The IDF struck the source of the fire. \n\nFollowing the sirens that sounded a short while ago in the Metula area and in the past hour in the Qela area regarding a hostile aircraft infiltration, it was determined to be a false identification."}, {"id": "3c9dc082-8b81-484e-99b3-50313bc4ae2c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28160/", "date": "2024-05-31 13:21", "message": "Northern Gaza Strip: The movement of Gazans out of Beit Hanoun following the instructions 👆 of the IDF calling them to move to the west of Gaza City."}, {"id": "7a53b355-c76d-442b-886d-be73c7f382bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28159/", "date": "2024-05-31 13:19", "message": "Ismail Haniyeh, Chairman of the Political Bureau of Hamas, in a speech at the 33rd Arab National Conference in Beirut (apparently his appearance is only via video - AA):\n\n1. \"Tufan Al-Aqsa\" raised the occupation of the Palestinian issue to an unprecedented level that opened the door to the recognition of a Palestinian state.\n\n2. In order to realize the liberation of Palestine and the return, elections must be held for the Palestinian presidency, the Legislative Council and the Palestinian National Council (the Palestinian National Council which is actually the parliament of the PLO organization, to which most of the Palestinian factions, except for Hamas, belong -AA) must be held.\n\n3. A government of Palestinian national consensus must be established in the West Bank and the Gaza Strip.\n\n4. We must continue to oppose normalization moves with Israel."}, {"id": "e9a94e45-c8ed-4233-bc50-cfb7709205ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28158/", "date": "2024-05-31 13:15", "message": "The Russian Ministry of Defense: In Israel's latest attack in Syria yesterday👆, Israel used an ADM-160 MALD aircraft designed to deceive air defense systems.\nAccording to the Russians, Israel launched it at the same time as the Spice 1000 missile, but had to attack again later, because according to the Russian Ministry of Defense, the first attack was unsuccessful."}, {"id": "4df734e2-ed21-4731-ad51-c3b0d4871e09", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28157/", "date": "2024-05-31 13:14", "message": "Official Iranian media:\n\nAli Larijani submitted his candidacy for the Iranian presidential elections this morning.\n\nLarijani's candidacy is not surprising👆 He wanted to run for president against Raisi in 2021 but was blocked (by the big boss) so as not to harm Raisi's chance, who was the favorite in terms of Iran's supreme leader.\nLarijani served for 12 years as the Speaker of the Iranian Parliament (2008-2020), a powerful and significant position in Iran, which is a stepping stone to more senior positions.\nLarijani also served in the past (until 2007) as the chairman of the Iranian National Assembly and the subject of the negotiations on the nuclear agreement with the West is well known to him.\n\nHe is definitely a contender with high chances of winning."}, {"id": "9ea8b994-c7bb-412a-a1d2-2d606df1bab8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28156/", "date": "2024-05-31 13:12", "message": "The Ministry of Health of the Houthis in Yemen:\n\nWe condemn the American-British attack tonight that targeted civilian sites in Hodeidah province.\n\nThe intentional and illegal killings carried out by the planes as part of the British-American-Zionist aggression are war crimes!\nThese crimes constitute a violation of international law.\nThe number of dead in the attack is 16 and there are another 30 wounded. Due to the severity of the condition of the injured, the number of dead is expected to rise.\n\n##\nI want to express my concern that the Americans did not present organized plans for the evacuation of the population in Hodeidah prior to the attack. I expect a quick and transparent investigation. I am disturbed by the loss of innocent civilian lives in Yemen..."}, {"id": "f672f1e1-15cd-4c8c-bbc2-b1333dfcc0a8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28152/", "date": "2024-05-31 13:09", "message": "The IDF spokesperson confirms: the operation in Jabaliya is over.\nAccording to the IDF spokesperson, as part of the operation in Jabaliya, hundreds of terrorists were killed and tunnels more than ten kilometers long were destroyed.\nAmong the achievements of the operation - the recovery of the bodies of the 7 abductees and their repatriation for burial in Israel."}, {"id": "b6e8bd7b-6e42-4f96-94ec-69c39297271e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28151/", "date": "2024-05-31 13:09", "message": "The Palestinians report that this morning the IDF dispersed leaflets in the area of ​​Beit Hanoun in the north of the Gaza Strip where those staying at the schools in blocks 577-578 are called to evacuate to the south, to the western area of ​​Gaza City."}, {"id": "9ae5c4d0-633f-47ec-b53d-991f13436b46", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28150/", "date": "2024-05-31 07:16", "message": "Nikki Haley at the Western Wall.\n\nPhoto credit: The Western Wall Heritage Foundation."}, {"id": "07ee41de-da25-4852-bf14-bc42214e3513", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28149/", "date": "2024-05-31 07:14", "message": "Members of Al-Aqsa Martyrs' Battalions (AMB) in Tulkarm se to be upset that people doubt their claims 👆 regarding the infiltration of the Israeli town of Bat Hefer and published a video of an M-16 (with a close-up on its serial number) claiming it to be the rifle which they allegedly took from an \"officer's house\" during their supposed infiltration.\n\nIt's worth noting that several days ago the AMB militants claimed to have taken an M-4 rifle, now they're presenting an M-16. They also claimed that they took a Glock pistol, which for some reason wasn't featured in the video. There seem to be quite a few inconsistencies in the Palestinian claims."}, {"id": "6df2e94f-adfa-4c72-84ba-0d7b3f0c0b3a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28148/", "date": "2024-05-31 07:03", "message": "Hamas-affiliated sources claim: The explosions that rocked Gaza City last night and made the residents think it was an earthquake were a controlled explosion carried out by the Israeli forces in a residential complex in the north of the Gaza Strip."}, {"id": "5db79306-f690-4fd7-825b-522f4e1b7bc4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28147/", "date": "2024-05-31 07:02", "message": "Yemeni media reports 14 dead and 30 wounded (including civilians) in an American-British attack tonight in the port city of Hodeidah and the a-Salif area, in western Yemen.\n\nAccording to the report, the government building and the Broadcasting Authority building in Hodeidah were targeted.\n\n###\nLet's hope no innocent civilians were killed... I'm sure an investigation will be conducted and everything will be presented transparently if so."}, {"id": "f130b8a6-04ca-445b-9e73-c9c4f4db3592", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28146/", "date": "2024-05-31 07:00", "message": "Al-Jazeera: The IDF withdrew from the Jabaliya \"refugee camp\" in the northern Gaza Strip after a military operation there that lasted 20 days.\n\nIn addition, al-Jazeera reports that the IDF has also withdrawn from Beit Lahia, Beit Hanoun, and the rest of the places where it operated in the north of the Gaza Strip.\n\n##\nThe IDF spokesman has not yet issued an official statement on the matter."}, {"id": "3e18513d-3471-4851-a5d7-d82d721cf692", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28145/", "date": "2024-05-31 06:59", "message": "The Palestinians report three casualties this morning, all members of the Darwish family, in an attack on a vehicle in the Nuseirat \"refugee camp\" in the center of the Gaza Strip.\n\nAccording to the Palestinians, the three were responsible for managing humanitarian aid that entered the Strip.\n\nThe Palestinians additionally also report nine casualties in the attack on the home of the Abu Zahadi al-Sous family in block 9 of the Al-Buriej \"refugee camp\" in the center of the Gaza Strip, last night."}, {"id": "8f15e836-9373-48f3-a9f3-8fc22d60d5fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28144/", "date": "2024-05-31 06:54", "message": "The IDF spokesman announced this morning the death of Adar Gavriel from the Bislah brigade (828), and a soldier in the Givati Brigade in battles in the north of the Gaza Strip and in the south.\n\nMay their memory be a blessing."}, {"id": "45964857-f5ee-4b00-9fcf-37a071bbe805", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28143/", "date": "2024-05-31 06:52", "message": "Gaza City residents reported shortly after midnight last night that they experienced an \"earthquake\" - now they claim that it was Israeli bunker-penetrating missiles."}]