[{"id": "62f51d3d-8e2b-419b-859c-7c2b119d5a37", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28912/", "date": "2024-06-14 21:09", "message": "The Lebanese are reporting a large fire in southern Lebanon as a result of an IDF attack earlier today."}, {"id": "e32c71c0-56bb-411d-a50a-9fc42a507f12", "channel_id": 1560386984, "url": "", "date": "2024-06-14 21:09", "message": "Palestinian channels covering what is happening in Rafah:\n\n#شاهد | هكذا يتلذذ جيش الاحتلال بتدمير بيوتنا في قطاع غزة.\n\n\"Watch how the occupation army revels in the destruction of our homes in the Gaza Strip.\""}, {"id": "21c9e4d0-b487-46cb-afee-6d9315148f61", "channel_id": 1560386984, "url": "", "date": "2024-06-14 17:42", "message": "The Iranian opposition in an amusing picture: all 6 candidates for the Iranian presidential elections - in the image of Iran's supreme leader, Khamenei.\nWhoever is elected will not really be able to change anything from what the supreme leader decides."}, {"id": "6c28ba10-60d4-4008-90d8-bae75330c01e", "channel_id": 1560386984, "url": "", "date": "2024-06-14 14:47", "message": "IDF Spokesperson:\n\nA report was received a short time ago about a ramming incident in the Rantis area of ​​the Ephraim Brigade, as a result of which an IDF soldier was injured and sought medical treatment, his family was informed.\n\nIDF forces began a pursuit of the offending vehicle, the circumstances of the incident are under investigation."}, {"id": "e2fa5104-3072-4145-ac25-5c6a47376fc9", "channel_id": 1560386984, "url": "", "date": "2024-06-14 14:34", "message": "Update from the north of the Gaza Strip ahead of the Feast of Sacrifice:\nThere are cows (looking thin - AA) at a \"sale\" price of 17 thousand dollars per unit.\n\nThe price of one lamb reaches 2000 dollars.\n\nThe guy in the video: The lamb is more expensive than me.\n\n##\nThe price of a cow is higher than the prices of vehicles in Gaza."}, {"id": "2725db46-17dd-42d1-aab8-d954a3e358b6", "channel_id": 1560386984, "url": "", "date": "2024-06-14 14:33", "message": "A bag of cold drinking water in Gaza: only one shekel..."}, {"id": "57ba9df9-2efc-45fa-bd7f-a6467c725c30", "channel_id": 1560386984, "url": "", "date": "2024-06-14 14:32", "message": "Rafah, southern Gaza Strip, today: two \"Karelia\" cigarettes for NIS 200."}, {"id": "8d485d93-36cd-46a3-82da-2b256ca792ba", "channel_id": 1560386984, "url": "", "date": "2024-06-14 14:31", "message": "Another photo from the joint military exercise held by Iran and Azerbaijan."}, {"id": "ae71042d-65a3-495f-aac9-9593a06b9dc6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28903/", "date": "2024-06-14 14:30", "message": "Iran and Azerbaijan held a joint military exercise\n\nDefinitely something that should worry Israel: Iran and Azerbaijan held a joint military exercise on Wednesday and Thursday in the area of ​​the border shared by the two countries.\nThe stated purpose of the exercise is to strengthen the protection of the borders in the face of terrorist threats.\nDuring the exercise, Iran used the Almas anti-tank missile, which Hezbollah is currently firing at Israel. The Almas is actually a product of reverse engineering that the Iranians did to the Israeli \"Gil\" missile.\n\nIt is worth noting in this context that Azerbaijan possesses very advanced Israeli weapons as part of arms deals made between the countries."}, {"id": "cc3928be-e005-4484-9530-6b1af0e2e562", "channel_id": 1560386984, "url": "", "date": "2024-06-14 14:28", "message": "The village of Sheba in southern Lebanon today: primitive equipment used to put out a primitive fire, which was ignited by primitive means..."}, {"id": "50fbc1fa-30c2-40e3-bfe7-18c33afefd2e", "channel_id": 1560386984, "url": "", "date": "2024-06-14 11:10", "message": "IDF Spokesperson: Interception of 11 Hostile Aircraft Launched from Lebanon; Footage of IAF Defensive Activities\n\nOver the last 72 hours, the Hezbollah terrorist organization launched 16 hostile aircraft from Lebanon toward Israeli territory, 11 of which were intercepted by IAF aerial defense systems and fighter jets.\n\nThe Israeli Air Force is continuing to operate at all times to thwart terrorist activities and protect Israel’s skies from any threat."}, {"id": "95e4fb0c-5dfa-4735-b731-29bb82fd7de3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28897/", "date": "2024-06-14 10:57", "message": "Gazans report a limited supply in the cattle and sheep market in Deir al-Balah in the center of the Gaza Strip ahead of the Feast of Sacrifice that will take place on Sunday."}, {"id": "6f234b15-36d3-46c3-af0c-d80cf4b4ad57", "channel_id": 1560386984, "url": "", "date": "2024-06-14 10:56", "message": "Samy Gemayel, a member of the Christian Kataeb party in Lebanon:\nWe (Christians) want to live in peace and brotherhood, but the Shabaab (meaning Hezbollah - AA) want war...\nWe are children of peace and brotherhood. We hate death...\nWe do not want to live in a state of war."}, {"id": "1c8b08f5-71d4-4911-b9b7-48a1081230a8", "channel_id": 1560386984, "url": "", "date": "2024-06-14 09:33", "message": "Fatah supporters continue to \"bring up memories\" of the Hamas military coup:\nFatah supporters were taken captive (walking in the street with raised hands) and Fatah headquarters were blown up, as well as government symbols."}, {"id": "86165ce6-5a66-4532-9b9a-cd4231c7dbdc", "channel_id": 1560386984, "url": "", "date": "2024-06-14 09:32", "message": "Since this morning, Hezbollah has accepted responsibility for 6 attacks on Israel, including two attacks on Kiryat Shmona, Kfar Saled and Metula - in response to last night's attack on the Janta building in southern Lebanon by the IDF, an attack in which two Lebanese women were killed and several other Lebanese were injured."}, {"id": "7a706540-8f79-4a61-be60-4b1b2b0901aa", "channel_id": 1560386984, "url": "", "date": "2024-06-14 09:32", "message": "Al Jazeera: More than 30 rockets were fired from Lebanon towards the Galilee about an hour ago."}, {"id": "b462031c-173e-4cd5-9075-1cde8cc2c8ba", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28890/", "date": "2024-06-14 09:31", "message": "Mecca, Saudi Arabia: Pilgrims flock to the Kaaba Square.\n\nToday begins three festive days of continuous prayer in the Muslim world:\nFriday prayer.\nThe day of standing on Mount Arafat (completing the Hajj pillar).\nEid al-Adha."}, {"id": "5a4f07b1-86f3-445d-9020-d2c866cd2236", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68794/", "date": "2024-06-14 07:31", "message": "Palestinian sources report that the two whom the IDF killed yesterday in a house in Kabatieh 👆 were commanders in the Jenin Battalion of the Islamic Jihad. Their names:\nMuhammad el Asti\nMuhammad Shalabi - Abu Jaber\n\nLater, another Palestinian was killed in Jenin by IDF fire. He was the son of an officer in the PA's security apparatus."}, {"id": "059b01d6-a88d-4ca5-b2a6-67ae4bf38872", "channel_id": 1560386984, "url": "", "date": "2024-06-14 06:57", "message": "Gaza sources are reporting in the last day on the reorganizing of the IDF's maneuvering forces in Rafah.\nAccording to the Palestinian reports, IDF tanks were moving from the center of the city in Rafah, south, back to the Philadelphia axis on the Egyptian border."}, {"id": "b81bfbf2-703d-426b-98c7-0adb5d87e88a", "channel_id": 1560386984, "url": "", "date": "2024-06-14 06:57", "message": "The Shiite militias in Iraq claim that they attacked the Ramat David base this morning with a UAV."}, {"id": "2093697d-502c-4cb5-a788-8d9c7a258159", "channel_id": 1560386984, "url": "", "date": "2024-06-14 06:56", "message": "Senior Hamas leader Osama Hamdan in an interview with CNN (note this us an established American network interviewing a senior member of a terrorist organization):\n\nNo one knows how many of the hostages are alive.\n\nIsrael must withdraw from the Gaza Strip and let the Palestinians determine their future.\n\nIf the US behaves positively and not only through Israel's point of view, we will reach an agreement.\n\nWhat happened on October 7th is a reaction to the Israeli occupation.\n\nWhat happened after October 7th revealed the true face of Israel."}, {"id": "3f78a5a0-2992-4489-a7d0-943b9f88554c", "channel_id": 1560386984, "url": "", "date": "2024-06-14 06:52", "message": "Today, temperatures are expected to be particularly high in southern Lebanon and Syria than usual for the season.\n35 degrees in Bint Jabil in southern Lebanon.\n42 degrees in Damascus.\n\nThere is a danger of fires..."}, {"id": "fe240013-a8e4-490a-a74f-6605858ad29d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28881/", "date": "2024-06-14 06:52", "message": "Today, Fatah supporters mark the 17th anniversary of the \"black coup\" in Gaza, in which Hamas operatives brutally murdered hundreds of Fatah members, including members of the military and civilians.\nFatah operatives were thrown from the roofs of government buildings in Gaza handcuffed and blindfolded or shot to death at close range. This is how Hamas seized control of the government in Gaza.\nSome will find commonality between the scenes from this day when Hamas operatives went on a killing spree in the streets of Gaza and between the killing sprees carried out by Hamas operatives on October 7 in Israel."}, {"id": "778e9d32-0475-4b95-9379-4decb72a9bab", "channel_id": 1560386984, "url": "", "date": "2024-06-14 06:50", "message": "Hezbollah Secretary General Hassan Nasrallah is expected to give a speech on Wednesday, June 19, at 5:00 PM in honor of Taleb Abdullah, the top Hezbollah official who was killed by Israel yesterday."}, {"id": "ff689dfb-224d-4b98-86ff-633898cd68b7", "channel_id": 1560386984, "url": "", "date": "2024-06-14 06:49", "message": "Lebanese sources indicate that clearing the rubble of the attacked building in Janta went on into the night.\n\nThe building itself was completely destroyed after being attacked by fighter jets."}, {"id": "284218d9-4ec1-4a6c-b5c5-4b31094bb767", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28874/", "date": "2024-06-14 06:47", "message": "Lebanese channels report that one person was killed and ten wounded in an attack by IDF warplanes on a 3-story building in the village of Janta in southern Lebanon (Tyre district) last night."}]