[{"id": "5bba225d-47f3-441c-a23b-32a923f55d24", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32915/", "date": "2024-08-22 19:57", "message": "Here is the winning response to the Netzarim falafel video, which included a photo (attached), sarcastically highlighting the stark contrast between media coverage and reality:\n\nيا زلمة مستحيل، هاد معمول الفيديو بالذكاء الاصطناعي، لكن الحقيقة هي انه الجيش غارق بوحل غزة\n\nTranslation: \"Man, this can't be real. It had to be made with artificial intelligence. The truth is that the Israeli army is sinking in the Gazan mud...\"\n\n(The screenshot from al-Jazeera quotes Itzhak Brik with the Haaretz headline: \"Israel in collapse, and our soldiers are bogged down in the Gazan mud.\")\n\n###\nThis Gazan is mocking the image al-Jazeera portrays for Palestinians, showing Israeli collapse while IDF soldiers are actually setting up a falafel stand in Netzarim.\n\nThis comment highlights the huge gap between media reports and reality. Many Palestinians seem to have recognized the discrepancy and are no longer deceived by such portrayals."}, {"id": "73e54705-673b-46f0-900a-1a5ce547776f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32914/", "date": "2024-08-22 19:53", "message": "This video, shared by several Gazan users on social media under the title \"Setting up a falafel stand\" (عاملين بسطة فلافل), has generated thousands of responses from Gazans, most of which are sharply cynical. It’s evident that such videos continue to be very distressing for them.\n\nHere are a few examples of the comments, with the most notable response to be posted separately in the next post:\n\n1. Where do they get electricity from?\n2. This is Photoshop (in a sarcastic tone).\n3. They are really stuck in the Gazan mud.\n4. They must have received a franchise licence from \"Falafel Akkila\" in the Strip.\n5. Fayez al-Dwairi (a military analyst for al-Jazeera) said they won’t be able to enter on the ground...\n6. They’re not drowning in the Gazan mud. They’re drowning in falafel.\n7. Gaza is lost.\n8. Wow... they have cola, XL, and cigarettes..."}, {"id": "a5f65836-1b1f-455f-abcc-7aee8916b6c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32912/", "date": "2024-08-22 19:16", "message": "A Gazans on Facebook identified his house in a photo of Defense Minister Gallant during his visit to Rafah and wrote:\nThe command of the Israeli army gathers at our house in the Rafah district near the  El Arab mall..\n\nOne answered him:\nهيهم مشغلين الكو الكهرب ونعمة الله عليكوً هههههه\n\nHere they set up electricity for you (at home) .... Allah's grace is upon you... \n\n##\nThe issue of electricity is painful for Gazans..."}, {"id": "ec265bee-da01-4a17-addd-8687136998ca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32911/", "date": "2024-08-22 19:10", "message": "A Gaza channel writes:\nNot a scene from a movie\n\nهذا استهداف مساء اليوم على بركس تجاري على شارع صلاح الدين شرق مخيم النصيرات وسط قطاع غزة.\n\nThis is not a scene from a movie.\nThis is an attack, this evening, on a commercial building on Salah al-Din avenue in the east of the Nuseirat refugee camp in the center of the Gaza Strip."}, {"id": "6d6e0792-98f9-450f-b69f-792999860fd4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32910/", "date": "2024-08-22 19:06", "message": "The Lebanese Almanar channel reports that the IDF launched two guided missiles this evening at the village of Chihine in southern Lebanon."}, {"id": "343fffd6-d9b6-48f0-941d-3de83a590ee5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32909/", "date": "2024-08-22 19:05", "message": "The evacuating Gazans complain: we have nowhere to evacuate, there is no safe place in Gaza. Neither north nor south. - Even on the beach, which was the last refuge for the displaced - the ships are shooting at us..."}, {"id": "c12143f6-6d90-40e9-9115-b99e258969db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32908/", "date": "2024-08-22 18:04", "message": "Khan Younis, Southern Gaza Strip: Journalists report that thousands of Gazans have been forced to evacuate through flowing sewage in the streets, carrying their belongings, due to evacuation orders from the IDF spokesperson.\n\n##\nThe pressure on Gaza's civilian population has been mounting in recent weeks, as seen on social media. Frequent evacuation orders and a reduction in humanitarian areas have made life especially challenging."}, {"id": "79085fe1-eefe-42ef-865d-33392714f151", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32907/", "date": "2024-08-22 18:02", "message": "The IDF announces the death of Sergeant Ori Ashkenazi Nechemya from the 401st Armored Division, who was killed in battle in the southern Gaza Strip.\n\nMay his memory be a blessing."}, {"id": "c9dc27c6-c6e6-4664-9781-bb159edc2d36", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32905/", "date": "2024-08-22 17:58", "message": "Do you remember the attack on the upper floors of the Zakut building in Nuseirat which took place three days ago 👆👆? \n\nWell, Israeli ground forces finished the job today."}, {"id": "361d4cf3-e7d2-40ba-99fd-66924d00dc0d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32904/", "date": "2024-08-22 17:55", "message": "IDF Spokesperson: IDF, Border Police, and Shin Bet forces completed a 14-hour anti-terror operation today in the Tulkarm area of the Menashe Brigade.\n\nDuring the operation, the Air Force targeted and eliminated three armed terrorists in the area.\n\nAs part of the operation, Sayeret Haruv fighters, under Shin Bet guidance, destroyed two laboratories used for manufacturing IEDs, and Duvdevan Unit fighters destroyed a wanted person's apartment and arrested another wanted individual. \n\nAdditionally, the forces dismantled explosive devices planted in various roads, which were intended to harm our troops."}, {"id": "015afc9c-6e25-4b58-ac75-73b90de13964", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32900/", "date": "2024-08-22 17:51", "message": "Yemen: Houthis continue to be drowned in floods - 60 people were killed so far as hundreds of thousands lost their homes\n\nThe Pakistani Daily Mail reports that 60 people have died in the recent floods across Yemen. According to a UN report, 294,000 people have experienced damage from the severe flooding, with many losing their homes and possessions.\n\nIt was also reported that 14 people were killed in the Hajjah province in northern Yemen due to a lightning strike, and 13 others are missing due to weather-related issues. The UN refugee agency estimates that the severe weather and heavy rains will continue in Yemen for several more weeks.\n\n#Everything_Is_From_Allah"}, {"id": "b5946f76-0402-4411-bfde-ad1b16d472ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32899/", "date": "2024-08-22 15:56", "message": "Lebanese sources report that a short time ago the IDF launched a surface-to-surface missile at a target in Ayta ash-Shaab in southern Lebanon."}, {"id": "1956692d-65b8-4e13-9923-828ac0aea3d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32898/", "date": "2024-08-22 15:44", "message": "North Carolina: Trump speaks at an open rally for the first time since the assassination attempt, this time behind bulletproof glass."}, {"id": "1bcc4ffe-8b5c-4f5f-a34f-eeb0f098d00e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32897/", "date": "2024-08-22 15:17", "message": "The IDF spokesman in Arabic published a short time ago another evacuation notice for the residents of east Khan Yunis and the center.\n\nThese are areas that have already been evacuated recently."}, {"id": "2f689dd9-17f2-41ae-bcf9-f648a6c50225", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32896/", "date": "2024-08-22 15:17", "message": "Palestinian channels report that the IDF called the Mukhtar of the al-Abdallah family in north Khan Yunis and informed him that a-Tina Street (map 👆) near the Khan Yunis anchorage must be cleared in preparation for a limited military operation that will begin in the area at 5:00 p.m.\n\nAccording to the reports on social networks, the residents are evacuating in panic from a-Tina Street in the north of Khan Yunis."}, {"id": "e44c1896-c6b4-4548-a620-e5c192f8274d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32895/", "date": "2024-08-22 15:15", "message": "The IDF spokesman conveyed information to the military reporters from which it can be estimated, based on preliminary information from the Institute of Forensic Medicine, that the 6 abductees whose bodies were recovered from the Strip this week were shot to death by their captors."}, {"id": "eb288553-21cb-4de1-90bf-460ebf1c99b4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32899/", "date": "2024-08-22 15:14", "message": "The exact spot, near Deir Mimas in southern Lebanon, from which Hezbollah operatives launched rockets at Israel👆, courtesy of Ben Tzion Macales (on the Beaufort slopes)."}, {"id": "9f477ae4-ecb9-4285-aa70-88d570a0559d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32892/", "date": "2024-08-22 15:13", "message": "Israel has many, many supporters inside Lebanon, most of them quiet, who long for the moment when Israel will strike Hezbollah mercilessly. There are far more people inside Lebanon who would be happy for Hezbollah to lose than for it to win.\nInterests need to be linked in an intelligent way in preparation for the day of command.\nThis could be Israel's secret weapon inside Lebanon, which would be a significant advantage in battle. They just have to see that Israel will fight Hezbollah to the end and they have nothing to lose."}, {"id": "9833f7a5-d6d4-466d-b2e4-5d9b3c4ea7a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32890/", "date": "2024-08-22 13:48", "message": "Hezbollah supporters online are furious.\nThe reason: the attached video, which was taken in the village of Deir Mimas in southern Lebanon, reveals the point from which Hezbollah operatives fired rockets at Israel today.\n\nThe videographer is heard cursing (from the bottom of his heart) the Hezbollah operatives who launched the rockets.\n\nHezbollah supporters revealed the name of the photographer, his picture and his personal number (he is a soldier in the Lebanese army, a member of the Christian community) online and called to \"execute the Zionist collaborator\".\n\nHezbollah supporters also complain on social media that even residents in the village of Ramish (beyond the village of Deir Mimas) who are not affiliated with Hezbollah, but oppose it (Christians, for example), submit reports to the IDF so that the IDF will attack the villages next to them - which are affiliated with Hezbollah and will not attack the Christian villages in southern Lebanon.\n\nThanks to follower M."}, {"id": "5376a095-3530-452f-ac11-2564ed5702d2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32889/", "date": "2024-08-22 13:19", "message": "The destruction of the Rafah Municipality building, courtesy of Company B, Battalion 605."}, {"id": "8b69afef-7f9b-4dd6-8621-5702445d3b52", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32888/", "date": "2024-08-22 13:17", "message": "The Lebanese Ministry of Health with official data:\n\n564 dead in Lebanon since the beginning of the war. The number of wounded during this period stands at 1848."}, {"id": "ba45ab96-8c67-46a7-93f9-628704e51e15", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32887/", "date": "2024-08-22 13:17", "message": "President Putin claims: Ukrainian forces tried to attack the nuclear power plant in Kursk."}, {"id": "ad81a502-3ed1-4757-88f7-35f09835c888", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32886/", "date": "2024-08-22 13:16", "message": "The advance of the Ukrainian army inside the territory of Russia\n\nThe Russian governor of the Kursk region reports that 130,000 of the Russian citizens of the region have been evacuated from it and now only 20,000 people remain."}, {"id": "15df6c05-89f4-4f6c-b3bf-30004776e9f9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32885/", "date": "2024-08-22 11:21", "message": "Deir al-Balah Municipality: Following the latest evacuation instructions from the IDF, approximately one hundred thousand residents evacuated from Deir al-Balah."}, {"id": "66a10025-c2e5-48d0-ba17-f66c62fff609", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32884/", "date": "2024-08-22 11:21", "message": "Chicago: The participants of the Democratic Party convention are also a little tired of the pro-Palestinian demonstrations - they cover their ears as the names of the Palestinian children killed in the war in Gaza are read through a megaphone."}, {"id": "5377fc20-c221-4d8a-b7dc-87c86d00ac67", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32883/", "date": "2024-08-22 11:15", "message": "Today, at the age of 93, Faruq al-Qaddumi (Abu Lutf), one of the founders of the Fatah movement and one of the movement's most prominent opponents of the Oslo Accords, died in Jordan."}, {"id": "33955d8a-4a43-4a0e-8f1d-ce77de859a68", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32878/", "date": "2024-08-22 11:11", "message": "The Palestinians report that the IDF activity in the Tulkarm refugee camp that began early in the morning continues.\nAs you will see in the attached videos explosive charges are activated against IDF bulldozers that are \"leveling\" the infrastructure in the camp."}, {"id": "de18c09a-0052-464e-ac60-9e9848e6fa39", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32877/", "date": "2024-08-22 11:06", "message": "The tension and fear of escalation are fraying the nerves of Lebanese citizens.\n\nThe Prime Minister of Lebanon issued a statement following this: I call on politicians and members of the media not to publish news and interpretations that cause panic among the Lebanese and heat up the atmosphere."}, {"id": "8a7a6db0-678a-477d-9a7b-fda7cda77a6e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32874/", "date": "2024-08-22 11:05", "message": "Posters praising the suicide bomber Jaafar Mana from the attack in Tel Aviv, were hung in Nablus, where he was from."}, {"id": "6a662302-5c5c-430a-b735-a565ac13b05b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32873/", "date": "2024-08-22 11:03", "message": "China calls on its citizens to urgently leave Lebanon."}, {"id": "bfd010e4-5930-42a9-99ec-d97cadc1a052", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32872/", "date": "2024-08-22 11:03", "message": "Wasim Al-Anbar, Muaweeya Haj Ahmed and Imad Shrim, killed in the IDF aircraft attack in Tulkarm this morning - before and after."}, {"id": "d9211b45-5647-43a2-bfbd-62245738dee0", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73808/", "date": "2024-08-22 08:33", "message": "The authorities in Iran have issued an official denial to the Fars news agency's report regarding the results of the investigation committee into the circumstances of the helicopter crash of the Iranian president, Raisi.\n\nThe Fars news agency removed the report as a result."}, {"id": "21292055-0026-4c3f-9392-b94f923f6286", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73808/", "date": "2024-08-22 08:32", "message": "The chairman of the PLO, Abu Mazen, published a presidential memorandum regarding the arrival together of the Palestinian leadership in Gaza in order to end the war, start the reconstruction of Gaza and end the internal Palestinian division under the umbrella of the PLO - \"the legal representative of the Palestinian people\"."}, {"id": "5d3c6ca3-8c3b-4334-b944-7c83e9afe757", "channel_id": 1560386984, "url": "", "date": "2024-08-22 08:31", "message": "IDF Spokesman:\n\nThe forces of Division 162 have eliminated about 50 terrorists in the Rafah area in the last day; An ammunition depot located near a Hamas military site that was previously used as a school in Gaza City was attacked from the air"}, {"id": "b40957b1-ffd8-4585-926e-e0295b0bb632", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73808/", "date": "2024-08-22 08:30", "message": "The military wing of the Islamic Jihad confirms that Jafar Mana of Nablus is the suicide bomber who carried out the attack in Tel Aviv, for which the military wing of Hamas and the Islamic Jihad accepted joint responsibility."}, {"id": "f816dcbe-6f9a-46a1-927d-4d4f8be0663b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32867/", "date": "2024-08-22 08:29", "message": "The Palestinian Ministry of Health in the West Bank:\n3 killed in a UAV attack in the activity of the Israeli army in Tulkarm.\n\n##\nPalestinian sources report that an Israeli aircraft attacked the building of the Qaqun Association in Tulkarm and there the three were killed."}, {"id": "82576af3-c6fe-46ce-b779-e1bd70dfdd7a", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73808/", "date": "2024-08-22 08:26", "message": "A video I found circularing this morning on an Iranian government propaganda channel...\n\nThe smile really got to them."}, {"id": "6670e54d-728e-4a32-a972-a308dcef56b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73808/", "date": "2024-08-22 08:25", "message": "More from the visit of President Putin 👆 to the mosque in Grozny, the capital of Chechnya, together with the president of Chechnya, Kadyrov:\n\nPutin kisses the Quran and \"gets\" to read part of verse number 17 of Surah al-Anfal:\n\nWhen you shoot, it is not you who shoots, but Allah who shoots...\n\nThis is a verse that is very popular among Muslims when launching rockets, missiles, etc...\n\nThanks to follower D for the video."}, {"id": "5634ee2d-3a9a-4cbc-95d6-49794960cc60", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73805/", "date": "2024-08-22 08:19", "message": "Iran: After winning the confidence of the parliament, the government of President-elect Masoud Pezeshkian held its first meeting."}, {"id": "8d71245c-1438-4985-b81c-d8aa713e3a72", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32860/", "date": "2024-08-22 08:18", "message": "The results of the IDF's activity in the Tulkarm refugee camp early in the morning."}, {"id": "521fd179-9a37-46c0-aea6-d959b8e3e48c", "channel_id": 1560386984, "url": "", "date": "2024-08-22 08:17", "message": "Palestinian sources: Israel informed the family members of Jafar Mana from the city of Nablus that their son was the one who carried out the suicide attack in Tel Aviv a few days ago."}, {"id": "bb3425ce-dc0f-4799-b29a-bb6b31f44ed2", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73808/", "date": "2024-08-22 08:16", "message": "Official Gaza channels, identified as Hamas, claim:\n\nIsraeli special forces, wearing the uniforms of the Palestinian Civil Defense in Gaza, killed Gazans and arrested others when they returned from the Rafah area."}, {"id": "1f34bf47-e788-4a76-a285-8796ad8b4eb5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32860/", "date": "2024-08-22 08:15", "message": "Trump on burning the American flag near the Democratic Party convention:\nIt is disgraceful to see the American flag on fire and the \"desecration\" of police vehicles. Congress needs to get to work so that anyone who burns the American flag gets a year in prison."}, {"id": "8e6f4d70-ea02-485e-bea2-0a28a62b6ade", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32856/", "date": "2024-08-22 08:13", "message": "Chicago: Outside the Democratic Party convention, a masked American, wearing a ribbon of the military arm of Hamas on his forehead, explains in English without a foreign accent, that he supports Hamas and its actions on October 7th while simultaneously attempting to deny most of the atrocities committed."}, {"id": "93cee641-b05c-4071-97d9-579b99e8107d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32855/", "date": "2024-08-22 08:09", "message": "US Central Command updates:\nThe American aircraft carrier Abraham Lincoln arrived in the Middle East."}]