[{"id": "b23ccd24-e327-4edc-b662-b68deb467431", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31748/", "date": "2024-08-03 23:19", "message": "Following the death of the perpetrators of the murder of Israeli civilian Amnon Mukhtar (which took place on June 22 in Qalqilya) today, and the news of their identities as Hamas members, the military wing of Hamas has officially claimed responsibility for the attack.\n\nThe attack was carried out by two members of Hamas's military wing: Jamal Abu Haniyeh and Ali Abu Baker, who were killed today in an IDF airstrike in Tulkarm 👆."}, {"id": "02d92f2a-ec6f-4136-ba82-099faf34ba10", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31747/", "date": "2024-08-03 23:14", "message": "The Iranian opposition mocks the regime's \"hollow threats\" to attack Israel."}, {"id": "6debaccc-01e5-4b93-93c0-ed5361ea4af4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31746/", "date": "2024-08-03 23:13", "message": "Various Iranian channels have decided to highlight the story of the famous Israeli spy Eli Cohen, who in the 1960's infiltrated deep into the Syrian government and was eventually caught.\n\nAccording to opposition sources, this is linked to the fact that Haniyeh's assassination required \"internal assistance,\" suggesting the depth of Israel's intelligence capabilities and its ability to have core members of the Iranian security system as assets."}, {"id": "2286d988-dc4d-4857-b44d-49cd6f9c4760", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31743/", "date": "2024-08-03 23:10", "message": "Palestinians in the West Bank city of Jenin managed to film the Iron Dome interceptions of the latest barrage of rockets launched from Lebanon towards northern Israel in the last hour."}, {"id": "536c1f77-820f-4f09-94bc-d2dd737bd73b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31742/", "date": "2024-08-03 23:08", "message": "Southern Lebanon:\n\nLebanese sources report a wave of four Israeli airstrikes and an additional drone strike on targets in the Kafr Kila area, near the border with Israel. There is extensive destruction in the area."}, {"id": "1570a98e-d9e4-41f0-9dbe-8bf22d53fa16", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31741/", "date": "2024-08-03 23:06", "message": "Hezbollah Announces Another Casualty in Its Ranks:\n\nHassan Karim, born in 2007 (a 17-year-old), was killed in an IDF attack earlier today 👆 in the village of Deir Seryan in southern Lebanon.\n\nNumber 390."}, {"id": "17cfb64e-3536-4a86-87e6-a3c29182c932", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31740/", "date": "2024-08-03 23:04", "message": "Hamas in an official announcement:\n\n\"We are holding consultations regarding the appointment of a new Chairman of the Political Bureau following the death of Ismail Haniyeh. We will announce the results of these consultations upon their conclusion.\""}, {"id": "bab23629-85de-4282-9071-f47a53fc9375", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31739/", "date": "2024-08-03 23:03", "message": "A popular screenshot this evening among Iranian tweeters and those affiliated with the IRGC shows countries that, as implied, will help Israel defend itself against the expected Iranian attack.\n\nAs you can imagine, quite a few of these accounts and channels are cursing the countries in question in their posts."}, {"id": "9b784fdc-2126-4a71-960c-0f64bd0d1925", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31738/", "date": "2024-08-03 18:32", "message": "Not trying to annoy Erdogan or anything... But this is the current medal count in Paris 2024."}, {"id": "6c215a6c-64db-416d-9bfb-6389322ce7e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31737/", "date": "2024-08-03 18:15", "message": "Footage of a waterspout, captured today off the coast of Saudi Arabia, in Jazan Province."}, {"id": "f0f23717-fcfd-4c43-8f67-044c507caae7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31736/", "date": "2024-08-03 18:13", "message": "Lebanese Druze leader Walid Jumblatt visited today the mourning tent set up in honor of Hezbollah's chief of staff, Fuad Shukr, following his assassination."}, {"id": "7cccf57c-8422-4a51-b9d1-b580f2613ea2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31735/", "date": "2024-08-03 18:11", "message": "The UK, US, and Russia have all issued additional travel warnings, advising all citizens currently in Lebanon to leave the country as soon as possible."}, {"id": "7bed364a-f363-4452-bc12-0c69e7536fc8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31734/", "date": "2024-08-03 17:05", "message": "And a different angle showing the attack on the Hamas command and control center in the Hamama school in Gaza City.\n\nAccording to Palestinian sources, the number of casualties has risen to 17."}, {"id": "42efcc0f-daa9-423b-b4da-6f96967fd152", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31733/", "date": "2024-08-03 17:03", "message": "Lebanese channels report that a 17-year-old was killed and six others were injured in an Israeli attack on Deir Seryan, located in the south of the country."}, {"id": "b2185c34-c8fd-4bcf-ac14-18e5d729f1ac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31732/", "date": "2024-08-03 17:02", "message": "The military wing of Hamas has released footage of several rockets being launched yesterday from Rafah towards the Sufa area as retaliation for the assassination of Haniyeh."}, {"id": "59fa37c4-542d-43da-977e-a47c27a2db81", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31731/", "date": "2024-08-03 17:01", "message": "More details on the assassination of Haniyeh\n\nAhmad Bakhshayesh Ardestani, a member of the Foreign Affairs and Defense Committee in the Iranian Parliament, stated: \"The Israelis fired a precision missile at Ismail Haniyeh's room from the 'Tushal Ski Club' area.\"\n\nThis place also has a park with benches, visited by locals for its nice view of Tehran.\n\nIn the attached picture, one of the benches at the 'Tushal Ski Club' is shown, with arrows indicating that aside from offering a nice view of the Iranian capital, the park also provided a nice view of the building where Haniyeh was staying..."}, {"id": "2c04b54f-03dc-418b-ad2b-404f88e19ab5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31730/", "date": "2024-08-03 16:49", "message": "Additional footage of the attack on the Hamas command and control center in the Hamama school in Gaza City has been released.\n\nAccording to Palestinian sources, the number of casualties has risen to 15."}, {"id": "e4a39b85-01f1-4303-a0f6-cf771aa7917a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31729/", "date": "2024-08-03 16:48", "message": "Palestinian sources report that two of the militants killed in today's drone strike in Tulkarm, Jamal Abu Haniyeh and Ali Khalil of the Islamic Jihad (residents of Qalqilya), are the ones who shot and killed Israeli civilian Amnon Mukhtar at close range in Qalqilya on June 22 👆."}, {"id": "1519db68-8ddf-4e56-a6c0-e0f0b629db62", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31726/", "date": "2024-08-03 16:45", "message": "The Palestinians report that after the first attack carried out by the IDF on the Hamas command and control center in the Hamama school in Gaza City, in which 10 Palestinians were killed, an evacuation warning was given.\n\nNow, the compound has been attacked with force for a second time."}, {"id": "9027f784-b40b-49dc-987f-48349e846c18", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72423/", "date": "2024-08-03 14:26", "message": "IDF: The IDF struck a Hamas command and control center that was used to manufacture weaponry and was previously known as the Hamama school compound in the northern Gaza Strip\n\nA short while ago, with the intelligence direction of the IDF and ISA, the IAF struck terrorists operating within a Hamas command and control center. In the past, the compound was known as the Hamama school in the northern Gaza Strip.\n\nThe compound was used as a hiding place for Hamas terrorists, and various terror attacks against IDF soldiers and the State of Israel were planned and carried out from there. \nAdditionally, Hamas weaponry was manufactured and stored within the compound, where terrorists were subsequently trained to use these weapons against the security forces and the State of Israel.\n\nPrior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of precise munitions, surveillance and additional intelligence. \n\nThe Hamas terrorist organization systematically violates international law by operating from within civilian infrastructure, brutally exploiting the civilian population and institutions as human shields for their terror activities."}, {"id": "4ab03f13-ab4b-4d60-8b8e-47e5687819de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31722/", "date": "2024-08-03 14:26", "message": "The Palestinians report ten deaths in the attack on the \"Hamama\" school in the Sheikh Radwan neighborhood in Gaza City a short time ago."}, {"id": "baedb2a2-ade5-49f4-b61c-ab8e9936dc28", "channel_id": 1560386984, "url": "", "date": "2024-08-03 14:02", "message": "The IDF spokesman reveals a document proving that Ismail al-Ghoul, who was arrested during the war by IDF forces at Shifa hospital, was released and killed last week, was a terrorist in Nukhba in Hamas:\n\nIDF: Exposed: A Hamas document from 2021 reveals the military involvement of Ismail Al-Ghoul, the Nukhba terrorist who was also a journalist for Al Jazeera\n\nAs revealed last week (Thursday), Ismail Al-Ghoul, who was eliminated on Wednesday, 31/07/24, was a Hamas Nukhba terrorist who took part in the October 7th massacre and worked as a journalist for the Al Jazeera channel for the past few months.\n\nRevealed is a document from 2021, found on Hamas computers seized in the Gaza Strip, which details a list of thousands of the organization’s military wing operatives. The document revealed that as of 2021, Al-Ghoul was an engineer in the Hamas Gaza Brigade. \n\nDespite the deceitful attempts by Hamas and Al Jazeera to portray Al-Ghoul as a decent journalist, Al-Ghoul was an active Hamas terrorist."}, {"id": "a8bc08fe-55eb-417a-9760-77e76e469a73", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31720/", "date": "2024-08-03 13:57", "message": "Collage: The nine terrorists who were killed today in the two airstrikes in Tulkarm."}, {"id": "34aae12d-406b-4ebb-ae2b-3699ce244c52", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31719/", "date": "2024-08-03 13:56", "message": "The body of Haytham Balbidi, the commander in the military wing of Hamas who was killed in the first attack this morning in Tulkarm, is not suitable for a funeral with his face visible as is customary. Only his beard..."}, {"id": "ace4b9c8-506b-46a5-b579-09bd96d93015", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31718/", "date": "2024-08-03 13:55", "message": "Hamas in an official announcement: three of the nine killed in Tulkarm are members of our military wing. The other six are also military operatives.\n\nThey are: \nHaytham Balbidi (Hamas)\nJamal Abu Haniyeh (Hamas)\nAli Abu Baker (Hamas)\nAbd al-Jabar a-Saba\nAhmed Mahajneh\nMuamen Musharqa\nTha'er Hamidi\nYazen Abu Daghish"}, {"id": "8df5505c-d032-400c-96c7-1d2d77bd0fb2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31717/", "date": "2024-08-03 13:53", "message": "Joint IDF and ISA announcement: \n\nIn an additional operation: the IDF eliminated a terrorist cell in an aerial strike as part of counterterrorism activity in the area of Tulkarm\n\nIn a joint IDF, ISA, and Israel Police counterterrorism activity, an additional terrorist cell was eliminated during an encounter with terrorists in Tulkarm. During the encounter, four terrorists were identified shooting at the security forces. With the intelligence direction of the ISA, IDF soldiers directed an IAF aircraft to strike and eliminate the terrorists."}, {"id": "7f90017a-9044-4a2c-b6ae-f825cc0e0ea4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31715/", "date": "2024-08-03 13:52", "message": "Following the attack in Tulkarm Palestinians tried to identify the 4 dead who are in the hands of the IDF based on the shoes that were left behind..."}, {"id": "19702e24-b2ad-49e3-a59b-69d13b8afffc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31714/", "date": "2024-08-03 13:49", "message": "Tulkarm: 4 Palestinians were killed in the second vehicle attack today in Tulkerem. Palestinian sources report that the 4 belong to the Islamic Jihad.\n\n###\nA total of 9 terrorists killed in Tulkarm in two car attacks since the morning hours."}, {"id": "630666b0-4be4-4c9c-a566-f397575f49d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31713/", "date": "2024-08-03 13:47", "message": "After the IDF spokesperson's announcement, Hezbollah admits to the first death in its ranks since the assassination of Fuad Shukr\n\nAli Abd el Ali\n\nKilled in the car attack this morning in Wadi Jilo 👆 in Tyre Governorate in South Lebanon.\n\nNumber 389"}, {"id": "065b6cbc-6cef-476b-9db7-47bcea9ed303", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31712/", "date": "2024-08-03 13:45", "message": "Anti-Israel demonstration in New York\n\nNote the intentional distortion of the numbers - they claim that Israel killed 186,000 Gazans in 300 days of fighting.\n\nThe official figure of the Palestinian Ministry of Health in Gaza is about 39,500 dead since the beginning of the war."}, {"id": "85aec253-44bc-4efd-85cc-32a7207e77a0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31711/", "date": "2024-08-03 13:44", "message": "Further to the report on the elimination of Ali Abd El Ali 👆👆\n\nIDF: Earlier this morning (Saturday), the IAF eliminated the terrorist Ali Nazih Abed Ali, a significant terrorist on the Hezbollah Southern Front, in the area of Bazouriyeh in southern Lebanon.\n\nAbed Ali was involved in the terror activity of the Southern Front, planning and carrying out various terror activities.\nAbed Ali's elimination represents a significant blow to the capabilities of the Southern Front and to the Hezbollah terrorist organization in the area."}, {"id": "73e4f20c-d6c4-4080-8c03-e56dedbbbe09", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31710/", "date": "2024-08-03 13:43", "message": "Tulkarm: As in the first attack this morning, IDF foot forces arrive at the area that was attacked from the air to verify the results.\n\nThis is how the results of the attack are guaranteed. Fantastic. A strong grip in the field."}, {"id": "6ec9baaa-20e9-45c9-aaba-b238872250e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31709/", "date": "2024-08-03 13:41", "message": "Joint IDF and ISA announcement:\n\nEarlier this morning (Saturday), the IAF, directed by ISA intelligence, struck five terrorists in a vehicle in the area of the town of Qaffin, who were on their way to carry out a terror attack."}, {"id": "5ec345aa-43d4-4f93-beac-d63d9c3ed17e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31708/", "date": "2024-08-03 12:37", "message": "The Israeli national anthem will be played at the Olympics.\nWhat an honor 🇮🇱"}, {"id": "f3a7a7c7-a498-42e3-9522-da00163f3314", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72414/", "date": "2024-08-03 12:34", "message": "Syrian sources: The person killed in the vehicle attack on road between Damascus - Beirut is a Syrian citizen."}, {"id": "07f37d80-f0de-496f-a9c2-441dafb9599c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31705/", "date": "2024-08-03 12:00", "message": "Syrian channels report one death in a vehicle attacked in the area of ​​al-Zabadani in Syrian territory on the road between Damascus and Beirut."}, {"id": "3f17e539-2b07-41aa-9635-0a20d12899eb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31704/", "date": "2024-08-03 11:43", "message": "The Iranian Revolutionary Guards in a proclamation regarding the assassination of Ismail Haniyeh:\n\nA short-range missile was launched into his room with a warhead weighing about 7 kilos, which caused a strong explosion.\n\nThe one who planned and carried out the assassination is the Zionist regime with the support of the USA.\n\n##\nThe meaning of the Iranian announcement is that Haniyeh was killed in an attack carried out from within the territory of Iran and not from the territory of another country.\nThe investigation by the Iranian Revolutionary Guards rules out the option of a planted explosive device in Haniyeh's room.\n\n###\nThe Zionists travel freely inside Iran and eliminate senior officials... according to the admission of the Iranian Revolutionary Guards...\n\n#يا_حسين\n#يا_علي"}, {"id": "3c303943-810a-4eaa-aa3a-39f02732182b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31703/", "date": "2024-08-03 11:07", "message": "Lebanese channels report casualties in the IDF attack in Tayrharfa in southern Lebanon about an hour ago."}, {"id": "0da57a26-74ba-445f-8bb1-7083d0904ca5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31702/", "date": "2024-08-03 11:06", "message": "The Iranian currency has lost about 10% of its value against the dollar since the assassination of Haniyeh.\n\nThe Iranian currency was traded this morning in the markets in Iran at a rate of 620 thousand Iranian Rials to one US dollar. \n\nOn the eve of Haniyeh's assassination, the exchange rate of the dollar in Iranian markets stood at 595,000 rials to one dollar."}, {"id": "b6f5641e-d196-4a42-b3f3-a2439722d5e0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31701/", "date": "2024-08-03 10:16", "message": "Against the background of preparations for a response against Israel, the stock market in Iran is red:\n97% of the shares of the companies in the Iranian stock exchange are trading down today."}, {"id": "f917fdcb-c1f8-42bd-bf7e-dfe62b7d619f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31700/", "date": "2024-08-03 09:47", "message": "At first glance this is reminiscent of Gaza...\n\nIn reality this is the Palestinian refugee camp al Yarmouk in Damascus (Syria) after the Shiite militias of Iran destroyed it in 2015...\n\nThe world has forgotten."}, {"id": "8f1f9c36-cf60-45b3-89d2-1b74dcc689c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31699/", "date": "2024-08-03 09:45", "message": "The operative who was killed in the Israeli attack in Wadi Jilo in southern Lebanon:\nAli Abd Elali.\n\nReally does look like his brother👆"}, {"id": "034d289c-41d3-4ca8-9ea1-057ae188dfc2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31698/", "date": "2024-08-03 09:38", "message": "Following Haniyeh's assassination, the Hamas movement opened an official home for mourners in... Baghdad, the capital of Iraq.\n\n##\nThis is another indication of the development of Hamas in Iraq after it opened an official office in the country for the first time in recent months."}, {"id": "ed563cbf-93bc-4f11-b106-7f7cbf01b495", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31697/", "date": "2024-08-03 09:38", "message": "Documentation from Milad's funeral in Tehran, complete with a military band and professional mourners."}, {"id": "9762d538-3e72-433d-8b6b-312ba87a88dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31694/", "date": "2024-08-03 09:27", "message": "This morning, the funeral of Milad Bedi, the Iranian adviser who was killed in the Israeli attack on the Dahiya in Beirut, was held in Tehran - the attack in which Hezbollah Chief of Staff Fuad Shukr was killed.\n\nHis body was transported from Lebanon on a horse to the Sayyidah Zaynab Temple in southern Damascus, where religious Shiite ceremonies were held and from there his body was flown to Tehran."}, {"id": "3e2ec3ad-d3f9-469e-9e40-15e7b3aac8f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31693/", "date": "2024-08-03 09:18", "message": "South Lebanon: the UAV attack 👆 in Wadi Jilo - one of the Hezbollah rescue team members who rushed to help the victims of the attack discovered that the person killed in the attack was his brother...\n\nThe Lebanese Ministry of Health confirms that there is one dead and two wounded in this attack."}, {"id": "5530962e-00fb-4283-b182-8573c3c27ecb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31690/", "date": "2024-08-03 09:16", "message": "South Lebanon: Casualties in an Israeli drone attack in the Wadi Jilo area in the Tyre governorate about an hour ago."}, {"id": "354ea1af-e8b1-4e94-af4e-8673023c2602", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31685/", "date": "2024-08-03 09:15", "message": "The bulldozers at work in the Tulkarm refugee camp."}, {"id": "fd615bb2-1efa-4123-a55c-c60c8ba87e3a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31682/", "date": "2024-08-03 08:26", "message": "Tulkarm is receiving special treatment today - bulldozers are on their way to the Tulkarm refugee camp."}, {"id": "dbab0590-2102-4dce-800d-5ddfe2dcf189", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31681/", "date": "2024-08-03 08:20", "message": "Trump: I agreed to debate Kamala Harris on September 4 on the Fox News channel in Pennsylvania."}, {"id": "d02c4694-6010-4a29-9e3e-bd92e0956523", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31680/", "date": "2024-08-03 08:20", "message": "Nasrallah is expected to give a speech on Tuesday at 17:00 at a ceremony marking the one-week anniversary of the assassination of Fuad Shukr.\n\n##\nHe must have felt that his last speech was weak and needed fixing."}, {"id": "7b90b7da-0051-471c-b3ac-cf99bb7c489f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31679/", "date": "2024-08-03 08:19", "message": "Yesterday a cargo flight of the Russian company Gelix was observed: an Ilyushin 76 cargo plane landed in Tehran, on its way from Moscow.\n\nThis is the first time that this Russian airline, which is used for the transfer of military cargo, has landed in Tehran."}, {"id": "660bd2d9-4bf3-496f-a5f7-2daaadae2644", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31678/", "date": "2024-08-03 07:37", "message": "This is what a Hezbollah-affiliated channel wrote this morning, explaining why Hezbollah must respond to the assassination of Fuad Shukr:\n\nFuad Shukr, Sayyid Mohsen, was de facto the most senior military commander in Hezbollah. Its Chief-of-Staff. He was one of the organization's founding members, and made Hezbollah what it is today.\n\nHe is Emad Mughniyeh (Hezbollah's Chief-of-Staff who was killed in Syria in 2008) and Mustafa Bader a-Din (head of Hezbollah's Foreign Affairs Division who was killed in Syria in 2015) in one man. He was the heart of Hezbollah."}, {"id": "e147b4b5-d1fb-4694-b1e4-37f2a49a9031", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31677/", "date": "2024-08-03 07:30", "message": "This is what the Fatah-affiliated channel wrote this morning:\n\nإيران لم تستطع إيجاد رئيسها المفقود «رئيسي»، ولا حماية «هنية» من الموت، ومع ذلك تجيد استخدام الشعارات الكبيرة، وهي تعلم أنها أضعف من أن تخوض حربًا مع إسرائيل، فتصنع حروبًا بالوكالة، لكن مع سقوط أدوات محورها المزعوم بانت سوءاتها، ولم يعد أمامها سوى الهجوم أو الانحسار.\n\nIran was unable to find its missing president, Raisi, (for two days -AA) nor protect Haniyeh from death. However, it is adept at using big slogans (talks and threatens a lot -AA), and it knows that it is too weak to wage war with Israel, so it creates proxy wars. However, with the fall of the tools of its alleged axis (the proxies -AA), its shortcomings became apparent, and it has no choice but to attack or retreat."}, {"id": "22eb5f6e-61f9-4871-bfc0-cb3caa122201", "channel_id": 1560386984, "url": "", "date": "2024-08-03 07:28", "message": "Increasing US presence in the Middle East and Persian Gulf\n\nLast night, the American Navy officially announced that the aircraft carrier Theodore Roosevelt (attached photos) arrived in the area of ​​activity of the Fifth Fleet, which includes the Persian Gulf, the Red Sea, the Gulf of Amman and part of the Indian Ocean.\n\nIn addition, the US Secretary of Defense reportedly instructed the aircraft carrier Abraham Lincoln to move towards the Middle East, this in addition to a squadron of US fighter jets that was ordered to arrive in the area along with the additional deployment and deployment of air defense systems.\n\nThe Americans seek to deter Iran and its proxies from wide-scale escalation, with the aim of stopping the region from sliding into an all-out war.\nMessages were sent to Iran that the US would not hesitate to attack if its forces were attacked.\n\nThe US is throwing its military weight into the Middle East following the assassination of Haniyeh and the assassination of Hezbollah's Chief of Staff."}, {"id": "5534e85e-b3ad-4544-8d8d-3d78a661ab5f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31672/", "date": "2024-08-03 07:24", "message": "The New York Times: Iran makes arrests among members of the Revolutionary Guards following the assassination of Haniyeh\n\nThe American newspaper The New York Times reports that the Iranian security forces arrested over 20 members of the security unit of the Iranian Revolutionary Guards due to suspicion of their involvement in the assassination of Haniyeh.\n\nAccording to the report, there is documentation on security cameras of those involved in the assassination, and some of them managed to escape from Iranian territory.\n\nIt was also reported that his assassination was originally planned to happen when Haniyeh arrived for the funeral of the President of Iran about two months ago but was postponed."}, {"id": "0b244aba-cb0e-4060-bdd2-ddcb5f6a4b35", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31671/", "date": "2024-08-03 07:23", "message": "Lebanese sources: another wave of Israeli attacks (Tuesday) early in the morning in the Syria-Lebanon border area\n\nLebanese sources report that around two in the morning, Israeli warplanes carried out a third wave of attacks (after last night's attacks at 21:00 and 23:30) in the Lebanon-Syria border area in northeastern Lebanon (Salhiya area).\n\n##\nIt is evident that Israel tried to thwart a significant shipment of weapons from Iran to Hezbollah and attacked both the airport, the trucks carrying the weapons and ammunition, and their pirate crossing point on the border between the countries."}]