[{"id": "9e136a23-ac3c-4f6e-86e9-e61d90c201c1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26948/", "date": "2024-05-09 07:00", "message": "IDF spokesman announces the death of an Israeli soldier, Haim Sabah, who was killed yesterday in an attack on northern Israel.\n\nMay his memory be a blessing."}, {"id": "7e49edf7-46da-4079-bc88-845a4701b1bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26944/", "date": "2024-05-09 06:59", "message": "Reports of an Israeli attack on a vehicle near the village of Bafliyeh in southern Lebanon. \n\nAccording to reports, three people were killed in the targeted strike."}, {"id": "8b8d7b97-031a-460a-867c-385f596199a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26942/", "date": "2024-05-09 06:58", "message": "Netherlands: The \"Gaza camp\" at the University of Amsterdam continues to pose a challenge to the Dutch police officers."}, {"id": "86a01463-b280-44c5-a2fc-5288318044ea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26941/", "date": "2024-05-09 06:34", "message": "Following the reports 👆 this morning on the movement of Gazans out of the Zeitoun neighborhood in the south of Gaza City:\n\nIDF spokesperson: IDF forces led by Division 99 began an operation in the Zeitoun area -\n\nIDF and Shin Bet officers launched an operation led by Division 99, in the Zeitoun area in the center of the Gaza Strip, to continue dismantling terrorist infrastructure and eliminating terrorists in the region.\n\nUnder intelligence guidance, the operation began with an aerial attack of approximately 25 terrorist targets. Among the targets were military buildings, attack tunnels, observation posts, sniper positions and other terrorist infrastructures.\n\nIn the combined coordination, the fighters of the Nahal Brigade's combat teams, 679 and 2 are working to clear the the Zeitoun area of any remaining threats.\n\nAttached is footage from the operation:  https://bit.ly/4b7dd2w"}, {"id": "97760cb4-67fc-42b3-a2aa-1f63f7300114", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb66355/", "date": "2024-05-09 05:58", "message": "A video published yesterday on social media and Palestinian channels:\n\nEgyptian policemen tackle a young Palestinian man who managed to cross the border from Rafah in the south of the Gaza Strip to the Egyptian side."}, {"id": "1cbf304c-f31b-4394-9da9-1bc73bf10d07", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26939/", "date": "2024-05-09 05:57", "message": "The Palestinians report on a large number of Gazan residents leaving the Zeitoun neighborhood area this morning, which is located in the south of Gaza City.\n\nThis movement appears to be a result of heavy artillery fire from the IDF and also due to a surprise advancement of Israeli forces from the direction of the Netzarim corridor towards the neighborhood in Gaza City (from south to north)."}, {"id": "7476895d-47b4-486d-a48b-3644e1e4282d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26936/", "date": "2024-05-09 05:54", "message": "An attack in Damascus early this morning\n\nThe Syrian Ministry of Defense announced that at 3:20 AM (local time - AA) Israel attacked a target in Damascus from the air. According to the report, only property was damaged.\n\nSources associated with the Shiite axis report that Israel attacked the \"cultural\" center of the Iraqi Shiite militia A-Najabaa' in the Sayyidah Zaynab area, a major Iranian stronghold located in the south of the city of Damascus.\n\nIn the attached photos - the ruins of the structure that was attacked."}, {"id": "160cef9d-af4b-48a3-8f72-7648c933e3a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26935/", "date": "2024-05-09 05:51", "message": "All the Arab, Palestinian and Iranian media quote Biden's remarks extensively:\n\n\"If Israel enters Rafah, we will not supply them with weapons, bombs and artillery shells.\"\n\n###\nBiden is tying Israel's hands and prevents it from defeating Hamas, abandoning Israel to its fate, and even announces so publicly.\n\nThis public announcement from the president of Israel's great ally, in his own words and voice, has devastating consequences for shaping the Middle East.\n\n1. First and foremost, Hamas will continue to harden positions in the negotiations. something that would make it difficult to end the war.\n\n2. Israel's enemies are seeing that Israel is left on its own. The next significant attack on Israel is being built right now. Biden gave the green light for this in such interviews.\n\n3. Other allies of the US in the Middle East will look at the US as a broken reed. Who would want an alliance with a country that abandons its most important ally in one of its most challenging moments and abandons it in front of the whole world? If I were the ruler of Saudi Arabia, I would reconsider my strategic relations and look for alternatives. And this isn't even the first time the US has done so - in recent years, the US has shown several times a despicable abandonment of its allies in the Middle East. Ask all the Afghani nationals that were running for their lives for fear of the Taliban, or Saudi Crown Prince Mohammed bin Salman on the reliability of America as an ally...\n\nBiden is speaking to his home audience, to the leaders of \"Gaza camps\" at universities in the US in order to win votes for the upcoming elections, all while leading to more violence in the Middle East in the long run."}, {"id": "573a9daf-f0b3-4878-9c3d-eed43c4f2a7b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26934/", "date": "2024-05-09 05:37", "message": "President Biden in an interview with CNN:\n\nI made it clear. If they go into Rafah, I will not suplly them with the weapons that were used in the past to deal with Rafah... to deal with other cities.\n\nWe will continue to ensure Israel is secure in terms of an \"Iron Dome\" and their ability to respond to attacks like (the one that - AA) came out of the Middle East recently.\n\nWe're going to supply the weapons and artillery shells...\n\n###\nLater in the interview, Biden publicly states: American weapons were used by Israel to kill civilians in Gaza."}]