[{"id": "b0e55b24-e381-4b7f-b7ab-2bf166833a22", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31985/", "date": "2024-08-06 19:32", "message": "A Gazan Facebook user responds to the appointment of Yahya Sinwar as the leader of Hamas:\n\n\"Come out, brother... come out... they chose you as the leader of the movement... for Allah's sake, come out... so we can congratulate you... just come out already.\""}, {"id": "fea0e218-17fc-4c56-850b-376ad7074fbf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31984/", "date": "2024-08-06 19:31", "message": "The IDF conducted a strike on a Hezbollah weapons depot in Kafr Kila in southern Lebanon this evening, as Nasrallah was delivering his speech."}, {"id": "741bb75f-4811-4f79-b620-367d558980e2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31983/", "date": "2024-08-06 19:29", "message": "Central Gaza Strip: Israeli fighter jets carried out three strikes on buildings belonging to the Muslem, Muslih, and Hasanat families in Deir al-Balah.\n\nPalestinians report casualties from shrapnel as far as 800 meters from the strike area."}, {"id": "27b6a217-0597-4bdd-837b-7cae0af375e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31982/", "date": "2024-08-06 19:27", "message": "Palestinian Sources:\n\nYahya Sinwar was unanimously elected by the members of Hamas's Political Bureau. He is authorized to appoint his own deputy independently, provided that the deputy is a member of Hamas's Shura Council."}, {"id": "0e34a5cd-3790-4d9f-8cc0-34d1231a7f72", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31981/", "date": "2024-08-06 19:15", "message": "Gazans celebrate in the launch of rockets at the Israeli city of Ashkelon tonight."}, {"id": "89db30a1-3939-47b4-aa11-3ba77503c201", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31980/", "date": "2024-08-06 18:42", "message": "Farewell wishes to the new leader of Hamas..."}, {"id": "76756334-42d8-4ce6-8ffa-5a0cac1f64e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31979/", "date": "2024-08-06 18:37", "message": "Hamas, in an official announcement: Yahya Sinwar replaces Ismail Haniyeh as the leader of Hamas.\n\n##\nThis means that Israel can now target the movement's leader without the additional complications of involving foreign countries."}, {"id": "42640629-43a3-4819-ab60-798e0d2bfe89", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31977/", "date": "2024-08-06 18:31", "message": "Ali Naeini, Spokesman for the Iranian Revolutionary Guards, Echoes Nasrallah:\n\n\"All the occupied territories (Israel - AA) are burning. The Zionists don't know what awaits them, and fear surrounds them. The Zionists do not know when the response will come, at what hour, on what day, in what week, and what the nature of the response will be...\""}, {"id": "42c45229-0f12-4183-8a9e-ec0aa36d8405", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/hezbollah-announces-the-sixth-death-in-its-ranks-for-today/", "date": "2024-08-06 17:12", "message": "Hezbollah announces the sixth death in its ranks for today:\n\nMohammad Taleb.\n\nHe was killed in an IDF attack earlier 👆today between Rab el Thalathine and Aladissa.\n\nNumber 400!"}, {"id": "87e74d0d-bb60-47e0-aea6-f97fac7e95cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/so-what-is-israels-right-move-in-the-face-of-nasrallahs-speech-now/", "date": "2024-08-06 17:09", "message": "So what is Israel's right move in the face of Nasrallah's speech now?\nIn his speech, Nasrallah clearly stated that there would be a response and also stated that Israel's expectation of a response and the tension that expectation creates are part of the response.\nNasrallah expects, as in similar cases in the past, that Israel will \"wait for revenge.\"\n\nWhat Nasrallah missed this time, and I hope the Israeli captains will not miss, is the fact that Israel is now, anyway, at war with Hezbollah.\n\nThis is not the same situation that existed here about two years ago after the elimination of a Hezbollah operative in Syria, where Israel \"stood on its feet\" in anticipation of Nasrallah's response with fear of entering into a against Hezbollah.\nWe are already deep inside...\nWhat Israel needs to do is very simple: keep attacking and attacking and attacking, even outside the rules of the game.\nOne way or another, Hezbollah plans to respond strongly, it's on the same account of the revenge... You just have to \"load\" more \"revenge\" on the same open account. There's no point in waiting.... It's true in terms of message, it's true militarily and it's certainly true in terms of national morale."}, {"id": "b2593f1e-4ced-497f-9e19-6c91fd9674de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/a-couple-amusing-points-around-nasrallahs-speech/", "date": "2024-08-06 16:41", "message": "A couple amusing points around Nasrallah's speech:\n\n1. Before the speech, Fuad Shukr's son, with a youthful moustache, took the stage to deliver a short speech as is customary in the case of assassinations of senior Hezbollah officials of this magnitude.\n\n2. Also present at the speech was a senior Hezbollah official Wafiq Safa, responsible for liaison and coordination in Hezbollah (circled in red). After the Israeli attack in which 5 Hezbollah operatives were killed today in the village of Mayfadoun, rumors circulated that Safa was among those killed. His physical presence at the event filmed in Dahieh fueled the rumors."}, {"id": "0c655037-9ab3-4080-9ea4-4c9dd891bb9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/hezbollahs-fifth-death-since-this-morning/", "date": "2024-08-06 16:16", "message": "Hezbollah's fifth death since this morning:\n\nAdham Nasser.\nHe was also killed in an attack in Mayfadoun 👆 which turns out to be particularly successful (5 of the 5 dead are Hezbollah operatives).\n\nNumber 399"}, {"id": "d7659d3c-bedf-4d7d-9801-001e61c9eae5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/amin-bader-a-din-red-circle-with-uncle-mustafa-bader-a-din-on-the-right/", "date": "2024-08-06 16:15", "message": "Amin Bader a-Din (red circle) with uncle Mustafa Bader a-Din (on the right)"}, {"id": "b3f76580-6944-4027-bc03-876804b73fab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/before-nasrallahs-speech-hezbollah-announces-three-more-deaths-in-its-ranks-four-as-of-this-morning/", "date": "2024-08-06 16:14", "message": "Before Nasrallah's speech, Hezbollah announces three more deaths in its ranks (four as of this morning):\n\nHossein Yassin\nAli Shams A-Din\nAmin Bader a-Din (Nickname: Zulfiqar)\n\nLike the first person killed this morning, all three were also killed in an IDF attack in Mayfadoun in southern Lebanon 👆\n\nAmin Badr al-Din he is the nephew of the senior Mustafa Bader al-Din, who served as the head of Hezbollah's foreign affairs apparatus and was killed in 2016 in Syria.\nThe IDF spokesman hinted in Arabic at the time that this was an internal assassination of Hezbollah. In Lebanon, Mustafa is credited with the assassination of the then prime minister of Lebanon, Rafic al-Hariri, in 2005.\n\n398 dead for Hezbollah since the beginning of the war."}, {"id": "e77f1d1f-f1a1-46b2-9f6a-55d605d1076c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/to-sum-up-his-long-speech-in-a-sentence/", "date": "2024-08-06 16:10", "message": "To sum up his long speech in a sentence:\n\nDear Israelis, there will be a response, keep waiting and I will keep playing with your mind.\n\n##\nThe Art of Psychological Warfare by H.N."}, {"id": "6986ad2c-fcef-4f8c-bd43-c636eed8359a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-concludes/", "date": "2024-08-06 16:09", "message": "Nasrallah concludes:\n\nOur reaction is on the way - may be separately or may be together with the entire axis of resistance.\n\nWe did not escalate the campaign for ten months. But an attack in Dahieh is not the same. Israel is the one that escalated. It is not possible for us to be required to treat an attack in Dahieh like a normal attack.\nThe response is on the way. We will wait for the field."}, {"id": "e4e3d6a5-55b5-47d9-9c11-ba8b1acadcd1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-14/", "date": "2024-08-06 16:08", "message": "Nasrallah:\n\nOur goal is to stop the aggression on Gaza.\nThe Americans who say they will stop the war cannot be trusted."}, {"id": "37c17675-2430-438e-915e-df23183c9e23", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-13/", "date": "2024-08-06 16:08", "message": "Nasrallah:\n\nIf Netanyahu wanted a war with Lebanon, he would have already started it.\n\nAn Iron Dome missile landed today on the main road near Nahariya and injured 19.\n\nThe mayor of Nahariya initially said that Hezbollah attacked Nahariya... and the IDF spokesman announced that it was an Iron Dome missile.\n\nAnd what happened in Majdal Shams?\nThe IDF spokesman did not tell them the truth as he told the mayor of Nahariya."}, {"id": "b7466cfd-6d9b-4f56-981a-ed66edc7bfdc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-12/", "date": "2024-08-06 15:42", "message": "Nasrallah:\n\nHezbollah will respond to the elimination of Fuad.\nIran will respond to the elimination of Haniyeh.\nThe enemy now has to wait.\nThe Israeli expectation (for a response) \"on a foot and a quarter\" (not a foot and a half as the expression usually goes -AA) for a week is part of the reaction and part of the punishment. It's part of the war. Psychological warfare is part of the campaign.\n\nThis time, all of Israel from north to south is waiting for a response. Standing on a foot and a quarter.\n\nNasrallah lists types of targets that could be targets for Hezbollah: \nThere are high-value economic enterprises in Israel - which can be destroyed in half an hour."}, {"id": "be5358c2-a8fb-447f-b0cc-1b56bf604ca4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-11/", "date": "2024-08-06 15:34", "message": "Nasrallah:\n\nCalls on the Lebanese who don't want to join the war to at least not stab the resistance in Lebanon in the back (in this context he notes the fabricated evacuation warnings by the Lebanese against the residents of Dahieh and the joy of some of the Arab media when Hezbollah operatives and commanders are killed).\n\nYou must fear the victory of Israel and not the victory of the resistance in Lebanon."}, {"id": "08d58cd0-34e7-4edd-a07d-2e37e6512b2c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-10/", "date": "2024-08-06 15:28", "message": "Nasrallah:\n\nWe call on the fighting areas that support Gaza to continue their operations despite the losses.\n\nWe do not require Syria to join the campaign due to the special security situation in Syria.\n\nWe also did not ask Iran to join (beyond their reactions to the assassinations)."}, {"id": "130d5101-55b8-4733-bec9-848d765adaa2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-9/", "date": "2024-08-06 15:22", "message": "Nasrallah:\n\nThe purpose of this war is to prevent Israel from eliminating the Palestinian resistance and the Palestinian issue.\nThe goal is not to eliminate Israel at this stage. But only to prevent the elimination of the Palestinian resistance. It is the duty of every person."}, {"id": "7ee103ee-ae4e-4b01-bd86-ff13647a8434", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-8/", "date": "2024-08-06 15:21", "message": "Nasrallah:\n\nDespite all of Israel's preparations and high alert in the north today - Hezbollah's UAVs managed to reach Acre.\n\nIf we assume the resistance will lose in Gaza or Lebanon - al-Aqsa Mosque and all the holy places will be in danger. Palestine will be in danger. Jordan will be in danger. Syria will be in danger. Egypt will also be in danger and all the countries of the region. Israel will endanger everyone."}, {"id": "822688a4-2252-4dd2-9a99-b461cc8ea1dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-7/", "date": "2024-08-06 15:19", "message": "Nasrallah:\n\nThere is no future for agreements with Israel.\n\nSmotrich says there is no problem with starving two million Gazans until the abductees are returned.\nThey made him in charge of the Bank. He works to expand the settlements, expel the Palestinians and annex the West Bank.\n\nTrump recognized Golan.\n\nThe Israeli says: My Golan. My bank from the sea to the river. My Shebaa Farms.\n\nThey absolutely refuse to recognize a Palestinian state. They refuse the rights of the Palestinians, the return of the refugees.\n\nThe Americans continue to support Israel despite this. They provide her with weapons.\nNow the Americans are helping them defend against the Iranian reaction. Israel is the one that started the aggression."}, {"id": "84a5f08c-0be0-42b7-a56f-6e5be0707982", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-6/", "date": "2024-08-06 15:00", "message": "Nasrallah:\n\nFoad Shukr always had solutions. For all problems.\nIt was not one mountain but a chain of mountains.\nHis death is a very big loss for us, but we will not stop and will rest our hands.\n\nWe continue on the battlefield as you can see.\n\nThe death of Ismail Haniyeh is also a great loss for Hamas, the Palestinian people and the axis of resistance, but this will not weaken them."}, {"id": "f563a16d-a034-4178-978d-0699ba67cd49", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-5/", "date": "2024-08-06 14:59", "message": "Nasrallah:\n\nI had a personal relationship with Fuad Shukr (Hezbollah Chief of Staff who was killed a week ago in Dahieh -AA).\n\nEveryone in Hezbollah knows my relationship with him and its depth.\n\nHe is from the generation of founders and he is among the founders of Hezbollah in practice. He assisted in building Hezbollah's capabilities since the beginning.\n\nFrom the first day of the war until the day he was killed, we would talk every day at 18:00 (even on the last day of his life).\n\nFuad was a strategist, smart, farsighted, could talk for hours without a page in front of him. Educated generations of Hezbollah operatives."}, {"id": "e09d4d49-0066-400b-8d1f-c68ec273d124", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallahs-speech-is-underway/", "date": "2024-08-06 14:43", "message": "Nasrallah's speech is underway.\nHe refers to the Air Force's activity now in the skies of Beirut (breaking the sound barrier) - \"The enemy is celebrating because of the event (a week for the elimination of Fuad Shukr)\"."}, {"id": "8b3ac44e-705e-4ba9-9f09-b7c01ee6a684", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/lebanon-118/", "date": "2024-08-06 14:43", "message": "Lebanon:\n\nMany Lebanese media outlets are reporting on Israeli fighter jets breaking the speed of sound again and again about twenty minutes ago over the skies of Dahieh in Beirut.\n\nAccording to some sources, these sound-barrier breaking flights are the strongest since the beginning of the war."}, {"id": "c626696c-5f44-411f-a375-b8fb14f7efd4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/hezbollah-will-definitely-celebrate-this-and-nasrallah-is-adding-this-to-the-draft-of-todays-speech/", "date": "2024-08-06 13:13", "message": "Hezbollah will definitely celebrate this and Nasrallah is adding this to the draft of today's speech..."}, {"id": "553ced3e-35c1-4c4d-be64-43fd26c6129b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/idf-spokesperson-following-the-report-earlier-today-regarding-a-fallen-hostile-aircraft-on-route-4-to-the-south-of-nahariya-an-initial-inquiry-indicates-that-an-interceptor-missed-the-target-and/", "date": "2024-08-06 13:12", "message": "IDF Spokesperson: Following the report earlier today regarding a fallen hostile aircraft on route 4 to the south of Nahariya, an initial inquiry indicates that an interceptor missed the target and hit the ground, injuring several civilians. The incident is under review."}, {"id": "bbdf627a-38a2-459a-a756-b0aac5741c61", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/senior-hamas-official-izzat-al-risheq/", "date": "2024-08-06 12:35", "message": "Senior Hamas official Izzat al-Risheq:\n\nWhat is published in some of the media and social networks regarding the appointment of a replacement for the leadership of the Hamas movement is not true.\nThe movement will announce the results of its consultations on the subject upon completion."}, {"id": "6a292d01-bce0-4c54-9d69-dd6bc43af7d1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/palestinian-medical-sources-report-3-dead-and-2-wounded-during-the-siege-of-a-building-in-kfar-qud-in-the-jenin-governorate/", "date": "2024-08-06 12:34", "message": "Palestinian medical sources report 3 dead and 2 wounded during the siege of a building in Kfar Qud in the Jenin governorate.\n\nThis increases the number of \"martyrs\" in the West Bank since last night to 13."}, {"id": "609519ba-45ed-4107-b72c-49242e392765", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/the-islamic-jihad-publishes-a-proclamation-in-which-it-mourns-10-new-martyrs-in-the-west-bank-in-less-than-a-day/", "date": "2024-08-06 12:33", "message": "The Islamic Jihad publishes a proclamation in which it mourns 10 \"new martyrs\" in the West Bank in less than a day:\n\n4 in Tubas overnight (including two Islamic Jihad operatives)\n\n5 in a drone attack in Jenin this morning\n\n1 who carried out the stabbing attack at the Tunnels checkpoint today"}, {"id": "d26f1e42-1cff-4e39-879e-805a9b04e87f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/hezbollah-announces-a-death-in-its-ranks-3/", "date": "2024-08-06 12:32", "message": "Hezbollah announces a death in its ranks.\n\nHassan Mansour from the village of Jibchit.\n\nHe was killed in an IDF attack this morning on the village of Mayfadoun in southern Lebanon.\n\nNumber 395"}, {"id": "20731249-be0d-452e-85e1-cab26ed69601", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/unofficial-lebanese-channels-report-one-dead-and-one-wounded-as-a-result-of-an-idf-attack-in-the-rab-el-thalathine-and-aladissa-area-in-southern-lebanon/", "date": "2024-08-06 12:29", "message": "Unofficial Lebanese channels report one dead and one wounded as a result of an IDF attack in the Rab El Thalathine and Aladissa area in southern Lebanon."}, {"id": "ff8a329f-2ce6-43fd-ab09-37e9c1e7d6f2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/jenin-yesterday-palestinian-kids-try-to-shoot-down-an-idf-drone-using-stones/", "date": "2024-08-06 11:02", "message": "Jenin, yesterday: Palestinian kids try to shoot down an IDF drone using stones."}, {"id": "8d60c19d-7ea8-46dc-8dd5-04c01115762f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/the-lebanese-ministry-of-health-2/", "date": "2024-08-06 10:59", "message": "The Lebanese Ministry of Health:\nThe death toll in the Israeli attack in Mayfadoun in southern Lebanon rose to 5."}, {"id": "4e83dd06-56a8-4b04-acd0-4b9c96b2e5df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/idf-spokesperson-following-the-sirens-that-sounded-over-the-past-hour-in-northern-israel-a-number-of-hostile-uavs-were-identified-crossing-from-lebanon-one-of-the-uavs-was-intercepted-several-civi/", "date": "2024-08-06 10:58", "message": "IDF Spokesperson: Following the sirens that sounded over the past hour in northern Israel, a number of hostile UAVs were identified crossing from Lebanon. One of the UAVs was intercepted. Several civilians were injured to the south of Nahariya during the incident.\n\nRocket and missile sirens were sounded following the possibility of falling shrapnel from the interception. \n\nFollowing the siren that sounded at 12:56 in the area of Acre, it was determined to be a false identification."}, {"id": "c685f74c-fb52-4161-93ba-4e555bdcfc1e", "channel_id": 1560386984, "url": "", "date": "2024-08-06 10:54", "message": "Jenin immediately after the attack this morning: Palestinian women filming and wailing in the background.\n\n##\nJenin tastes a little of the flavors of Gaza today."}, {"id": "447d6011-99d0-4258-b5be-7735fd4e159a", "channel_id": 1560386984, "url": "", "date": "2024-08-06 10:53", "message": "Jenin, today, after the IDF bulldozer activity.\n\nAnother level of bulldozer control... where do you get such training?"}, {"id": "8d684a41-8bf1-432c-908c-3aa89098b4b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/the-palestinians-are-documenting-the-destruction-left-behind-by-idf-forces-in-eastern-jenin/", "date": "2024-08-06 10:49", "message": "The Palestinians are documenting the destruction left behind by IDF forces in eastern Jenin."}, {"id": "63dcd5da-71ea-4a36-be5a-c6505d1dd852", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/magen-david-adom-reports-two-wounded-as-a-result-of-a-hezbollah-attack-one-in-serious-condition-and-one-in-mild-to-moderate-condition/", "date": "2024-08-06 10:48", "message": "Magen David Adom reports two wounded as a result of a Hezbollah attack - one in serious condition and one in mild to moderate condition."}, {"id": "e497b0d3-b8c0-4cac-9c76-725c5195f405", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/hezbollah-in-an-official-announcement-4/", "date": "2024-08-06 10:48", "message": "Hezbollah in an official announcement:\nWe attacked the Shraga base north of Acre using suicide drones in response to yesterday's assassination near Jibchit 👆"}, {"id": "f8531944-55b5-444a-9ed5-4fa1ada35cd1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/the-lebanese-ministry-of-health/", "date": "2024-08-06 08:27", "message": "The Lebanese Ministry of Health:\n4 killed in the IDF attack in the village of Mayfadoun 👆 in southern Lebanon."}, {"id": "d57967e4-7096-4d77-8204-4cea98d041e1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/al-jazeera-4-dead-so-far-in-the-israeli-uav-attack-in-eastern-jenin-this-morning/", "date": "2024-08-06 08:26", "message": "Al Jazeera: 4 dead so far in the Israeli UAV attack in eastern Jenin this morning."}, {"id": "a2a543b3-429f-4f11-9cc0-b4f4849c6a46", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/hamas-is-trying-to-advocate-for-the-egyptians-in-the-issue-of-the-tunnels-in-the-philadelphi-axis/", "date": "2024-08-06 07:56", "message": "Hamas is trying to advocate for the Egyptians in the issue of the tunnels in the Philadelphi axis\n\nA senior official in the Hamas Interior Ministry tells the Al-Aqsa Network that the tunnel 👆 that was discovered in Rafah (at a height of 3 meters) is one of the \"commercial vehicle tunnels of 2011\" and is partially destroyed and has not been used since it was bombed in 2014."}, {"id": "fdb696ba-2beb-430a-a6be-14cafe568057", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/south-lebanon-lebanese-channels-report-casualties-in-an-idf-attack-in-the-village-of-mayfadoun-in-the-nabatieh-region/", "date": "2024-08-06 07:39", "message": "South Lebanon: Lebanese channels report casualties in an IDF attack in the village of Mayfadoun in the Nabatieh region."}, {"id": "78ab7ca1-0e61-42e1-80b9-759f206a4c3d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/another-death-in-the-drone-attack-in-east-jenin/", "date": "2024-08-06 07:38", "message": "Another death in the drone attack in East Jenin:\nAyham al Jaber Kafauna.... He must have been knitting sweaters for the elderly in his spare time."}, {"id": "a5e01952-9b7e-4029-ae83-a7e8680f6f9f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/karim-khan-prosecutor-general-of-the-criminal-court-in-the-hague/", "date": "2024-08-06 07:35", "message": "Karim Khan, Prosecutor General of the Criminal Court in The Hague:\nWe will not continue with the completion of the process of issuing arrest warrants for Ismail Haniyeh and Mohammad Deif after they have been killed."}, {"id": "d204e9f6-0df0-43d9-abb7-50fe4fe569fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/ahmed-hassam-al-saadi-18-years-old-who-was-apparently-killed-in-the-drone-attack-in-eastern-jenin-was-according-to-the-palestinians-a-volunteer-medic/", "date": "2024-08-06 07:34", "message": "Ahmed Hassam al-Saadi, 18 years old, who was apparently killed in the drone attack in eastern Jenin, was, according to the Palestinians, a volunteer medic.\n\nIt turns out that he had other hobbies..."}, {"id": "86b52444-87f1-4ed0-9739-fc8d290848c6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/unofficial-palestinian-sources-in-jenin-report-that-ahmed-hassam-al-saadi-who-was-wounded-in-the-drone-attack-in-eastern-jenin-a-short-time-ago-died-of-his-wounds/", "date": "2024-08-06 07:32", "message": "Unofficial Palestinian sources in Jenin report that Ahmed Hassam al-Saadi, who was wounded in the drone attack in eastern Jenin a short time ago - died of his wounds."}, {"id": "d5e5f283-d16b-4073-8f95-3a8917407bb9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/the-palestinians-report-a-serious-injury-in-an-israeli-uav-attack-on-a-vehicle-in-eastern-jenin-a-short-time-ago/", "date": "2024-08-06 07:32", "message": "The Palestinians report a serious injury in an Israeli UAV attack on a vehicle in eastern Jenin a short time ago."}, {"id": "686802d3-272c-4758-bcce-44e064512777", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31919/", "date": "2024-08-06 07:32", "message": "Abu Khader of Deir al-Balah is also \"disturbed\" that the Iranian response is delayed:\n\n\"Khomeini stated that Netanyahu would not be able to sleep even one night (because of the response) and so wouldn't Israel...\nAnd here... he (Netanyahu) is sleeping until now...\nWake him up... wake him up... he's still sleeping now\""}, {"id": "bbbdd930-eaa9-4dfd-995f-8a43769b83c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72661/", "date": "2024-08-06 05:57", "message": "Today at 17:00 Nasrallah will deliver a speech marking the one week anniversary of the assassination of Hezbollah Chief of Staff Fuad Shukr.\n\nHis supporters expect that hints will be given regarding the timing of the response.\n\nIt can be assumed that Hezbollah's response to the assassination of Shukr will be separate from the Iranian one to the death of Haniyeh - to \"respect\" each of the assassinated separately, but it can be also assumed that there is significant cooperation and coordination on the matter between Iran and Hezbollah."}, {"id": "bf4bc387-f80a-4a5c-9d1a-a8bc5dee3b0a", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72661/", "date": "2024-08-06 05:53", "message": "Against the backdrop of yesterday's return of 80 bodies of Gazans to the Gaza Strip, the Hamas Information Bureau is demanding the establishment of an international committee to investigate the \"kidnapping of the bodies\".\n\n##\nWill this committee be investigating the kidnapping of bodies to Gaza on October 7th and the holding of them since?\n\nTheater of the Absurd..."}, {"id": "1bd00b2f-84ab-4cb1-a49f-d34ab6639a18", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72651/", "date": "2024-08-06 05:48", "message": "PA chairman Abu Mazen, in an interview with Russian media ahead of an expected visit to Moscow on August 12-14:\n\nI condemn the killing of Ismail Haniyeh.\n\nThe purpose of the assassination was to delay the arrival of a cease-fire agreement in Gaza.\n\nThe government in Gaza should be under the umbrella of the PLO and under the Palestinian government."}, {"id": "6dca3e97-4b93-4269-b646-82f0e3c203a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31914/", "date": "2024-08-06 05:46", "message": "In Jenin, the IDF's anti-terrorism activity continues since yesterday afternoon.\nIDF bulldozers are clearing the roads in Jenin of burried IEDs. Explosives are occasionally fired at the bulldozers."}, {"id": "138881a2-0f58-4b42-9aa3-2756d19d4e85", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31910/", "date": "2024-08-06 05:45", "message": "The Palestinians report 4 dead and 7 wounded in the IDF's activity tonight in Tubas in northeastern Samaria.\n\nAll four (including a 14-year-old boy) are referred to as \"A-Shaheed Al-Majahad\" (\"The Fighting Martyr\") in posters distributed on social networks. A title reserved by the Palestinians for military operatives.\nAt least one of the dead (Amid Aghnam of the Islamic Jihad) was inside a building surrounded by IDF forces in Tubas tonight."}, {"id": "85988288-ca84-4af8-9cac-6bb4e0bb83d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72651/", "date": "2024-08-06 05:43", "message": "If there are dead soldiers, the Biden administration will be in a difficult position. According to the experience of the (not so distant) past, a dead American soldier equals a significant American attack in the region. At the current time - when there are high tensions with Iran and Hezbollah due to the assassinations attributed to Israel, the Biden administration will find itself between a rock and a hard place - on the one hand, it will be obligated to respond, but on the other hand, he is very interested in reducing regional tensions.\n\nWe will wait for the official American announcement about the results of the attack by militias loyal to Iran in Iraq on the Ain Al Asad base."}, {"id": "b21bdef2-7f5a-481b-8a19-84c4ceb42cef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31905/", "date": "2024-08-06 05:43", "message": "Reuters: At least five American soldiers were injured in the rocket attack in Iraq\n\nA significant event at the current time - senior American officials report to Reuters that at least five American soldiers were injured as a result of the rocket fire by the Shiite militias in Iraq at the American base in Ain Al-Asad.\nThe event comes in the background of the American attack last week on a base of the Al-Hashd al-Sha'abi Shiite organization in Babil district in which at least five were killed, including a senior Houthi officer who specializes in the field of UAVs.\n\nAccording to other sources, it is possible that there are deaths among the American soldiers or that the number of wounded is higher - there is no verification of this at this stage."}, {"id": "597e86f8-780b-48c4-862d-c144c44fbfe6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31900/", "date": "2024-08-06 05:37", "message": "Sources associated with the Iranian opposition claim:\nThe explosions that were reported this evening in the province of Isfahan, happened at an Iranian missile base, which also has an underground system.\nThe area is near the \"Shaheed and Tanfur\" air base in the south of Isfahan province."}]