[{"id": "7b2e1353-efd4-4741-955a-298aaa88e318", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32375/", "date": "2024-08-13 19:54", "message": "To comment, follow this link"}, {"id": "a944bfb7-6ba7-470c-af63-cf5d525505d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32374/", "date": "2024-08-13 19:39", "message": "Lebanese sources: IDF fires white phosphorus shells in the area of Hunin in southern lebanon."}, {"id": "6c155a4a-a49f-41ae-b146-85ce08f7ee5e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32373/", "date": "2024-08-13 19:01", "message": "Lebanese sources: The IDF attacked Kfarkela in southern Lebanon with three bunker-penetrating bombs a short while ago."}, {"id": "841323f4-faf2-4669-9ce7-ec82fc2a94a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32372/", "date": "2024-08-13 18:49", "message": "Ukrainian military advances into Russian territory\n\nToday, the President of Ukraine declared: We now control 72 settlements in the Kursk region of Russia.\n\nThe blue area on the map (representing the territory captured by the Ukrainians within Russia) has steadily increased.\n\nMeanwhile, Putin spent three hours today engaged in discussions with PA President Mahmoud Abbas..."}, {"id": "c6943845-3224-43ca-b98c-4fd48495effd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32371/", "date": "2024-08-13 18:48", "message": "\"Evacuation Is the Most Lethal Weapon Used Against Us\"\n\nThis is how a Gazan social media user described the situation yesterday:\n\nEverything happening in the war is painful and difficult, but the most painful thing is the evacuation - leaving behind our homes, all the memories, the furniture, the walls... We said it’s not a big deal and took only a few belongings with us. \n\nThe tent doesn't protect us from the summer heat, the winter cold, or the rain. We’ve been forced to become refugees and now live each day as if we are migrating a thousand times over. \n\nWe are moved around like pieces on a chessboard - move east, west, north, south... The search for fresh water, salty water, a place to charge our phones, food distribution points, gas suppliers, and aid coordinators. \n\nEvacuation is the most lethal weapon used against us, and the situation continues to drag on...\""}, {"id": "02e8eb6e-7290-47eb-9276-ef563ae50b72", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32369/", "date": "2024-08-13 18:45", "message": "The IDF spokesman in Arabic publishes an evacuation notice for the Bani Suhila area in eastern Khan Yunis following today's rocket fire towards Tel Aviv which originated from that area.\n\nThis is an area that has already been cleared."}, {"id": "fd8a6876-2465-4fef-a06e-83b7c3951072", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32368/", "date": "2024-08-13 17:54", "message": "Gaza sources: Israel killed Maher Abu Ghaliba (Abu al-Abed), the commander of the Tawhid Brigade (Salafis).\n\nAccording to these sources, he was killed in an attack on his home last Friday in Deir al-Balah in the center of the Gaza Strip.\n\nThe Tawhid Brigade is a Salafi faction aligned with ISIS that withdrew from the military wing of the Resistance Committees. Its men were involved in the kidnapping of Gilad Shalit in 2006."}, {"id": "4aa4f023-d497-4f26-90b7-adb5ac5e9ec5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32367/", "date": "2024-08-13 17:16", "message": "Footage of the attack on the vehicle in Baraachit, according to the IDF spokesperson."}, {"id": "dc3630cb-7bd7-4b5b-8c10-b83d1d25dded", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32365/", "date": "2024-08-13 17:15", "message": "Hezbollah reports two casualties among its ranks:\n\nFadi Shaeb\nIbrahim al-Ashi\n\nThey were killed in a vehicle attack today in Baraachit in southern Lebanon.\n\n408 casualties for Hezbollah since the beginning of the war."}, {"id": "593377c2-9e49-4597-ac1a-6126a9fc49a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32364/", "date": "2024-08-13 17:12", "message": "US State Department:\n\nOur Qatari partners have emphasized that they will ensure Hamas is represented in the negotiation talks for a ceasefire deal this week. The participation of Hamas in the talks is crucial, and we anticipate that the discussions will progress.\n\nNo one stands to gain from Iran's retaliation. We will not hesitate to defend Israel and our forces against attacks by Iran and its proxies."}, {"id": "954f73a5-3449-4eb8-8839-c302f36bcec3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32363/", "date": "2024-08-13 17:11", "message": "The military wing of Hamas released the following footage, which shows its militants preparing the launch of the two long-range rockets which were fired at Tel Aviv earlier today."}, {"id": "74131572-4341-422d-9d1e-2bef5be8248c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32362/", "date": "2024-08-13 17:01", "message": "Following on from what I wrote here 👆 regarding the Gazan internal discourse regarding the location from which the rockets were fired today, this is what a prominent Gazan wrote on Facebook:\n\nThe guys from Deir al-Balah say the launch was from Khan Yunis.\n\nThe guys from Khan Yunis say, O my people, I swear it was from Deir al-Balah.\n\nAnd a senior source says: It was launched from among the tanks of the occupation, as if they were launched by some \"super-mujahid\"...\n\nThe one who launched them will be damned no matter where..."}, {"id": "e49aeee1-10ba-4d81-8ea8-c2329822f1db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32361/", "date": "2024-08-13 15:40", "message": "The IDF spokesperson publishes documentation of the elimination of a terrorist squad in Rafah.\n\nCould it be the same donkey?👆"}, {"id": "4287b8fe-7a9d-4522-91d8-227f278b77bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32360/", "date": "2024-08-13 15:33", "message": "The Palestinians report several attacks in eastern Khan Yunis.\n\nAccording to Israeli media, the rockets that were launched towards Tel Aviv today were launched from east of Khan Yunis."}, {"id": "3ca83a2e-6cd8-437d-b4fa-1814209c9cf9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32359/", "date": "2024-08-13 15:06", "message": "The Waqf in East Jerusalem: 2958 Jews went up to the Temple Mount today.\n\n##\nThis is a record number (last year there were about 2100)."}, {"id": "a2f82c79-fd56-4a69-a80e-23fe77b2e416", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32358/", "date": "2024-08-13 15:05", "message": "The Kremlin: After three hours, the meeting between Putin and Abu Mazen ended."}, {"id": "9ed408ba-06db-4169-9ffd-2802d8fc9c37", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32357/", "date": "2024-08-13 13:44", "message": "Hamas-identified channels celebrate the \"achievement\": a rocket that fell in the sea and a rocket that fell in the territory of the Gaza Strip. Not even a siren was activated.\n\n\"On the verge of victory\" ... (:\n\nSimilar to their pride in launching shoulder-fired missiles at an IDF aircraft - the main thing is the launch. Hitting the target is a secondary event."}, {"id": "48274267-9f0e-4699-9a76-b6d6260cf2dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32356/", "date": "2024-08-13 13:36", "message": "Following the IDF's new policy of evacuating the population from locations from which rockets were fired, there is now a lively discussion among Palestinians on social media regarding the location from which the last rockets were launched about fifteen minutes ago.\nThere is a fear of another evacuation.\n\nIn this context it was claimed in Al Jazeera a short time ago, from a \"Hamas source\", that the rockets towards Tel Aviv were launched from a place where IDF forces are stationed (ie an area from which the population has already been evacuated).\nNow we have to wait for the IDF spokesman to report where the rockets were launched from.\n\n##\nRegardless, it is definitely a refreshing change to see that the Gazan population is busy with the issue of the launch site and the possible direct impact of the matter on their place of residence.\nThis is an important and successful shift."}, {"id": "93170c18-f3b4-4d1e-9f80-19c89d8a7ecf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32355/", "date": "2024-08-13 13:31", "message": "Unofficial Lebanese sources: two dead in the car attack in Baraachit in southern Lebanon."}, {"id": "ac450d44-3d06-4f8d-9dfa-1590f2b1252d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32354/", "date": "2024-08-13 13:19", "message": "IDF: A short while ago, a projectile that was identified crossing from the Gaza Strip fell in the maritime space in central Israel. \nIn accordance with protocol, no sirens were sounded.\n\nSimultaneously, an additional projectile that did not cross into Israeli territory was identified."}, {"id": "2986153f-0580-4f08-8cd8-62b530b6a736", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32353/", "date": "2024-08-13 13:18", "message": "Palestinian channels publish documentation of the launch."}, {"id": "06aa4064-8d0e-4e32-a74d-24e7eb0fa841", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32352/", "date": "2024-08-13 13:13", "message": "The military arm of Hamas: We launched two M-90 rockets towards Tel Aviv."}, {"id": "ad12140d-c30c-4fa9-95e0-ebaa74e4582d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32351/", "date": "2024-08-13 13:11", "message": "Additional documentation from the scene of the attack in Baraachit."}, {"id": "fb628f36-8164-4245-95f7-fc44df83d9c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32350/", "date": "2024-08-13 13:11", "message": "Lebanese channels: An Israeli drone recently attacked a vehicle in the village of Baraachit in southern Lebanon."}, {"id": "8db63090-ee51-49c6-82aa-a1caa2a06dc1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32349/", "date": "2024-08-13 13:10", "message": "Further to the inquiries I receive about the report here 👆 Hamas is the one who wrote that Ministers Ben Gvir and Goldknopf are the ones who went up to the Temple Mount.\n\nIn practice, it was Ben Gabir and Wasserlauf. The mistake is in the source."}, {"id": "0d37dd67-7061-4ca2-b724-468b3c0d1b77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32348/", "date": "2024-08-13 13:07", "message": "انتهاكات خطيرة نفذها المستوطنون في المسجد الأقصى منذ الصباح فيما يسمى ذكرى \"خراب الهيكل\"، منها \"السجود الملحمي\" الجماعي  بقيادة بن غفير وأداء طقوس وصلوات ورقصات استفزازية علنية\n\nPalestinian channels: \"Serious violations were carried out by the settlers in the Al-Aqsa Mosque since the morning in the so-called \"Destruction of the Temple\" commemoration, including the collective \"epic prostration\" led by Ben Gvir and the performance of rituals, prayers and public provocative dances.\"\n\n##\nAccording to the Waqf, 2250 Jews went up to the Temple Mount this morning."}, {"id": "52a9185a-2f5e-409d-8838-69d0a5e39325", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32347/", "date": "2024-08-13 12:40", "message": "Three times this year the Iranians hoisted the flag of revenge over the Jamkaran Mosque in the city of Qom in Iran:\n\nJanuary 5 - After the ISIS attack in the cemetery in Kermanshah on the anniversary of the assassination of Qasem Soleimani.\n\nApril 1 - After the assassination of General Reza Zahedi in an attack attributed to Israel on the Iranian embassy in Damascus.\n\nJuly 31 - after the assassination of Ismail Haniyeh in Tehran.\n\nThe first time the revenge came after 11 days.\nThe second time the revenge came after 12 days.\nWe are now on the 13th day since the elimination of Haniyeh..... so far nothing.\n\nAs long as they don't wear out the beautiful flag..."}, {"id": "99292558-f481-499d-ae48-21368077ff40", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32346/", "date": "2024-08-13 12:36", "message": "The Palestinian Ministry of Health in Gaza returned today to publish the death tolls on a daily basis, after skipping a day so that it would not have to reveal the number of deaths in the attack on the A-Taba'een school on Saturday in Gaza City.\n\nThe number of dead in the past day, according to the Ministry of Health in Gaza, was 32.\nThese are the numbers of the dead in the days leading up to that:\n107 (consolidated for two days)\n40\n51\n22\n24\n30\n\n39,929 dead and 92,240 in the Gaza Strip since the beginning of the war, according to the ministry's data."}, {"id": "5444011b-f3b5-43f0-9774-b63325721142", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32345/", "date": "2024-08-13 12:35", "message": "Palestinian Authority Chairman Abu Mazen, in a meeting a about an hour ago in Moscow with President Putin."}, {"id": "da4adb55-6602-4262-84b6-7897c5e34e57", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32344/", "date": "2024-08-13 12:34", "message": "The Jordanian Ministry of Foreign Affairs: condemns the invasion of the extremist ministers to the Al-Aqsa Mosque.\n\nHamas: Ministers Ben Gvir and Goldknopf's invasion of the Al-Aqsa Mosque is aggression against the Palestinian people and their sanctuaries and constitutes an injury to the feelings of Muslims."}, {"id": "ac30eba2-5db4-44a4-8540-f6f6070a7e00", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32343/", "date": "2024-08-13 10:05", "message": "Gazan sources in Rafah:\nThere is extensive destruction in southern Rafah.\nSouth Rafah was completely wiped off the map. The army is carrying out extensive preparatory activities in the entire area that is up to a kilometer away from the border with Egypt in order to establish a buffer zone."}, {"id": "3e2fbc7e-6fb2-44a1-aa00-b3667066f9c5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32342/", "date": "2024-08-13 10:03", "message": "The United Nations on the war in Sudan:\n\n10.7 million people were displaced from their homes within the borders of Sudan following the civil war there.\n\n2.3 million people fled outside the borders of Sudan following the war.\nThe famine in Sudan has reached catastrophic levels not seen since the first decade of this century.\n\n##\nBut Gaza..."}, {"id": "e0fda4b0-6305-4829-bd88-32e9a63d9647", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32341/", "date": "2024-08-13 09:25", "message": "A Palestinian on Twitter:\nWhile Khamenei and his gang threaten and promise...\n2000 settlers invaded the Al-Aqsa Mosque since this morning to mark the destruction of the Temple.\n\n##\nIt's a good point..."}, {"id": "6e5432e9-3278-47b4-afff-0995d13dd6e4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32340/", "date": "2024-08-13 09:24", "message": "This morning the Waqf in East Jerusalem reported:\n\"Minister Itamar Ben Gvir is now invading the Al-Aqsa Mosque.\""}, {"id": "0c76ee83-695a-49bf-9d3a-f35b1ff2a71a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32339/", "date": "2024-08-13 09:23", "message": "Gaza: the donkey earned his rest"}, {"id": "10bc0f25-ff81-49b3-87bb-14ca49bfe538", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32338/", "date": "2024-08-13 09:22", "message": "Yesterday evening, Iranian propaganda channels spread a tweet with the time 02:00 and an hourglass - so that in Israel they would think that the attack would happen in the morning hours.\n\nGazans managed to record the moments of the Iranian attack at two in the morning...(volume on)"}, {"id": "e0207a15-4c84-4e4a-ad5a-1ae4cc97a910", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32335/", "date": "2024-08-13 09:21", "message": "East Jerusalem channels complain:\n\"1400 settlers invaded the Al-Aqsa Mosque this morning.\"\n\nThe Palestinians also complain about the fact that the Israeli flag was raised on the Temple Mount as well as a prayer that took place near the Cotton Merchants' Gate in the Old City of Jerusalem."}, {"id": "6b86941e-7996-4935-b49e-250594bfbe8b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32330/", "date": "2024-08-13 06:30", "message": "Opponents of the Iranian regime on social media mock the fact that the Iranians have not yet responded to Haniyeh's assassination despite the dramatic threats."}, {"id": "f151459b-6664-4292-b379-5e72ef9f7407", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32329/", "date": "2024-08-13 06:28", "message": "The Lebanese Al-Akhbar newspaper (Hezbollah-affiliated): American envoy Amos Hochstein is expected to arrive in Beirut tomorrow with a new initiative to calm the situation and prevent a widespread war."}, {"id": "e7a506cb-523c-4da9-b2ef-24239f3ac2ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32328/", "date": "2024-08-13 06:25", "message": "Tonight Trump held a first interview of its kind with Elon Musk on the X Network (Twitter).\n\nDuring the interview it was reported that the X network was subject to extensive cyber attacks. Despite this, it was reported that over a million people listened to the interview live.\n\nKamala Harris' campaign team stated that Elon Musk was abusing his ownership of X to promote Trump's candidacy.\n\nDuring the interview, Trump repeated his familiar positions and claimed that every Jew who votes for Harris should undergo a mental examination.\nTrump praised the performance of the Argentine president. Trump stated that he will know how to make peace in the world and deal with Putin, who he says respects him.\nTrump also assumed that the Iranians will not attack Israel in the end..."}]