[{"id": "a4c0136e-6288-483e-b38d-b6a1cc2cf251", "channel_id": 1560386984, "url": "", "date": "2024-06-15 22:36", "message": "The Palestinians report Israeli \"belt of fire\" attacks tonight in the area of ​​Deir al-Balah in the center of the Gaza Strip."}, {"id": "9bee1c3a-8080-4aa0-8735-f7f47bdbd49d", "channel_id": 1560386984, "url": "", "date": "2024-06-15 22:35", "message": "The IDF spokesperson announced the fall of a fighter in the Givati Brigade.\nHe was injured in battle in the southern Gaza Strip on June 10 and died of his wounds.\n\nMay his memory be a blessing."}, {"id": "96be5901-1488-4943-9034-90223a4af512", "channel_id": 1560386984, "url": "", "date": "2024-06-15 19:41", "message": "This evening's procession in Ramallah - the stronghold of Abu Mazen and the Palestinian Authority.\n\nThe protesters chant:\n\"You who own a rifle and hide it only to shoot at weddings, either shoot a Jew or give it to Hamas...\"\n\n##\nFurther to the Palestinian survey data that I published in the last few days - the Palestinian streets are full of enthusiastic supporters of the armed struggle against Israel..."}, {"id": "74a72a51-8698-42f8-8381-4c8d297cf289", "channel_id": 1560386984, "url": "", "date": "2024-06-15 19:38", "message": "Khan Yunis: Gazan children jump for joy in anticipation of the approaching slaughter of the sheep on the occasion of the \"Holiday of Sacrifice\"."}, {"id": "c1e6cf2e-8950-41aa-a545-f8ecaee15aa7", "channel_id": 1560386984, "url": "", "date": "2024-06-15 18:40", "message": "The Palestinians are now reporting a large movement of displaced persons from the Abu Elajin and Al-Jafrawi area in eastern Deir al-Balah in the center of the Gaza Strip, following IDF artillery fire."}, {"id": "2610c9e3-176f-4d15-9684-6c0f6731b7e5", "channel_id": 1560386984, "url": "", "date": "2024-06-15 18:40", "message": "A phenomenon in Gaza: moving bodies between cemeteries\n\nA resident of Gaza describes the phenomenon of the movement of the dead in the Strip.\nIn the attached video, he explains that people were forced to bury their dead on private land on the Salah al-Din axis, land that is not intended for burial, and thus when some families are displaced to another area in the Gaza Strip, following the war, they make sure to move their dead with them until they reach a permanent place.\nIn the video you can see graves that have been emptied as well as families digging the graves of their dead during the filming of the video.\n\n##\nIt is very possible that not only the bodies of Palestinians are being moved..."}, {"id": "4225f597-f80d-4b1e-9ce8-2491ac0cbe2b", "channel_id": 1560386984, "url": "", "date": "2024-06-15 18:38", "message": "The Shiite militias in Iraq claim: we attacked a target in Haifa early this morning with a cruise missile.\n\nThis may be related to:\nIDF: Overnight (Saturday), a suspicious aerial target was identified approaching from the east toward Israel. The target did not cross into Israeli territory. An interceptor was launched toward the target. Sirens sounded in the area of Na'ura in northern Israel following the possibility of fallen debris from the interceptor. No injuries were reported."}, {"id": "9d207e8f-235f-4fa7-b0d0-7b89f61429fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28953/", "date": "2024-06-15 17:30", "message": "The reporter of the Lebanese Almanar channel publishes documentation of the Hermes 900 and the Heron TP in the skies of southern Lebanon."}, {"id": "dd653e83-3d2d-4917-ad49-df9e8d2d19e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28950/", "date": "2024-06-15 17:30", "message": "The pilgrims on Mount Arafah, in Saudi Arabia today:\nThis year the yellow parasols of the DHL company cover the mountain again..."}, {"id": "b2a20362-4eb5-4548-a1ee-e652d3621d2a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28947/", "date": "2024-06-15 17:27", "message": "Paris: Violent demonstrations by the opponents of the right in France, against the background of the increase in the power of the right in the elections for the Parliament of the European Union and leading up to the early elections for the French Parliament."}, {"id": "bf5d8723-b3df-4aef-8590-49e35ffe3b6a", "channel_id": 1560386984, "url": "", "date": "2024-06-15 17:25", "message": "The IDF spokesperson announced the death of 8 fighters in battle in the southern Gaza Strip.\n\nAmong them, the name of Capt. Wassem Mahmoud from Beit Jann, deputy company commander in the Engineering Battalion, was cleared for publication.\n\nMay his memory be a blessing."}, {"id": "60045870-c808-4f88-895d-dc67844f81bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28944/", "date": "2024-06-15 14:35", "message": "A-Najma Square in Rafah - one of the bustling meeting places of the city: before and after."}, {"id": "a348c0f8-bdd9-461f-94f9-b5ec021d843e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28942/", "date": "2024-06-15 14:35", "message": "The Palestinians report the activity of forces and heavy weapons of the IDF in the area of ​​the Abu Said junction, in the Saudi neighborhood in the west of the city of Rafah in the southern Gaza Strip."}, {"id": "d420f11f-ae46-42ab-8a2c-b5f0ee83998b", "channel_id": 1560386984, "url": "", "date": "2024-06-15 14:33", "message": "The correspondent of the Lebanese Al-Manar channel, Ali Shoeib claims: The Israeli soldiers started the fires in southern Lebanon with these means."}, {"id": "411cd47d-73da-402e-8dd7-e9bc5ff55d39", "channel_id": 1560386984, "url": "", "date": "2024-06-15 14:31", "message": "Saudi Minister of Hajj: About 1.83 million pilgrims came this year to observe the Hajj in Mecca."}, {"id": "3100f696-9986-4214-ae88-ff8ea51ec1ed", "channel_id": 1560386984, "url": "", "date": "2024-06-15 14:31", "message": "The military arm of the Islamic Jihad Syrian branch announces the death of one of its operatives, Muhammad Jalbut (45 years old), in southern Lebanon.\n\nApparently this is the Palestinian who was killed in the motorcycle attack in southern Lebanon, earlier today."}, {"id": "1c56d146-2e85-495a-aa69-894f27bc921c", "channel_id": 1560386984, "url": "", "date": "2024-06-15 13:00", "message": "Palestinian channels report continued exchange of fire between IDF forces and Hamas operatives at this time in the Tel a-Saltan area in west Rafah."}, {"id": "4cd4b0ce-261a-41f5-a080-23feb10a3aa8", "channel_id": 1560386984, "url": "", "date": "2024-06-15 12:51", "message": "The Lebanese Al Mayadeen channel reported this morning on the expansion of the IDF operation in the Tel a-Saltan neighborhood and the Saudi neighborhood in western Rafah.\nThere are reports of fire from the air, sea and land in this area."}, {"id": "e3488947-8281-434e-a7c7-20f0873ddb4a", "channel_id": 1560386984, "url": "", "date": "2024-06-15 12:49", "message": "Lebanese channels publish documentation of the destruction in the town of Naqoura in southern Lebanon as a result of IDF attacks."}, {"id": "5da34c45-2f79-405a-87b1-b38e1441f9c8", "channel_id": 1560386984, "url": "", "date": "2024-06-15 12:48", "message": "The faction of the resistance committees in Gaza reacts to the report on the dismantling of the American floating dock 👆:\nThe dismantling of the American jetty a week after the massacre in Nuseirat (referring to the Palestinian deaths in the operation to release the hostages - AA) reveals the despicable security and intelligence role of the jetty as an American Zionist intelligence security base whose purpose was to help the Zionist enemy carry out the massacre in Nuseirat."}, {"id": "e98da880-d2e7-40e9-a299-46f5e933386f", "channel_id": 1560386984, "url": "", "date": "2024-06-15 12:48", "message": "\"Gazan Innovation\": a special faucet for the tent"}, {"id": "cd36dd6f-b1e2-4cd0-b5df-07d26095c19a", "channel_id": 1560386984, "url": "", "date": "2024-06-15 12:47", "message": "Following the report by Hezbollah 👆\n\nIDF: Following the sirens that sounded regarding a hostile aircraft infiltration in northern Israel at 12:56, several aerial targets were identified crossing from Lebanon into Israeli territory and falling in the area of Goren in northern Israel. No injuries were reported. As a result, a fire broke out in the area. The incident is under review."}, {"id": "be467d3b-f218-4250-8b80-e8c00d62010e", "channel_id": 1560386984, "url": "", "date": "2024-06-15 12:46", "message": "The destruction in the area of ​​al Farouq Mosque in the Shabura neighborhood in the center of Rafah, in the southern Gaza Strip."}, {"id": "b9d5f1a6-512c-4f31-b2b1-80d522d94cfe", "channel_id": 1560386984, "url": "", "date": "2024-06-15 12:44", "message": "Hezbollah accepts responsibility for the suicide drone attack on the Khirbet Ma'ar base, of the artillery battalion headquarters, in response to the attack in Jouaiyya three days ago in which the senior Hezbollah commander Taleb Abdullah was eliminated.\n\n###\nA relatively long revenge..."}, {"id": "4fd83205-f05a-4b49-bb53-9206a6620df7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28927/", "date": "2024-06-15 10:39", "message": "Hezbollah published photos from the past of Taleb Abdullah, the senior commander who was killed this week in an IDF attack in Jouaiyya in southern Lebanon.\nIn the attached photos you can see certificates of appreciation that Nasrallah gave him for his work, as indicated by Hezbollah a few days ago 👆."}, {"id": "de4f662c-411a-4b26-9e71-9f20463dbe05", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:23", "message": "The Palestinians report 19 dead and more than 50 wounded in the attack last night on three houses (homes of the Jamasi, Ramlawi and HatHat families) between the Tafah neighborhood and Shejaya neighborhood in Gaza City."}, {"id": "aa2698ad-fb9c-4587-87c8-cc643efbd91e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28923/", "date": "2024-06-15 08:15", "message": "\"Day of Arafah\"\nSince the morning hours hundreds of thousands of pilgrims began to flow to Mount Arafah in Mecca, where they are expected to stay today, in the heavy heat (49 degrees in the shade and a ground temperature of more than 70 degrees), as an essential part of fulfilling the Hajj pillar which every Muslim must do at least once in his life.\n\nThe day of Arafah is a day of fasting and forgiveness of sins, a day when \"the gates of heaven are opened\" according to the Muslim faith.\n\nOn the occasion of this day, the spokesman for the military wing of Hamas, Abu Obaida, tweeted this morning a special tweet in which he called on the pilgrims in Mecca to pray for their brothers in Gaza who are fighting to free \"the third holiest place for Islam - al-Aqsa Mosque\"."}, {"id": "a986fa28-fe16-485e-b75e-00d5c11735f7", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:13", "message": "The Shifa hospital complex in Gaza City before and after in a satellite image."}, {"id": "2180d00c-83b7-4b2b-bb6f-5756d6fbf5d8", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:13", "message": "American officials told CBS: Our interpretation of the recent Israeli strikes inside Lebanon is that they are preparing the battlefield for a sweeping attack."}, {"id": "88809943-460d-4b33-967f-e0d61dd9227c", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:10", "message": "The Lebanese Al-Akhbar channel, which is affiliated with Hezbollah, publishes that the Americans are waiting for Israel to finish the operation in Rafah in order to try to revive the negotiations for a deal.\nAccording to expectations, the operation in Rafah is expected to be completed within two weeks."}, {"id": "3b3b9340-138c-4c59-a75b-1c2477fdc3e5", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:10", "message": "US Central Command:\nThe Greek ship M/V tutor that was hit by missiles fired by the Houthis on 12.6 began to sink.\nThe ship was abandoned by the crew. One of the crew is still missing since the ship was hit.\n\nIn another Houthi attack, the Polish ship M/V Verbena was damaged.\nOne of her crew members was seriously injured."}, {"id": "00441f23-933c-43fa-9f64-a7b6c3c21877", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28916/", "date": "2024-06-15 08:09", "message": "US Central Command: The American floating dock in Gaza will be temporarily dismantled and moved to Ashdod port due to weather conditions.\n\nSince it was installed on May 17, 3,500 tons of aid have been brought into the Strip through it (this is equivalent to about 175 trucks entering by land. There were days during the war when more entered through the Rafah crossing in one day than the floating dock brought in in a month)."}, {"id": "3810797d-0efe-48e4-96b6-203a5afb2b87", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:08", "message": "South Lebanon: The residents of the village of Sheba announced tonight that they lost control of the fire near their village. They call for immediate assistance from the Lebanese rescue agencies"}]