[{"id": "4c5dcfa5-17a7-4d01-a416-109d40ea62c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28586/", "date": "2024-06-08 09:52", "message": "The spokesman of the \"al-Aqsa Martyrs\" hospital in Deir al-Balah: 15 dead and dozens injured in the IDF attacks in the center of the Gaza Strip."}, {"id": "b3956688-e777-4846-9642-b58116d318d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28585/", "date": "2024-06-08 09:48", "message": "Palestinian Channels are confirming that a large number of Israeli tanks crossed the Wadi Gaza bridge near the coast and are heading south into Nuseirat, accompanied by Apache helicopters."}, {"id": "c9c1bd33-d34e-4d52-9b75-0ebd3761b5e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28584/", "date": "2024-06-08 09:44", "message": "Residents of the al-Bureij \"refugee camp\", located next to Nuseirat in the center of the Gaza Strip, are also reportedly evacuating."}, {"id": "318c5151-d0a4-4bbc-bdde-9852e63e936b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28583/", "date": "2024-06-08 09:42", "message": "The Palestinians report that residents of the tents around \"al-Aqsa's Martyrs\" Hospital in Deir al-Balah are receiving evacuation calls warning of an imminent attack.\n\nSources in the center of the Gaza Strip report that IDF forces are surrounding several houses in the \"new camp\" area in northwest Nuseirat, alongside intense fire from the forces there."}, {"id": "b0a452c1-469b-4a28-98c9-08540a27dacc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28582/", "date": "2024-06-08 09:39", "message": "Confusion in the Central Camps area\n\nAljazeera channel reporter in the center of the Gaza Strip: We don't know what's going on.\n\nThere is mass hysteria in all the central camps. There are reports of many wounded and dead in the center of the strip, but there are no official numbers as of this moment.\n\nThe Palestinian Ministry of Health reports difficulties in receiving casualties at Deir al-Balah's largest medical center, \"al-Aqsa's Martyrs\" Hospital."}, {"id": "83259810-fbf3-4890-a29b-968414c08848", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28581/", "date": "2024-06-08 09:36", "message": "IDF spokesperson: The IDF has recently been attacking terrorist infrastructure in the Nuseirat area.\n\nPalestinian journalists report that in addition to the attacks from the air and the movement of tanks on the ground, the Nuseirat \"refugee camp\" is also being attacked by gunfire from Israeli navy ships.\n\n##\nSea, air, land."}, {"id": "50503cb1-a966-42d0-acae-9782ba80023f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28580/", "date": "2024-06-08 09:35", "message": "Following the attacks in the center of the Strip, in the area of ​​Deir al-Balah and Nuseirat, the Palestinians report the movement of displaced persons from east of Deir al-Balah towards the west (in green)."}, {"id": "2310d1a9-3602-4ddb-b9b9-cc52a488c739", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28579/", "date": "2024-06-08 09:33", "message": "The Palestinians report the movement of Israeli maneuvering forces and armored vehicles from the area of ​the Salah al-Din road, at the intersection with the Wadi Gaza bridge, in the direction of Nuseirat (in red).\n\nGazan also claim on social media that Israeli tanks are moving towards the Nuseirat \"refugee camp\" from the west, from the coastal road (in blue).\n\n##\nThere is still no footage but there is definitely a lot of hysteria in the Nuseirat area."}, {"id": "19cf7310-92f9-4a6c-a7f3-cacb0804c675", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28577/", "date": "2024-06-08 09:28", "message": "Significant attacks inside Nuseirat's \"refugee camp\" are happening now."}, {"id": "de23c291-5ea3-455e-bdd9-c96c1c084b1c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28576/", "date": "2024-06-08 09:28", "message": "An Israeli airstrike in Nuseirat, in the center of the Gaza Strip, a short time ago."}, {"id": "63a22420-de51-4c5f-a00d-7bae8b50b589", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28573/", "date": "2024-06-08 09:27", "message": "Gazan sources in the center of the Gaza Strip report an unusual military operation in the Nuseirat \"refugee camp\" in the center of the Gaza Strip, with an emphasis on al-Aashreen Street in the east of the \"camp\".\n\nAccording to the reports, there are five Israeli Apache helicopters taking part in the attack.\n\nThere are unverified reports of Israeli special forces activity inside the Nuseirat \"refugee camp\"."}, {"id": "2a68cb75-9836-4978-98df-8914565ccd1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28572/", "date": "2024-06-08 07:47", "message": "IDF Activity in the Gaza Strip\n\nThe IDF spokesman recently reported on the IDF's activities in various areas of the Gaza Strip:\n\n1. Security around the American floating pier will be increased following its reconstruction, and in preparation for the re-entry of goods through it.\n\n2. Brigade 401 raided a military compound belonging to Hamas' Tal a-Sultan battalion in western Rafah (south of the Gaza Strip). Tunnel shafts and weapons were located.\n\n3. Division 98 is engaged in combat in the center of the Gaza Strip, specifically in the eastern sector of Deir al-Balah and eastern al-Bureij, operating near one of the tunnel shafts were rockets that were ready to be launched exploded.\n\nIn the Deir al-Balah sector, Palestinians reported this morning a new advance of Israeli armored vehicles in the Abu al-Ajeen area in the southeast of Deir al-Balah (located in the western part of central Gaza).\n\nIt's worth noting that the IDF forces have not yet conducted an in-depth maneuver in the Deir al-Balah and Nuseirat areas in central Gaza, which - after Rafah - remain the last ground targets in the Gaza Strip that the forces need to address."}, {"id": "557d8e7f-7ef9-431f-86f0-4ba31dc3627d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28571/", "date": "2024-06-08 07:42", "message": "Iran: Bahrain sent a request to normalize relations with us, through Russia."}, {"id": "512ff421-45dd-4278-9c73-6a862b46c53f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28570/", "date": "2024-06-08 07:42", "message": "Hamas is trying to counter public opinion following the revelation by the IDF spokesman that 17 terrorists were killed in the attack on the UNRWA school in Nuseirat.\n\nAfter the IDF spokesman published 👆 a new list last night of 8 terrorists who were killed in the attack on the school in Nuseirat, an event that received significant international attention, Hamas moved to a defensive position.\n\nLate last night, the Hamas information office held a press conference, claiming that 3 of the dead mentioned by the IDF were still alive and that 3-4 others were killed in different circumstances (not at the school). Hamas also published a list of 12 children it claims were killed in the attack.\n\nWhat are the following conclusions?\n1. When Israel does PR right, Hamas goes on the defensive. This is a positive development.\n2. Instead of talking about the \"massacre,\" Hamas focuses on the details of the \"massacre.\" In such a situation, the intensity of criticism of Israel is reduced. \"The issue is under investigation\" and not clear and absolute.\n3. When Israel counters Hamas's propaganda instead of observing from the sidelines, the situation improves slightly.\n\nAnd now to the main question that Israel should present to Hamas as part of the debate on the \"Massacre\":\nHamas claimed that 40 people were killed, and published a detailed lists of the names of 12 children. Hamas pretends to have extensive knowledge of the names of the casualties and the circumstances of their death. Why don't they publish the complete list of all 40 dead? Why hide? What about the other 10-11 militants? Why were they hiding in the school? Let's discuss all the names.\n\nWhich brings me to my next point, why doesn't Hamas publish the names of its military operatives who were killed in airstrikes? \n\nOne would think that the terrorist organization would pride itself in its \"martyrs\" - honor their dead, and publish the names of those killed in battle.  It appears that Hamas is more concerned about its public image. By not publishing these names, it maintains ambiguity with which it can accuse Israel of targeting civilians in schools / shelters / hospitals. \n\nEven Hezbollah does not behave this way. Hamas dishonors their dead just so it can lie and accuse Israel of war crimes. Pathetic."}, {"id": "53fe4aa0-3892-4a98-8428-8287d5276cf8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28569/", "date": "2024-06-08 07:36", "message": "Berlin, Germany, yesterday: a particularly determined arrest of one of the \"keffiyehs\" by German police officers, in the heart of an Arabic-speaking area.\nThe detainee shouts in English: I can't breathe."}, {"id": "35e9950b-eaa9-4872-bb2f-fdc230d8cefc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28568/", "date": "2024-06-08 07:35", "message": "In Gaza, not everyone has time to go to an orthopedist to fix a leg brace, so you go to a friend who picks locks instead..."}, {"id": "653dcbe2-cd0e-4a50-8899-673e7f303df2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28567/", "date": "2024-06-08 07:33", "message": "Abu Hachar, a rising star from Gaza on social media, who lives in a tent on the beach in Deir al-Balah, explains the severe nicotine shortage in the Gaza Strip.\n\nAbu Khachar appeals to Netanyahu and explains:\nThe 200 NIS I have is not enough to buy one nicotine cigarette.\nYou can use the 200 NIS to wipe our butt, Mr. Netanyahu.\nBut by Allah, Ya Netanyahu, bring in nicotine!\nOnly for sellers!\nCome on, man.\n\nAbu Khachar went crazy from the lack of nicotine..."}]