[{"id": "9f21c147-ab76-4737-8479-125c77da9143", "channel_id": 1560386984, "url": "", "date": "2024-08-06 14:59", "message": "Nasrallah:\n\nI had a personal relationship with Fuad Shukr (Hezbollah Chief of Staff who was killed a week ago in Dahieh -AA).\n\nEveryone in Hezbollah knows my relationship with him and its depth.\n\nHe is from the generation of founders and he is among the founders of Hezbollah in practice. He assisted in building Hezbollah's capabilities since the beginning.\n\nFrom the first day of the war until the day he was killed, we would talk every day at 18:00 (even on the last day of his life).\n\nFuad was a strategist, smart, farsighted, could talk for hours without a page in front of him. Educated generations of Hezbollah operatives."}, {"id": "5cf60e5e-6ed2-421f-a9f0-8f0220e6851a", "channel_id": 1560386984, "url": "", "date": "2024-08-06 14:43", "message": "Nasrallah's speech is underway.\nHe refers to the Air Force's activity now in the skies of Beirut (breaking the sound barrier) - \"The enemy is celebrating because of the event (a week for the elimination of Fuad Shukr)\"."}, {"id": "cae1cd43-c2ae-4d61-b8f9-31314dfce11f", "channel_id": 1560386984, "url": "", "date": "2024-08-06 14:43", "message": "Lebanon:\n\nMany Lebanese media outlets are reporting on Israeli fighter jets breaking the speed of sound again and again about twenty minutes ago over the skies of Dahieh in Beirut.\n\nAccording to some sources, these sound-barrier breaking flights are the strongest since the beginning of the war."}, {"id": "2b096cb8-db22-4226-99ef-1bc545009b7b", "channel_id": 1560386984, "url": "", "date": "2024-08-06 13:13", "message": "Hezbollah will definitely celebrate this and Nasrallah is adding this to the draft of today's speech..."}, {"id": "2d091e5f-5a6a-49c4-80dc-538643d916f7", "channel_id": 1560386984, "url": "", "date": "2024-08-06 13:12", "message": "IDF Spokesperson: Following the report earlier today regarding a fallen hostile aircraft on route 4 to the south of Nahariya, an initial inquiry indicates that an interceptor missed the target and hit the ground, injuring several civilians. The incident is under review."}, {"id": "9df9d108-a017-4d3e-90ac-69d499e74649", "channel_id": 1560386984, "url": "", "date": "2024-08-06 12:35", "message": "Senior Hamas official Izzat al-Risheq:\n\nWhat is published in some of the media and social networks regarding the appointment of a replacement for the leadership of the Hamas movement is not true.\nThe movement will announce the results of its consultations on the subject upon completion."}, {"id": "7bdc5ae0-e4b8-4737-9d0d-e6e91f11ee3a", "channel_id": 1560386984, "url": "", "date": "2024-08-06 12:34", "message": "Palestinian medical sources report 3 dead and 2 wounded during the siege of a building in Kfar Qud in the Jenin governorate.\n\nThis increases the number of \"martyrs\" in the West Bank since last night to 13."}, {"id": "f303b351-b4df-4665-a418-3d68233da176", "channel_id": 1560386984, "url": "", "date": "2024-08-06 12:33", "message": "The Islamic Jihad publishes a proclamation in which it mourns 10 \"new martyrs\" in the West Bank in less than a day:\n\n4 in Tubas overnight (including two Islamic Jihad operatives)\n\n5 in a drone attack in Jenin this morning\n\n1 who carried out the stabbing attack at the Tunnels checkpoint today"}, {"id": "a52fd8e8-a9a1-4968-b955-dee70c6a1c08", "channel_id": 1560386984, "url": "", "date": "2024-08-06 12:32", "message": "Hezbollah announces a death in its ranks.\n\nHassan Mansour from the village of Jibchit.\n\nHe was killed in an IDF attack this morning on the village of Mayfadoun in southern Lebanon.\n\nNumber 395"}, {"id": "518cb96e-d14c-4618-90c8-71f34f7717b5", "channel_id": 1560386984, "url": "", "date": "2024-08-06 12:29", "message": "Unofficial Lebanese channels report one dead and one wounded as a result of an IDF attack in the Rab El Thalathine and Aladissa area in southern Lebanon."}, {"id": "e2a3ac40-4ed5-40f1-bfcc-c0848f180618", "channel_id": 1560386984, "url": "", "date": "2024-08-06 11:02", "message": "Jenin, yesterday: Palestinian kids try to shoot down an IDF drone using stones."}, {"id": "89a0c1dd-a3cb-4329-9c52-a76e53eb3b7b", "channel_id": 1560386984, "url": "", "date": "2024-08-06 10:59", "message": "The Lebanese Ministry of Health:\nThe death toll in the Israeli attack in Mayfadoun in southern Lebanon rose to 5."}, {"id": "8f904a52-bc38-4b93-9246-6d7dd960b8db", "channel_id": 1560386984, "url": "", "date": "2024-08-06 10:58", "message": "IDF Spokesperson: Following the sirens that sounded over the past hour in northern Israel, a number of hostile UAVs were identified crossing from Lebanon. One of the UAVs was intercepted. Several civilians were injured to the south of Nahariya during the incident.\n\nRocket and missile sirens were sounded following the possibility of falling shrapnel from the interception. \n\nFollowing the siren that sounded at 12:56 in the area of Acre, it was determined to be a false identification."}, {"id": "f941f82d-d69d-4728-9ddd-bc6d8f43b5ab", "channel_id": 1560386984, "url": "", "date": "2024-08-06 10:54", "message": "Jenin immediately after the attack this morning: Palestinian women filming and wailing in the background.\n\n##\nJenin tastes a little of the flavors of Gaza today."}, {"id": "7ca3b8a6-0623-4ae9-b785-2566976ab738", "channel_id": 1560386984, "url": "", "date": "2024-08-06 10:53", "message": "Jenin, today, after the IDF bulldozer activity.\n\nAnother level of bulldozer control... where do you get such training?"}, {"id": "9ea81a21-fd49-4f66-98f4-f2fe82afde8c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31934/", "date": "2024-08-06 10:49", "message": "The Palestinians are documenting the destruction left behind by IDF forces in eastern Jenin."}, {"id": "e87dd326-7d86-4f88-a7e5-e93685ffbe7a", "channel_id": 1560386984, "url": "", "date": "2024-08-06 10:48", "message": "Magen David Adom reports two wounded as a result of a Hezbollah attack - one in serious condition and one in mild to moderate condition."}, {"id": "ccd7e3dc-6e62-43ba-9559-51dba7b9d4b8", "channel_id": 1560386984, "url": "", "date": "2024-08-06 10:48", "message": "Hezbollah in an official announcement:\nWe attacked the Shraga base north of Acre using suicide drones in response to yesterday's assassination near Jibchit 👆"}, {"id": "21b35f51-2230-4152-a123-bdd4eb411a21", "channel_id": 1560386984, "url": "", "date": "2024-08-06 08:27", "message": "The Lebanese Ministry of Health:\n4 killed in the IDF attack in the village of Mayfadoun 👆 in southern Lebanon."}, {"id": "562681cc-ff00-4c00-9e32-29d38d873b1f", "channel_id": 1560386984, "url": "", "date": "2024-08-06 08:26", "message": "Al Jazeera: 4 dead so far in the Israeli UAV attack in eastern Jenin this morning."}, {"id": "00548e62-5bdc-4d65-a898-367d2e65080a", "channel_id": 1560386984, "url": "", "date": "2024-08-06 07:56", "message": "Hamas is trying to advocate for the Egyptians in the issue of the tunnels in the Philadelphi axis\n\nA senior official in the Hamas Interior Ministry tells the Al-Aqsa Network that the tunnel 👆 that was discovered in Rafah (at a height of 3 meters) is one of the \"commercial vehicle tunnels of 2011\" and is partially destroyed and has not been used since it was bombed in 2014."}, {"id": "d82824e8-2793-4165-9cdc-23f386fd1cba", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31925/", "date": "2024-08-06 07:39", "message": "South Lebanon: Lebanese channels report casualties in an IDF attack in the village of Mayfadoun in the Nabatieh region."}, {"id": "32872474-2cc7-4cbd-9029-498f720b05db", "channel_id": 1560386984, "url": "", "date": "2024-08-06 07:38", "message": "Another death in the drone attack in East Jenin:\nAyham al Jaber Kafauna.... He must have been knitting sweaters for the elderly in his spare time."}, {"id": "dfa33628-0f59-40f0-8e97-4b103b07b107", "channel_id": 1560386984, "url": "", "date": "2024-08-06 07:35", "message": "Karim Khan, Prosecutor General of the Criminal Court in The Hague:\nWe will not continue with the completion of the process of issuing arrest warrants for Ismail Haniyeh and Mohammad Deif after they have been killed."}, {"id": "176b6b41-34b3-4a5c-b5af-234e84524a59", "channel_id": 1560386984, "url": "", "date": "2024-08-06 07:34", "message": "Ahmed Hassam al-Saadi, 18 years old, who was apparently killed in the drone attack in eastern Jenin, was, according to the Palestinians, a volunteer medic.\n\nIt turns out that he had other hobbies..."}, {"id": "0c5973db-4dcb-448a-b7f7-f48acb46d049", "channel_id": 1560386984, "url": "", "date": "2024-08-06 07:32", "message": "Unofficial Palestinian sources in Jenin report that Ahmed Hassam al-Saadi, who was wounded in the drone attack in eastern Jenin a short time ago - died of his wounds."}, {"id": "ce013f9e-0737-4b25-a589-f9569a0436c6", "channel_id": 1560386984, "url": "", "date": "2024-08-06 07:32", "message": "The Palestinians report a serious injury in an Israeli UAV attack on a vehicle in eastern Jenin a short time ago."}, {"id": "bac0b9bf-5158-4a8e-99c8-36955cafff0a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31919/", "date": "2024-08-06 07:32", "message": "Abu Khader of Deir al-Balah is also \"disturbed\" that the Iranian response is delayed:\n\n\"Khomeini stated that Netanyahu would not be able to sleep even one night (because of the response) and so wouldn't Israel...\nAnd here... he (Netanyahu) is sleeping until now...\nWake him up... wake him up... he's still sleeping now\""}, {"id": "e320c3b5-5b93-4a68-a762-09ea2f917bec", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72661/", "date": "2024-08-06 05:57", "message": "Today at 17:00 Nasrallah will deliver a speech marking the one week anniversary of the assassination of Hezbollah Chief of Staff Fuad Shukr.\n\nHis supporters expect that hints will be given regarding the timing of the response.\n\nIt can be assumed that Hezbollah's response to the assassination of Shukr will be separate from the Iranian one to the death of Haniyeh - to \"respect\" each of the assassinated separately, but it can be also assumed that there is significant cooperation and coordination on the matter between Iran and Hezbollah."}, {"id": "b6683bc7-f814-4739-a6ce-0d76167deadb", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72661/", "date": "2024-08-06 05:53", "message": "Against the backdrop of yesterday's return of 80 bodies of Gazans to the Gaza Strip, the Hamas Information Bureau is demanding the establishment of an international committee to investigate the \"kidnapping of the bodies\".\n\n##\nWill this committee be investigating the kidnapping of bodies to Gaza on October 7th and the holding of them since?\n\nTheater of the Absurd..."}, {"id": "48776ccb-de66-4ad8-ae9b-9d99e113edaa", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72651/", "date": "2024-08-06 05:48", "message": "PA chairman Abu Mazen, in an interview with Russian media ahead of an expected visit to Moscow on August 12-14:\n\nI condemn the killing of Ismail Haniyeh.\n\nThe purpose of the assassination was to delay the arrival of a cease-fire agreement in Gaza.\n\nThe government in Gaza should be under the umbrella of the PLO and under the Palestinian government."}, {"id": "407d792a-7666-4b13-91bd-28c916f6ff6f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31914/", "date": "2024-08-06 05:46", "message": "In Jenin, the IDF's anti-terrorism activity continues since yesterday afternoon.\nIDF bulldozers are clearing the roads in Jenin of burried IEDs. Explosives are occasionally fired at the bulldozers."}, {"id": "f5f538db-8fce-4c2a-bf98-516885ba4b99", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31910/", "date": "2024-08-06 05:45", "message": "The Palestinians report 4 dead and 7 wounded in the IDF's activity tonight in Tubas in northeastern Samaria.\n\nAll four (including a 14-year-old boy) are referred to as \"A-Shaheed Al-Majahad\" (\"The Fighting Martyr\") in posters distributed on social networks. A title reserved by the Palestinians for military operatives.\nAt least one of the dead (Amid Aghnam of the Islamic Jihad) was inside a building surrounded by IDF forces in Tubas tonight."}, {"id": "be6a584a-b3da-4541-82a5-23e21ab4552b", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72651/", "date": "2024-08-06 05:43", "message": "If there are dead soldiers, the Biden administration will be in a difficult position. According to the experience of the (not so distant) past, a dead American soldier equals a significant American attack in the region. At the current time - when there are high tensions with Iran and Hezbollah due to the assassinations attributed to Israel, the Biden administration will find itself between a rock and a hard place - on the one hand, it will be obligated to respond, but on the other hand, he is very interested in reducing regional tensions.\n\nWe will wait for the official American announcement about the results of the attack by militias loyal to Iran in Iraq on the Ain Al Asad base."}, {"id": "d52dd7d8-9c43-4580-b9c6-babd333d4a26", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31905/", "date": "2024-08-06 05:43", "message": "Reuters: At least five American soldiers were injured in the rocket attack in Iraq\n\nA significant event at the current time - senior American officials report to Reuters that at least five American soldiers were injured as a result of the rocket fire by the Shiite militias in Iraq at the American base in Ain Al-Asad.\nThe event comes in the background of the American attack last week on a base of the Al-Hashd al-Sha'abi Shiite organization in Babil district in which at least five were killed, including a senior Houthi officer who specializes in the field of UAVs.\n\nAccording to other sources, it is possible that there are deaths among the American soldiers or that the number of wounded is higher - there is no verification of this at this stage."}, {"id": "79f1500c-2fc4-4876-8b90-d59de6402af9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31900/", "date": "2024-08-06 05:37", "message": "Sources associated with the Iranian opposition claim:\nThe explosions that were reported this evening in the province of Isfahan, happened at an Iranian missile base, which also has an underground system.\nThe area is near the \"Shaheed and Tanfur\" air base in the south of Isfahan province."}]