[{"id": "dbceec5c-c8fd-42b0-898e-ed86a350a6ef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32164/", "date": "2024-08-09 20:06", "message": "The current combined medal count at the Olympics for the proxies that are fighting Israel: Lebanon, Syria, Iraq, Yemen and the territories of the Palestinian Authority."}, {"id": "00325201-ffe3-46f9-bb7b-7b5b7f49d1aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32163/", "date": "2024-08-09 18:50", "message": "It seems that Abu Obaida is keeping an eye on this channel...\n\nA short while ago, the official channel of Abu Obaida, the spokesperson for Hamas's military wing, posted a brief tweet stating that Hamas's military wing pledges allegiance to the \"fighter commander\" Yahya Sinwar.\n\n##\nIt's worth noting that Abu Obaida did not appear in a video or even in an audio recording. It's just a written message, which could have been written by anyone on his behalf..."}, {"id": "3395cf8b-3d0a-4b1f-a052-86df88b3e033", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32162/", "date": "2024-08-09 18:47", "message": "The IDF spokesperson has claimed responsibility for the elimination of senior Hamas official Samer al-Hajj:\n\n\"Today (Friday), an Air Force aircraft, directed by military intelligence and the Shin Bet, targeted and eliminated the terrorist Samer Mahmoud al-Hajj in the Sidon area.\n\nAl-Hajj was a commander in the Hamas terrorist organization in Lebanon, responsible for planning and executing terrorist operations and launches from Lebanon into Israel.\n\nSamer served as the military commander in the Ain al-Hilweh camp in the Sidon area and was responsible, among other things, for recruiting and training terrorists to attack the State of Israel.\""}, {"id": "a9e1831d-d6ac-4e13-b06d-532deae346de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32161/", "date": "2024-08-09 16:51", "message": "Hamas-affiliated sources confirm a short while ago that Samer al-Hajj, the organization's security officer in the Palestinian \"refugee camp\" of Ain al-Hilweh, was killed in the Israeli attack in Sidon."}, {"id": "06248032-dda3-4f44-b9e1-6a83e338b29c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32160/", "date": "2024-08-09 15:38", "message": "A large crowd gathered at the scene of the attack in Sidon and began to sing the praises of Allah.\n\nShabbat Shalom to them too (:"}, {"id": "e5b08e53-01ed-455e-aaba-3f719bce21a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32159/", "date": "2024-08-09 15:37", "message": "The Saudi Al-Arabiya network claims according to its sources (mainly leaks from Western sources-AA) that the target of the attack in Sidon was Samer al-Hajj, the Hamas security officer in the Palestinian refugee camp Ain al-Hilweh."}, {"id": "a7b7e576-7726-483d-b8de-d5b71ef7c6d4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32158/", "date": "2024-08-09 15:23", "message": "Sky News Network: Initial reports according to which there are two dead who belong to Hamas in the attack on the vehicle in Sidon.\n\n##\nI would like to point out that in Sidon there are also many military operatives of the Al-Jama'ah Al-Islamiya organization, the Sunnis who are intertwined with the military operatives of the Hamas movement."}, {"id": "697f6665-543a-479e-bc97-9ae79345a545", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32157/", "date": "2024-08-09 15:22", "message": "Sidon: Lebanese sources report that two missiles were fired at the vehicle. There are casualties in the attack."}, {"id": "dd004129-6f98-47b3-bd96-eea436c97fa3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32154/", "date": "2024-08-09 15:15", "message": "Lebanese channels report on an attack carried out by an Israeli UAV a short time ago on a vehicle in the Sidon area, about 50km north of the border with Israel."}, {"id": "d83d38d0-2dc3-491c-a74c-9c68f3c4819e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32153/", "date": "2024-08-09 14:39", "message": "The British Telegraph: A struggle between the president of Iran and the IRGC over the response against Israel\n\nThe generals in the Revolutionary Guards insist on attacking Israel directly, while the Iranian president proposes to attack the \"secret Israeli bases\" in the countries neighboring Israel (as Iran has already claimed to have done in the past)."}, {"id": "cbf12e94-fb8d-46e5-9714-57fd183a1135", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32152/", "date": "2024-08-09 14:22", "message": "Save us from Hamas before you save us from the Jews!\n\nHere's a video you won't see on al-Jazeera. A displaced Gazan, during today's evacuation from eastern Khan Yunis:\n\nI call on the whole world.... Save us from Hamas before you save us from the Jews. Save us from Hamas before you save us from the Jews.\n\nThey (Hamas) trade in our blood... And every time we end up being displaced... Look... Our women and children are on the street...\n\n(I call on) the Arab nation, the Islamic nation, the human morality - save us from Hamas before you save us from the Jews... Save us from Hamas before you save us from the Jews..."}, {"id": "0add80c9-15c2-45b3-b75d-baebb0b4213d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32151/", "date": "2024-08-09 11:57", "message": "Awad Barabakh in an \"evacuation selfie\" yesterday in Khan Yunis:\nThe nation of a billion (Muslims) is Muhammad's nation... This is the fifth evacuation... May Allah take revenge on every Arab who abandoned us... No Muslim cares about us..."}, {"id": "8e41193e-dac4-423f-8848-c648da1f2e44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32150/", "date": "2024-08-09 11:26", "message": "Abu Khader from Deir al-Balah in tribute to Yahya Sinwar on the occasion of his appointment... (:"}, {"id": "6a780e90-a49c-4473-9fec-2069bda9d9b0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32148/", "date": "2024-08-09 11:04", "message": "Hezbollah announces two deaths in its ranks:\n\nEadi Dib\nMehdi Katsibani\n\nBoth were killed in the UAV attack at 06:30 this morning 👆 in Naqoura.\n\n404 dead for Hezbollah since the beginning of the war."}, {"id": "e52e75ac-e98d-4d2d-931d-2572807901cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32147/", "date": "2024-08-09 10:01", "message": "Palestinian channels explain the photo published today by Amit Segal:\n\nالصورة تظهر من شارع ابو منصور في حي السلام امتدادا لمدرسة السلام وبركة صاحي وصولا لمعبر رفح ولم يتبقى منها سوى مدرسة السلام.\n\nThe photo shows (the area) from Abu Mansour Street in the Salam neighborhood, through Birkat Sahi to a-Salam school to the Rafah crossing.\nNothing remains but the Salam school."}, {"id": "7936832b-c08a-4958-8e2f-9087de8fcd14", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32146/", "date": "2024-08-09 09:49", "message": "The commander of the American Central Command is again in Israel\n\nIDF Spokesperson: The Commander of the U.S. Central Command (CENTCOM) General (* * * *) Michael Erik Kurilla landed in Israel yesterday (Thursday) for his second visit this week, as the official guest of the Chief of the General Staff, LTG Herzi Halevi. \n\nThe Chief of the General Staff and the Commander of the U.S Central Command held a situational assessment on security and strategic issues, as well as joint preparations in the region, as part of the response to threats in the Middle East.  \nAdditionally, General Kurilla visited the Underground Air Force Operations Center and held a situational assessment with the Commanding Officer of the Israeli Air Force, Maj. Gen. Tomer Bar. \n\nThe IDF will continue to deepen its relationship with the U.S. Armed Forces out of commitment to strengthening regional stability and coordination between the two militaries."}, {"id": "f26d6f30-aaf2-49fe-93e2-bee9a3f57e7e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32145/", "date": "2024-08-09 08:53", "message": "Palestinian channels report that this morning, the IDF dropped leaflets in Gaza offering a cash reward and complete confidentiality to anyone who provides information on senior Hamas officials. \n\nThe leaflet also stated that the elimination of the Hamas movement is a decided matter."}, {"id": "47fa490d-0691-47dd-8520-e51b16a9d9ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32143/", "date": "2024-08-09 08:33", "message": "Residents of South Lebanon report that yesterday and today, the IDF sent drones to Bint Jbeil, broadcasting a recording through loudspeakers with \"inciting messages\" against Nasrallah and Hezbollah: \n\n\"It's all because of Hezbollah and Nasrallah...\""}, {"id": "fd5c5aa5-8155-41c7-ac62-3f9d852d9417", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32142/", "date": "2024-08-09 08:32", "message": "This is what an exiled Gazan wrote on Facebook this morning:\n\n\"The appointment of Sinwar, the disappearance of the movement's spokespeople, the effective cessation of the Hamas government in Gaza, alongside the capitulation of the 'Captagon Axis' (the Shiite axis - AA) to escalation and the adoption of the 'Ya Wash Ya Wash' strategy ('slowly, slowly' - a quote from Nasrallah's latest speech - AA) — simply mean that everything has collapsed. \n\nThe myth that has been exploited for 17 years (since Hamas's rise in Gaza - AA) under bombastic slogans has crumbled... Fallen, like a house of cards. Gaza has nothing left but its own residents. They are alone. Alone with themselves... They must now figure out how to escape the tunnel they've been driven into by these bastards...\""}, {"id": "0540b453-e0a0-433e-9fdf-e387fc2e426b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32141/", "date": "2024-08-09 07:01", "message": "The Palestinians report that the IDF has placed a crane with a system of cameras and an automatic machine gun at the top of it in the Qarara area, north of Khan Yunis."}, {"id": "059ea178-8878-404e-a71b-f833d3f6341d", "channel_id": 1560386984, "url": "", "date": "2024-08-09 07:00", "message": "Following the evacuation of the population yesterday in Khan Yunis, a popular Gaza channels (tens of thousands of followers) wrote the following manifesto last night:\n\nKhan Yunis is vacating... Beit Hanoun is vacating... Jabaliya is vacating.... Rafah is empty.... Shejaiya - if you throw a needle there you will be able to hear its noise... Nasser Hospital (Khan Younis) receives martyrs.... Shuhada Al Aqsa Hospital receives body parts.... Al Ahli Hospital receives martyrs and wounded.... Indonesian Hospital - closed.. .. Al-Awda Hospital is calling for help.... and the Gazan citizen, he has no way to pay for the evacuation... he has no tent.... he has nothing to eat...\n\nHow long will the lives of Gazans remain so? The people walk down the street and cry... women carry their children with tears running down their faces, grown people carry elderly people on their backs and cry... children hold things they managed to steal and run away...\n\nHow long will the situation remain so? May Allah avenge you."}, {"id": "07b3317e-73fc-4352-921a-97ad856dd492", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72907/", "date": "2024-08-09 06:44", "message": "The Lebanese Ministry of Health: Two killed in an Israeli drone attack this morning at 06:30 in Naqoura in southern Lebanon."}, {"id": "d2cdd5a2-ac03-472d-9d55-3797dda81d0a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32141/", "date": "2024-08-09 06:44", "message": "Documentation of one of the attacks yesterday👆 in Sheikh Nasser area in Khan Yunis. The impressive documentation indicates that the target of the attack received an evacuation warning in advance (knock on the roof)."}, {"id": "7bdb558f-61ca-432c-81a4-f990e4967ff3", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72907/", "date": "2024-08-09 06:41", "message": "Following the evacuation notice to the residents of Khan Yunis yesterday, the IDF spokesman reports this morning about the start of a divisional operation led by the 98th Brigade against Hamas in Khan Yunis."}, {"id": "2a12cb08-af80-4e2e-9b65-9e440727189c", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72907/", "date": "2024-08-09 06:38", "message": "Official sources identified with the Iranian axis reported three American-British attacks last night in the Salif area, north of Hodeidah, an area under the control of the Houthis in Yemen."}, {"id": "108777c3-9d61-4ce2-bd1a-973d69e692e1", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72907/", "date": "2024-08-09 06:37", "message": "The attack last night in Syria\n\nThe Syrian Ministry of Defense confirms that Israel attacked a number of military sites in central Syria last night and as a result 4 Syrian soldiers were injured and property was damaged.\n\n##\nUnofficial sources identified with the Assad regime \"excuse\" the lack of a significant reaction by the Syrian air defense systems last night by saying that there is a \"hole in the defense\" in this area following the \"exhaustion\" that the Syrian air defense system has undergone since 2021 (the Air Defense Forces) with an emphasis on the Homs and Tartus area .\nAccording to these sources, there are large gaps in the coverage of the Syrian air defense system in Damascus, Aleppo and Latakia as a result of the many Israeli attacks in recent years on the Buk batteries, the Pantsir and Pechora batteries of the Syrian army as well as on the radar systems."}, {"id": "7968ab12-1864-42db-b591-4f7744112a66", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72907/", "date": "2024-08-09 06:24", "message": "A joint statement tonight to the President of the USA, the President of Egypt and the Ruler of Qatar:\n\nThey call for the renewal of negotiations for a deal between Israel and Hamas on the 14th or 15th of the month in Doha or Cairo.\nIf necessary, the mediators will make a final offer so that the parties reach an agreement.\n\n##\nPrime Minister Netanyahu's office reported that an Israeli delegation would go to the talks following the announcement.\n\nIn the background of things - as an additional lever of pressure, they are trying to sell to Israel that reaching a deal may stop the Iranian reaction or that of Hezbollah."}, {"id": "9528fb0a-357f-4d72-9f4c-7c40ae76279d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72907/", "date": "2024-08-09 06:21", "message": "Further to what is happening in northeastern Syria👆👆\nThe Lebanese Al-Akhbar reports that the US has sent reinforcements of personnel and military equipment to the bases in Omar gas and oil fields and their location in Deir ez-Zur in northeastern Syria, against the background of the progress of the Arab tribes in occupying territories held by the Kurds."}, {"id": "9cddd801-c23a-437d-818d-86596876ee15", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32130/", "date": "2024-08-09 06:18", "message": "American bloggers involved in the field of aviation:\nVFA 25 squadron of type fighter aircraft F/A-18E “Super Hornet” landed a few days ago at the \"Muwaffaq Salti Air Base\" air base in Jordan."}]