[{"id": "8d308356-6dd1-4627-b443-aa6b01c8260b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32844/", "date": "2024-08-21 19:35", "message": "Syria: \"Wadi al-Nazari\" area - the Christian area in western Homs, the evening."}, {"id": "fc41e762-8d55-4f15-99f0-77b231bbcab2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32843/", "date": "2024-08-21 19:35", "message": "\"Hezbollah launched about 50 rockets this morning at the center of the city of Katzrin.\n\nOnce again, Hezbollah is firing indiscriminately at Israeli civilians.\n\nLike any country that protects its citizens - we will act accordingly\"\n\nVigilance on the Lebanese side following the threatening Israeli statements this morning, following Hezbollah's shooting at the city of Katzrin.\n\nAt the same time, the tweeters of the Shiite axis are proud that as of 9PM Hezbollah accepted responsibility for 12 attacks on Israeli territory."}, {"id": "1325b696-ef6f-41a2-b375-93fa55852fdd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32842/", "date": "2024-08-21 18:46", "message": "Great concerns among those staying in Deir al-Balah following the evacuation directive from the IDF spokesman\n\nThe residents of Deir al-Balah, who have enjoyed \"immunity\" until now, are beginning to feel, also following today's evacuation notice👆, that the noose is tightening around their necks.\nAfter the humanitarian area in Deir al-Balah has been cut several times recently, a Gaza channel is reporting today that the workers of the United Nations World Food Organization have been instructed not to go to the distribution centers in Deir al-Balah.\n\nAccording to additional reports, many Gazans are trying to get to the Shuhada al-Aqsa hospital in Deir al-Balah in the center, thinking that it is the most protected place in the area.\n\nFear is growing about an Israeli ground maneuver in Deir al-Balakh."}, {"id": "9fc62a6d-e15d-4843-a07c-25f92686b2db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32841/", "date": "2024-08-21 18:43", "message": "The Deputy Chief of Staff visited the Hamad neighborhood in Khan Yunis today - you can tell by the ugly Qatari design of the building in the background.\n\n##\nThis photo provoked quite a few reactions from Gazans due to the fact that such a senior officer is walking freely in the open air without special protection and without fear, in a neighborhood that was populated by Gazans until a few days ago.\n\nWhere are the operatives of Izz ad-Din al-Qassam? some asked."}, {"id": "e28cd98c-2425-4ac7-b4bc-c1d25587cfbd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32840/", "date": "2024-08-21 18:40", "message": "Further to the reports of Israeli tanks on a-Tina Street in the Mawasi area of ​​Qarara in the north of Khan Yunis - Gazans note that the Israeli forces have not reached the coastline as of an hour ago and that there is no division of the Strip in this area."}, {"id": "9d5c057a-329f-4327-acd6-470e5d4b2a45", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32839/", "date": "2024-08-21 18:36", "message": "IDF tanks in Mawasi area of Qarara in the north of Khan Yunis earlier this evening.\nMany Gaza channels report hysteria among residents in this area."}, {"id": "01406e64-532d-499a-8e40-e2aa7c090ab6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32838/", "date": "2024-08-21 17:35", "message": "Lebanese sources report that the body of Hezbollah operative Ra'ed Khatteb, who was killed in an IDF attack in the village of A-Chahira yesterday, has not been located yet due to the intensity of the attack and the destruction caused there."}, {"id": "af528267-0e17-405c-a456-32e9c9a42929", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32836/", "date": "2024-08-21 17:34", "message": "The Palestinians report Israeli tanks that unexpectedly appeared on a-Tina Street in the Mawasi area of ​​Qarara north of Khan Yunis, near the Khan Yunis anchorage an hour ago.\nAccording to the report, there is a great panic among the Gazans in the place who are fleeing following the firing of the tanks."}, {"id": "a8cf5b06-a5c4-4401-beaa-db74c0a3a4dd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32835/", "date": "2024-08-21 16:26", "message": "Iranian Fars News Agency: The investigation into the helicopter crash of Iranian President Raisi has ended.\nThe results indicate that it was a normal accident.\nThe helicopter crew did not comply with two safety clauses."}, {"id": "dd9ce30e-fc38-4993-89d2-2ba2556cef1b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32834/", "date": "2024-08-21 16:26", "message": "Defense Minister Gallant of the Philadelphi axis:\n\nThe Rafah division was dismantled.\nWe destroyed 150 tunnels.\nA bit still remains. We will destroy what remains. I have instructed so."}, {"id": "aded8f26-a8e2-4114-ab71-269682b14c7c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32830/", "date": "2024-08-21 14:49", "message": "Man, you are a serious celebrity among Arabs online..."}, {"id": "4b97c443-a1d2-4b35-b0db-07ad73616c05", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32829/", "date": "2024-08-21 14:49", "message": "Media in Yemen reported 3 American - British attacks in the as-Salif area, north of Hodeidah - an area controlled by the Houthis."}, {"id": "e415284b-300b-40c2-a438-9a6c0dfb296d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32828/", "date": "2024-08-21 14:48", "message": "About twenty minutes after the Palestinian report of an attack on the Salah al-Din school in Gaza City, the IDF spokesman published:\n\nIDF: A short while ago, with the direction of IDF and ISA intelligence, the IAF conducted a precise strike on Hamas terrorists who were operating inside a command and control center. The command and control center was located inside a compound that previously served as the “Salah al-Din” School in Gaza City. Hamas operatives used the compound as a hideout and a base to plan and execute attacks against IDF troops and the State of Israel.\n\n##\nThe civil defense in Gaza reported two deaths in the incident. The attack, with the low death toll, was swallowed up in the reports of other attacks with a higher death toll."}, {"id": "0118814d-ec82-4e17-b385-bf2b3279a7e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32826/", "date": "2024-08-21 14:45", "message": "Today, Iran issued a NOTAM notice about a flight ban over the area of ​​the Iranian air base in Semnan province, east of Tehran.\nThe ban is in effect on the 22nd and 23rd of this month and applies to flights at an altitude of up to 14,000 feet. The message also states that rockets will be fired in the area."}, {"id": "b498dacd-b132-4536-a851-012f6d77c300", "channel_id": 1560386984, "url": "", "date": "2024-08-21 12:52", "message": "The new government of the Iranian president, Massoud Pezeshkian, won the confidence of the Iranian parliament."}, {"id": "ae3c9177-d132-455c-8857-69b7b900847c", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73742/", "date": "2024-08-21 12:30", "message": "I wonder how Abu Mazen, who heads the Fatah movement, will respond if he is asked to state that Khalil al-Maqdah is not connected to Fatah...\nAn interesting test."}, {"id": "5f822eff-cf2f-4e98-bdd8-072b63f816ce", "channel_id": 1560386984, "url": "", "date": "2024-08-21 12:29", "message": "In the Palestinian branch of the Al-Aqsa Martyrs' Brigades, they call him in an official proclamation:\nالشهيد القائد البطل : خليل المقدح\n«أحد قادة و مؤسسي كتائب شهداء الأقصى في فلسطين و الشتات » - \"\nOne of the commanders and founders of the Al-Aqsa Martyrs Brigades in Palestine and the Diaspora\""}, {"id": "3c123cea-8667-4e78-b87c-4ef58e4c73af", "channel_id": 1560386984, "url": "", "date": "2024-08-21 12:28", "message": "The word Fatah was missing in the IDF spokesman's report 👆 So here is the official announcement of the death of Khalil al-Maqdah, with the logo of Fatah (encircled in red) and of the Al-Aqsa Martyrs' Brigades - the military arm of Fatah, as written on the poster."}, {"id": "3617e899-4884-44ad-9868-564e979c3d46", "channel_id": 1560386984, "url": "", "date": "2024-08-21 12:27", "message": "In March 2024, it was revealed that weapons that had been smuggled into Judea and Samaria and distributed to terrorist cells that were recruited and directed by Khalil and Mounir's terrorist infrastructure in Lebanon.\n\nThe officials responsible for the direction and execution of the smuggling of weapons into Israel and the direction of terror attacks are Iranian, led by Jawad Jaafari, Head of Unit 4000, a special operations unit in the IRGC's intelligence wing, alongside Ashgar Bakari, Commander of Unit 840, a special operations unit in the Iranian Quds Force.\n\nThe IDF and ISA are operating to identify and thwart attempts to smuggle Iranian weapons into Judea and Samaria and the terrorist cells that are recruited by Iranian officials and their proxies."}, {"id": "05261286-b0b4-4971-9b84-0944fdd4bf85", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73742/", "date": "2024-08-21 12:27", "message": "Joint IDF and ISA announcement:\n\nThe IDF and ISA continue a series of eliminations in Lebanon of terrorists that are directing terrorist activity in Judea and Samaria on behalf of the Iranian Islamic Revolutionary Guard Corps (IRGC)\n\nEarlier today (Wednesday), with the direction of the IDF and the ISA, an IAF aircraft struck the terrorist Khalil Hussein Khalil Al-Maqdah in the area of Sidon in southern Lebanon. \n\nKhalil is the brother of Mounir Al-Maqdah, a resident of Lebanon who operates on behalf of the Hezbollah terrorist organization and the Iranian Islamic Revolutionary Guard Corps (IRGC) and is continuing attempts to carry out terror attacks. The two collaborate on behalf of the IRGC and are involved in the direction of terror attacks as well as the smuggling of weapons and funds designated for terrorist activities into Judea and Samaria."}, {"id": "16a4be5b-d86f-4158-9bcc-86148368f844", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73739/", "date": "2024-08-21 12:26", "message": "Palestinian channels report that tanks were spotted in the area of ​​the \"Al-Mazara\" school in the east of Deir al-Balah in the center of the Gaza Strip.\n\nIt's definitely a good catalyst for population evacuation..."}, {"id": "0f0ab633-7fac-4900-b9a9-92b5edc7e371", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32813/", "date": "2024-08-21 12:25", "message": "Palestinians are evacuating from east of Deir al-Balah in the center of the Gaza Strip, following the instructions of the IDF spokesman 👆"}, {"id": "3f965c0b-1859-476d-9c91-c326c0925504", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32812/", "date": "2024-08-21 12:25", "message": "Earlier today, the IDF spokesman in Arabic published a new evacuation alert:\nResidents of blocks 129 and 130 and south of Deir al-Balah are asked to move west.\n\nThis directive further reduces the humanitarian area in the congested Deir al-Balah area and causes a further narrowing of the \"bottleneck\" in Deir al-Balah in the center of the Gaza Strip.\n\nYou will notice that the yellow part (the humanitarian area) is getting smaller and smaller at certain points in a way that allows the IDF to quickly dissect the south of the Strip and separate Deir al-Balakh and Khan Yunis."}, {"id": "4362b3c2-8df9-4ddd-99e9-0cda5a0627c4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32805/", "date": "2024-08-21 12:22", "message": "Palestinian channels:\nجنود من جيش الاحتلال يحتفلون بعد تفجير منازل في حي الصبرة جنوب مدينة غزة.\n\"Soldiers from the occupation army celebrate after blowing up houses in the Sabra neighborhood in the south of Gaza City.\"\n\nThey're commenting that the smoke is beautiful."}, {"id": "ac409e97-c317-41e2-81b5-67cf4ae73666", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73733/", "date": "2024-08-21 10:31", "message": "The Lebanese Al Mayadeen channel: More than 70 dead in the Gaza Strip in the last few hours throughout the Gaza Strip following Israeli attacks."}, {"id": "6791fc65-7e77-4a98-8716-b0aac2d78a6c", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73733/", "date": "2024-08-21 10:30", "message": "Fatah's al-Aqsa Martyrs Brigades confirm in a proclamation the killing of Khalil al-Maqdah \"while fulfilling his jihadi duty as part of Tufan al-Aqsa\" (the name Hamas gave to the campaign - AA).\n\nAccording to the announcement, Khalil al-Maqdah played an important role in the current campaign and also supported the operation of \"resistance squads\" in the West Bank territories for many years.\n\n##\nFatah and Hamas join forces."}, {"id": "c412329a-1852-4cd7-ab6c-6bf89be33fde", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32801/", "date": "2024-08-21 10:29", "message": "Al-Arabiya Network: The person killed in the drone attack in Sidon is the Palestinian Khalil al-Maqdah, the brother of Lieutenant General Mounir al-Maqdah, a senior member of the Fatah movement in Lebanon.\n\n##\nA different profile than usual.\n\nThe Lebanese al-Mayadeen (identified with the \"axis of the resistance\"): the senior member of the Fatah movement, Khalil al-Maqdah, was the commander of the al-Aqsa Martyrs' Brigades and had a significant role in the \"resistance\"."}, {"id": "3e4fb2e0-c4b9-44a1-9f14-fb1986fc19e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32798/", "date": "2024-08-21 10:26", "message": "Documentation of an Israeli UAV attacked around 11AM on a vehicle in the area of ​​the villas next to the Mieh Mieh refugee camp in Sidon (about 50 km north of the border with Israel)."}, {"id": "a66e8869-b5d7-4a7d-a0a9-6eb6a4d9b399", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32797/", "date": "2024-08-21 10:24", "message": "Hezbollah announces another death in its ranks:\n\nHussein Mustafa from Beit Leif.\n\nHe was apparently killed in the drone attack this morning👆 (07:20) in Beit Leif in southern Lebanon.\n\nNumber 422"}, {"id": "973243b3-06d9-4f94-a56c-4cd809e42145", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32796/", "date": "2024-08-21 07:27", "message": "The Palestinians report on a flyer that the IDF dropped over Khan Yunis:\nResidents of the Qarara area (block 89) in the north of Khan Yunis (near the Hamad neighborhood) are required to evacuate the area."}, {"id": "ab443644-1ebb-47da-aaa8-a27c1888b68f", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 07:10", "message": "Chicago: Clashes between pro-Palestinian protesters and Chicago police officers. Arrests were made."}, {"id": "7e03df2d-8141-4b3e-9b21-e29d7a9bb431", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:59", "message": "Chicago, near the Democratic Party convention: an sea of police in front of about 3000-5000 keffiyeh-ed demonstrators."}, {"id": "1f40a335-7d0b-40ed-b8d5-7623d53bfdd9", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:56", "message": "Chicago, near the Democratic Party convention: a man tries to prevent the burning of the US flag by demonstrators wrapped in keffiyehs.\n\nHe was pushed back under the cry:\nFuck this country. Burn it down. Burn it down."}, {"id": "f2b6f833-227e-453a-8ac0-45fe8e040da0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32791/", "date": "2024-08-21 06:51", "message": "USA: Anti-Israeli protesters set fire to the Israeli flag and the US flag outside the Israeli consulate in Chicago.\nThe Democratic Party convention is being held in Chicago."}, {"id": "a3b60702-3f6c-4e6c-bb52-57a27b753c45", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32789/", "date": "2024-08-21 06:48", "message": "Chicago: Anti-Israeli protesters near the Democratic Party convention are calling to stop funding to Israel and... to arm Hamas."}, {"id": "5c0220e9-7d26-4f7c-83bb-c93dfa98dc2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73713/", "date": "2024-08-21 06:46", "message": "The Lebanese Ministry of Health reports a death in the Israeli attack this morning on Beit Leif 👆 and also another death, a Syrian citizen, as a result of IDF artillery fire at Sarda in southern Lebanon."}, {"id": "e1d8d3d9-68e4-4303-bb77-24167d52aaad", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:45", "message": "Exchange of fire in the north\n\nIDF Spokesperson: Following the sirens that sounded in northern Israel regarding rocket and missile launches in the area of the Golan Heights, approximately 50 projectiles were identified crossing from Lebanon toward Israeli territory. Some were intercepted by the IDF Aerial Defense Array, and a number of fallen projectiles were identified in the area of the town of Katzrin. \n\nIsraeli media reports one lightly wounded by shrapnel in Katzrin.\n\nHezbollah accepts responsibility for firing Katyusha volleys at the Znovar base in the Golan in response to last night's IDF strikes in the Beqaa area."}, {"id": "c218b365-9e21-4704-9d1f-515bb5ed04a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:42", "message": "The attack on the \"Nadi al Jazeera\" celebration hall in the west of Gaza City, after an evacuation alert, yesterday."}, {"id": "a87252eb-be83-4920-9179-e3f7bbbe202e", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:40", "message": "While the Ukrainians are expanding their control in the Kursk region in Russian territory, President Putin is touring the new mosque - \"Nabi Allah Issa\", in Grozny, the capital of Chechnya, together with Chechen President Kadyrov."}, {"id": "6ecd1320-09ff-4807-88b4-80b70d8f3e2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:39", "message": "The New York Times reveals: In a classified document approved in March, President Biden directed the US military to assess the possibility of a coordinated nuclear conflict with Russia, China and North Korea."}, {"id": "0d512870-f837-42d0-88ac-fde126243a98", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73713/", "date": "2024-08-21 06:38", "message": "South Lebanon: one injured in an attack on a motorcycle by an Israeli drone in Beit Leif in South Lebanon (at 07:20)."}, {"id": "2e407a98-a290-4c40-91cc-2a2e084ed481", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:37", "message": "More on the same topic: two days ago an explosive device intended for the IDF exploded in Jenin. It hit a Palestinian taxi."}, {"id": "7a095fc4-99e1-4981-a37e-69d64bd36660", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32780/", "date": "2024-08-21 06:36", "message": "Tammun, east of Nablus: Channels covering the West Bank report seriously injured Palestinians as a result of a bomb explosion - a \"work accident\". According to one of the sources, the lower limbs of one of the terrorists were amputated.\n\nThe terrorists wanted to plant an explosive device to hit IDF soldiers and exploded in the process.\n\nBut their sword will pierce their own hearts..."}, {"id": "f638d0da-8905-4234-a5ea-650546cedd3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32777/", "date": "2024-08-21 06:33", "message": "Khan Yunis in the southern Gaza Strip: this is not a fire as a result of an Israeli attack\n\nGaza sources report a major clan feud in Khan Yunis between the families of Barabakh (a particularly large clan), al-Katawi and Khindaq. According to these sources, there are three dead and a number of seriously injured as a result of the clan feud that included a lot of shooting and burning of property."}, {"id": "55445a9f-7097-4cae-990e-4a8195bdd039", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32773/", "date": "2024-08-21 06:31", "message": "Hezbollah announces four deaths in its ranks:\n\nAli Dakmak\nMuhammad Shahin\nZiyyad Kashmer\nRa'ed Khatteb\n\nThe four were killed together in an IDF attack yesterday👆 in the village of a-Dahyra in southern Lebanon.\n\n421 dead for Hezbollah since the beginning of the war."}, {"id": "1130d800-4b0c-4f6b-a6ff-0a9e42ccf5cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:26", "message": "The Shiite militias in Iraq claim: We attacked a target in Eilat last night with a UAV.\n\n##\nThis is their second acceptance in two days after a relatively quiet month."}, {"id": "53badcb9-9dbd-4043-845b-faa54b85409f", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:26", "message": "Al Jazeera from the US Secretary of State Blinken:\n\nI heard directly from Netanyahu that Israel agreed to the (last) mediation proposal and I am hopeful that Hamas will do the same.\nIf Hamas agrees to the mediation proposal, we will need an individual implementation agreement.\n\n##\nThis is an important statement by Blinken from Israel's point of view. It is consistent with his other statements in recent days. The fact that it is quoted in Arabic on the Al Jazeera channel, which is widely distributed among the Palestinians, puts Hamas in a problematic light in the eyes of the Gazan population. It presents Hamas and not Israel as preventing a ceasefire deal."}, {"id": "149454da-c91e-4092-a135-f22982a35416", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73713/", "date": "2024-08-21 06:25", "message": "Hezbollah announced last night:\nOur air defense systems were fired at an Israeli fighter jet in the skies of southern Lebanon and forced it to retreat..."}, {"id": "94a7e28d-f4d2-4aab-b274-8735c3404dbf", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73713/", "date": "2024-08-21 06:24", "message": "The Lebanese \"civilian\", Ali Almusoui, who was killed in an IDF attack in the Beqqa area."}]