[{"id": "ffc61fa4-123c-4ffe-aefa-0997ab7d7e24", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27569/", "date": "2024-05-20 19:41", "message": "Iran: Regime opponents celebrate the death of President Raisi, secretly, hiding their faces and distorting their voices, for fear of being harmed.\nBut they celebrate. And there are many of them."}, {"id": "d8d98689-ef48-451a-a3cb-e943df74ff4c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27568/", "date": "2024-05-20 19:40", "message": "The Palestinian school year in the tent\n\nA special photoshoot for journalists - everyone is smiling,  their hair is combed, make-up on and of course, learning English.\nThe percentage of those with light eyes and light hair in the video is higher than their percentage in the Gaza population - these are carefully selected presenters, addressing the Western audience...\n\nThis is how you make an impact!"}, {"id": "aacdaf2e-75ea-4e17-b9d8-6de16c10eb60", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27567/", "date": "2024-05-20 18:58", "message": "Nasrallah is expected to give a speech this Friday at 17:00 as part of a ceremony in honor of the \"Iranian martyrs\" (the helicopter casualties -AA)."}, {"id": "d6a5716a-832d-4228-9055-4fe91e26ec5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27566/", "date": "2024-05-20 17:55", "message": "Iran: The presidential elections will be held on June 28.\n\n##\nThis means that potential candidates have until May 28 to register themselves. Just a week and a day left."}, {"id": "66a5d81b-deaf-4e92-9046-9c4a98575202", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27565/", "date": "2024-05-20 17:52", "message": "IDF Spokesman: The bodies of the hostages that were recovered last weekend were found inside a tunnel in Jabalia during a joint IDF and Shin Bet  operation under the command of Division 98\n\nLast weekend, during a joint night operation in Jabalia, IDF and Shin Bet forces, including a combat team from the 202nd Battalion, Yahalom fighters, and soldiers from Unit 504 under the command of Division 98, recovered the bodies of the late Israeli hostages Shani Louk, Amit Buskila, Ron Binyamin, and Yitzchak Gelernter.\n\nFor three days, fighters from a combat team from the paratrooper brigade and a combat team from the 202nd battalion fought intense battles in the heart of Jabalia. During the fighting, in a joint operation, paratroopers and the Shin Bet searched a suspicious building where a tunnel shaft was located. After finding the shaft, Yahalom fighters entered the underground tunnel in a night operation and fought inside it, clearing obstacles placed in advance, and locating valuable intelligence and several weapons using unique technologies.\n\nAs the forces advanced deeper into the tunnel, Yahalom fighters, together with Shin Bet forces and soldiers from unit 504, located the bodies of the hostages and brought them to the surface."}, {"id": "17c1bab2-913c-42e2-b37d-597e26454f4b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27564/", "date": "2024-05-20 17:38", "message": "Someone found the ring belonging to the fresh kebab Raisi at helicopter crash site.\n\n##\nThe wailing in the background was added later on for an enhanced viewing experience..."}, {"id": "55ffc8cc-cc0d-4b59-bf89-99194b76c02f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27563/", "date": "2024-05-20 17:35", "message": "The billboard in Valiasr Square in the Iranian capital of Tehran displays a banner of veteran kebab Qasem Soleimani, welcoming the fresh kebab Raisi."}, {"id": "896f1e84-43b8-47fe-b171-7caaa74d3d85", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27562/", "date": "2024-05-20 17:33", "message": "Footage of an Israeli attack in the Jabalia \"refugee camp\" in the north of the Gaza Strip."}, {"id": "0dff37d0-2aff-4c21-8e2a-50293e1c920b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27561/", "date": "2024-05-20 17:32", "message": "The US Department of State: We express our condolences on the death of the Iranian President, the Iranian Foreign Minister and the rest of the helicopter passengers."}, {"id": "52c8f51f-483b-4124-8ace-cdfbf64b7019", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27558/", "date": "2024-05-20 17:31", "message": "Lebanese channels report a casualty as a result of a targeted Israeli strike on a motorcycle near the town of Al-Mansouri, located near the southern Lebanese city of Tyre."}, {"id": "5a024bd8-83e7-4b2b-9978-103a3f6cc181", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27557/", "date": "2024-05-20 16:13", "message": "Reaction to ICC prosecutor Karim Khan's intention to issue arrest warrants against senior Israeli and Hamas officials and military commanders\n\nBritish Defense Minister: Issuing arrest warrants against senior Israeli officials will not affect the export of arms from Britain to Israel.\n\nThe British Prime Minister's Office: Issuing arrest warrants is not helpful and will not help stop the fighting.\n\nRepublican lawmakers have announced that they will act against judges at the Hague Criminal Court over their intention to issue arrest warrants.\n\n##\nI will point out that the mandate assumed by the ICC in this matter stems from a legal concept according to which \"Palestine\" is a state, a stance through which it claims it has authority on the matter, with the ability to issue these arrest warrants."}, {"id": "39e0d15e-5f45-4f1b-95ae-f7e2d0a74f54", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27556/", "date": "2024-05-20 15:54", "message": "Syrian opposition sources publish footage from the area that was attacked today in Qusayr, a Hezbollah stronghold in Syria.\n\nJudging by the footage, one can clearly tell that it was more than just a drone strike.\n\nSources affiliated with the Syrian regime claim that the Syrian air defense systems were activated during the attack."}, {"id": "747fe2f8-e891-494c-89aa-215a51e9b5f6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27555/", "date": "2024-05-20 15:52", "message": "The Palestinians report a large explosion near the Jabalia \"refugee camp's\" police station in the northern Gaza Strip, following an Israeli attack."}, {"id": "71277689-30cc-4174-b0de-9e3e3c03b246", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27554/", "date": "2024-05-20 15:51", "message": "Israel demolished today an illegally-built 5-story building in the village of Irtas in the West Bank's Bethlehem district."}, {"id": "e10e36ac-3964-4ae1-ab52-b725bb6a86b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27553/", "date": "2024-05-20 15:49", "message": "The Palestinians report that today a large shipment of thousands of tents arrived through the American floating pier in Gaza."}, {"id": "1574df14-b112-4f24-bbff-39633924405b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en27553/", "date": "2024-05-20 15:49", "message": "Amazing footage of a meteorite in the skies of Portugal yesterday."}, {"id": "f5600576-f8f4-4557-b93c-988ec6e33dd9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27549/", "date": "2024-05-20 14:46", "message": "An IDF attack in the last hour in the Ajarameh area in the Jabalia refugee camp in the north of the Gaza Strip."}, {"id": "356319e9-a709-4fc5-b3c7-137640a1f6fe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27548/", "date": "2024-05-20 14:10", "message": "The Palestinian Ministry of Health in Gaza:\n\n106 casualties in the Strip in the last day.\n\nThe death toll in the Gaza Strip in the days leading up to today:\n70\n83\n31\n39\n60\n\n35,562 dead and 79,652 wounded in the Gaza Strip since the beginning of the war.\n\nBeyond that, the Hamas information office estimates that there are about 10,000 missing persons under the ruins of the buildings in the Strip.\n\nIn addition, there are another thousand dead Gazan terrorists which were found in Israeli territory following the Oct. 7 attack, according to unofficial Israeli data."}, {"id": "d09ae2d1-4da0-4837-ae03-14688c55d459", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27544/", "date": "2024-05-20 14:05", "message": "Hezbollah announces four deaths in its ranks since this morning:\n\n1. 26-year-old Abbas Mehdi, from the village of A-Naqoura (southern Lebanon)\n2. 67-year-old Raef Maliji from the village of A-Naqoura (southern Lebanon)\n3. 26-year-old Muhammad Abbas, from the village of Barish (southern Lebanon)\n4. 35-year-old Hussein Hassan, from the village of Bednayel (Baalbek District, eastern Lebanon)\n\nThe first three were killed in IDF strikes in A-Naqoura and Meiss Ej Jabal.\n\nAs for the fourth - he was likely killed in the Israeli attack in Al-Qusayr in Syria.\n\nThere are probably more dead whose names have not yet been published.\n\nSo far, 309 have been killed by Hezbollah since the beginning of the war."}, {"id": "8c31de71-6522-428c-8022-e626afce36e4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27543/", "date": "2024-05-20 14:03", "message": "Where is Iran headed after Raisi?\n\nThe death of the President of Iran, Ebrahim Raisi and the Iranian Foreign Minister Hossein Amir Abdollahian, two of the most powerful figures in the Iranian regime, is not expected to create a noticeable change in Iran's current policy in many areas, including its military policy and its foreign policy.\n\nAt the internal political level in Iran, this is not a simple upheaval. The duo Raisi and Abdollahian were \"destined for greatness\":\n\nEbrahim Raisi, who did not complete even 3 years of his term as president, was considered a leading candidate to succeed Iran's supreme leader, Ali Khamenei, who celebrated 85 years last month.\n\nAbdollahian saw himself as a candidate for the position of president of Iran, in place of Raisi.\n\nYesterday's helicopter crash ended the continued growth of the \"future generation\" of the Iranian leadership.\n\nNow the spotlight is on the expedited election process for the position of President of Iran, expected in the coming weeks, when the leading names for the position now are:\n\n1. Ali Larijani, former Speaker of the Iranian Parliament.\n2. Muhammad Kalibaf, the current Speaker of the Parliament.\n3. Hassan Akhmeni, the grandson of Ruhollah Khomeini, the creator of the Islamic revolution in Iran.\n4. Said Jalili - member of Iran's Council of Interests (was a candidate for the presidency in 2014 and won third place).\n\n###\nAs far as Israel is concerned, there is no significant change, but it never hurts that talented people who promote global terrorism against Israel disappear from the face of the earth.\n\n#all_is_from_allah"}, {"id": "5105fd48-b483-424b-80a5-c7c9c39db9d1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27542/", "date": "2024-05-20 14:01", "message": "IDF: A short while ago, IDF soldiers identified a Hezbollah terrorist cell in the area of Meiss El Jabal that operated within a launch post from which launches were fired toward Israel over the past few days. The terrorist cell and launch post were struck by IAF fighter jets.\n\nEarlier today, IAF fighter jets struck a Hezbollah weapons storage facility and military compound. In addition, IDF artillery fired to remove a threat in the area of Naqoura in southern Lebanon. During the strikes, secondary explosions were identified, demonstrating the presence of weaponry in the area."}, {"id": "47cf1d59-299b-4db1-a5fd-7072660ced29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27541/", "date": "2024-05-20 10:51", "message": "Lebanese sources:\nIn addition to the 3 deaths from the IDF attack in Naqoura, there are 2 deaths from the IDF attack in Meiss El Jabal.\nThere is also at least one Lebanese dead from among those killed in the attack in Qusayr in Syria.\n\n##\nIf we add these to the helicopter casualties in Iran, it seems that the Shiite martyrs' road on the way to Jerusalem is particularly busy this morning...\n#شهداء_على_طريق_القدس"}, {"id": "15b3f510-a124-4113-9ccc-bef9252fb52a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27540/", "date": "2024-05-20 10:36", "message": "A Gazan wrote on Facebook:\n\nمنطقة مشروع بيت لاهيا ، يتم الان شطبها عن وجه الارض مع ساكنيها \n#لمن يهمه الأمر\n\nThe Beit Lahia project area (in the north of the Strip -AA) is now being wiped off the face of the earth along with its residents\n#to whom it may concern"}, {"id": "1e855dd2-25ed-4a46-8523-60d1dde23310", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27539/", "date": "2024-05-20 10:34", "message": "Geert Wilders, leader of the Party for Freedom in the Dutch Parliament on the European Union's condolence message following the death of Iran's president and foreign minister:\n\n\"Not in my name!\""}, {"id": "a6b94efb-f2e8-4662-af00-283e83d4bd5d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27538/", "date": "2024-05-20 10:33", "message": "Lebanese media: at least 3 killed in two attacks carried out by the IDF since this morning in Naqoura in southern Lebanon."}, {"id": "ee1825d3-da6e-421a-9c2b-970855291107", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27537/", "date": "2024-05-20 10:32", "message": "Syrian media: An Israeli drone recently attacked two targets in the Qusayr area of ​​Homs (Syria). This is an area considered one of Hezbollah's strongest strongholds in Syria, also due to its strategic proximity to the border with Lebanon, which helps Hezbollah smuggle weapons from Syria to Lebanon.\n\nUnofficial sources report four dead and four wounded."}, {"id": "0e63e072-a818-45aa-8f30-ea2abd0cb7c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27536/", "date": "2024-05-20 08:53", "message": "Lebanese channels report casualties in the IDF attack in Naqoura in southern Lebanon a short time ago."}, {"id": "72bd09d6-cf67-469a-93e5-d5bfb8677f73", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27535/", "date": "2024-05-20 08:53", "message": "The new Iranian foreign minister, Ali Bakri Khouni."}, {"id": "eeabe1f2-9ae3-49be-a186-5d302d972fe0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27534/", "date": "2024-05-20 08:52", "message": "Iran - appointments and decisions following the death of the president and the foreign minister\n\nThe supreme leader of Iran announced 5 days of mourning in the country.\n\nThe supreme leader confirmed that Muhammad Mahbar, the first deputy of the president, will receive his powers until the holding of presidential elections within 50 days.\n\nAli Bakri Khouni, who was the Iranian deputy foreign minister, will be appointed the acting foreign minister."}, {"id": "21239d6c-27cf-4205-95d4-bf1d21040031", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27532/", "date": "2024-05-20 07:43", "message": "Follower Ben-Tzion Macales shows, based on satellite images, the changes going on in the Jabaliya refugee camp in the north of the Gaza Strip and the eastern Rafah area in the south of the Gaza Strip, following the IDF's activity in these sectors in the last ten days."}, {"id": "fc4406e9-5e1f-4c3b-8e8f-69924149c3b0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27531/", "date": "2024-05-20 07:42", "message": "The Palestinians are reporting this morning on a limited advance of IDF maneuvering forces in eastern Khan Yunis in the southern Gaza Strip (Wadi Salqa area and Qarara area)."}, {"id": "0e5cccf1-7691-4cf6-9187-a2566e9963a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27530/", "date": "2024-05-20 07:41", "message": "Spokesman of the Constitutional Committee in Iran:\nWe will hold presidential elections within 50 days."}, {"id": "bf780f95-2dce-4b6c-946f-990ca894f993", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27529/", "date": "2024-05-20 07:40", "message": "Lebanon declared three days of national mourning following the death of the Iranian president and his foreign minister.\n\nIranian Foreign Minister Abdollahian was supposed to arrive this Thursday on a \"working visit\" to Lebanon."}, {"id": "506b9335-a3ac-4390-9a78-45ae26cc342e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27528/", "date": "2024-05-20 07:39", "message": "Ilham Aliyev, the president of Azerbaijan, sent a letter of condolence to the supreme leader of Iran following the death of Ebrahim Raisi, the Iranian president, with whom Aliyev met shortly before Raisi took off on a flight from which he did not return."}, {"id": "d16249f1-8fd2-4516-a528-e2a99bfaf5f2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27527/", "date": "2024-05-20 07:35", "message": "Celebrations by anti-regime Iranians as well as Israelis, in front of the Iranian embassy in London this morning, following the confirmation of the death of Iranian President Ebrahim Raisi.\n\nRaisi, during his tenure as a senior in the Iranian justice system, signed execution orders for thousands of opponents of the regime in Iran (mainly in the late 1980s).\n\nThere are many people who are happy today throughout Iran and abroad."}, {"id": "e6a19cf6-7e9c-4a64-8ed3-d8d01b590c08", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27526/", "date": "2024-05-20 06:38", "message": "Another picture of the Iranian president's helicopter crew members: the pilot, co-pilot and flight technician.\n\n##\nThe real heroes :)"}, {"id": "dce60a11-e609-491e-903e-1411c9c31a43", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27524/", "date": "2024-05-20 06:09", "message": "Rafah, southern Gaza: The neighborhood of Yabneh is completely empty. Only journalists remain.\n\nThe IDF forces have not yet entered this area, located west of the Al-Barazil neighborhood (where the maneuvering forces are now).\n\nThe IDF has not yet issued an evacuation warning for Yabneh, but despite this it is already empty."}, {"id": "724cb640-c0c5-472f-b6ee-7b9630e9c737", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27523/", "date": "2024-05-20 06:04", "message": "The bodies are being recovered from the crash site."}, {"id": "baefc442-a2d2-428d-80c1-4aed8dc110ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27521/", "date": "2024-05-20 06:00", "message": "Pictures of the pilot and co-pilot."}, {"id": "70e85aae-6d66-4f6c-9406-27a2da931859", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27520/", "date": "2024-05-20 05:51", "message": "Meanwhile in Jabalia in the north of the Gaza Strip: Palestinians complain on attacks and destruction on a level they have not seen since the beginning of the war."}, {"id": "c98f8b9c-8c93-4396-962f-1edea113fdaf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27519/", "date": "2024-05-20 05:49", "message": "A black flag was placed on the dome of the Imam Reza shrine in Mashhad, Iran, as a sign of mourning."}, {"id": "419c0aa2-10fc-4334-8d29-ad678c10bfca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27518/", "date": "2024-05-20 05:43", "message": "Hamas was among the first to issue a statement of condolences on the death of the Iranian president and the other passengers of the helicopter. \n\nAlready at 8 AM."}, {"id": "63c09d6d-585a-411c-9f98-dc791d23c05e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27517/", "date": "2024-05-20 05:42", "message": "The names of the helicopter crew members were also published:\n\nColonel Sayed Taher Mustafavi - the pilot\nColonel Muhsen Darainosh - the co-pilot\nMajor Bahroz Kedima - on-flight technician"}, {"id": "e4a82de2-5f50-4279-a137-666d6953cb17", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27516/", "date": "2024-05-20 05:37", "message": "According to article 132 of the Iranian constitution, Iranian Vice President Mohammad Mokhber will take Raisi's place as the acting president of Iran for the next 50 days."}, {"id": "5d1a920e-9dfc-4b66-830c-0e14eb4a531e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27514/", "date": "2024-05-20 05:33", "message": "The list of the nine passengers killed in the helicopter crash in Iran:\n\n1. The Iranian president, Ayatollah A-Sayed Ebrahim Raisi.\n\n2. Ayatollah A-Sayed Muhammad Ali Elhashem, the imam of the city of Tabriz.\n\n3. The Iranian Foreign Minister, Dr. Hossein Amir-Abdollahian.\n\n4. The Governor of East Azerbaijan Province, Dr. Malek Rahmati.\n\n5. General Sayed Mehdi Mousavi, in charge of the president's security (in the separate picture).\n\n6. The pilot.\n\n7. The co-pilot.\n\n8. A helicopter crew member.\n\n9. An officer from the \"Ansar Al-Mahdi\" force."}, {"id": "b6f4baab-882e-4591-9a61-7cec844cf413", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27513/", "date": "2024-05-20 05:30", "message": "The first footage of the crash site after sunrise and after the weather had improved.\n\nAccording to Iranian sources, it was a Turkish drone with thermal imaging capabilities that located the crash site."}, {"id": "46f716ea-61b8-4620-aa1d-d54abe32dc2c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27512/", "date": "2024-05-20 05:19", "message": "The charred helicopter fragments clearly indicate that a fire broke out at the crash site. \n\nAccording to some reports, some of the bodies were burnt to the point where it was difficult to identify them."}, {"id": "e32c7adc-4a0c-4703-aecf-959182521560", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27507/", "date": "2024-05-20 05:16", "message": "Photos from the helicopter crash site that were published on Iranian channels earlier today."}, {"id": "ee7f6649-fde9-4ab7-ac80-01c6e9690e8a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27506/", "date": "2024-05-20 05:07", "message": "Iran officially announced a short while ago: \n\nThe President of Iran, Ebrahim Raisi was killed along with all the other passengers of the helicopter (a total of nine dead including the helicopter crew).\n\nAt around 5 AM (local time), the wreckage of Raisi's helicopter was located.\n\nAn hour later, it was announced that no signs of life were found among the wreckage of the helicopter.\n\nTowards 7 AM, the Iranians officially announced that the Iranian president and the foreign minister, the two most important political figures in the country (besides the supreme leader), are dead."}]