[{"id": "82c504d6-7b71-4490-a3d3-156b4049da1c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31665/", "date": "2024-08-02 21:55", "message": "The Iranian channels and those affiliated with the Shiite axis have been operating a wide and varied psychological warfare on the citizens of Israel in recent hours as part of the \"anticipation of the Iranian response\".\n\nPlease don't swallow every frog they advertise.\n\nRemember that you are the target audience of this psychological warfare. Consume online content responsibly."}, {"id": "6a15977d-81e7-44c6-923c-2969d0b8ef4d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31664/", "date": "2024-08-02 21:13", "message": "Aljazeera Network: A pirate crossing point between Syria and Lebanon was attacked in the border area in northeastern Lebanon."}, {"id": "889ec62b-5c2d-4c80-be53-92597f362912", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31663/", "date": "2024-08-02 20:54", "message": "Lebanese channels are reporting another Israeli attack in the same area that was attacked earlier this evening near the Syria-Lebanon border (northeast Lebanon)."}, {"id": "cecb2b36-5b55-461a-bc2c-25e29147fb76", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31662/", "date": "2024-08-02 20:41", "message": "Documentation from the Israeli attack on Dabaa' airfield in Syria, according to Lebanese channels."}, {"id": "677c90cb-9806-4a7c-92bc-24f9f1e44588", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31661/", "date": "2024-08-02 19:39", "message": "Hamas representative in Iran: Haniyeh's assassination was carried out through an attack on his room from the outside and not through an explosion from inside the room."}, {"id": "69e8043a-7670-485e-ae04-61db4c467b0b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31660/", "date": "2024-08-02 19:38", "message": "The military wing of Hamas accepts responsibility for launching ten rockets towards Sufa at 19:12 and another ten rockets towards Sufa at 20:03."}, {"id": "d5989911-e836-486e-b87f-69ef685d4471", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31659/", "date": "2024-08-02 19:38", "message": "IDF: Over the past day (Friday), numerous rockets were identified crossing from the southern Gaza Strip into Israeli territory. No injuries were reported.\n\nIn response, the IAF struck and dismantled the launchers in the Gaza Strip from which the rockets were fired.\n\nFollowing the sirens that sounded in the area of Nahal Oz, the IDF Aerial Defense Array successfully intercepted one projectile that crossed from the Gaza Strip. No injuries were reported."}, {"id": "7cf2103d-de65-4195-b149-767bad1c426e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31658/", "date": "2024-08-02 19:38", "message": "The sheikh Ekrima Sabri was released from the investigation after eulogizing Ismail Haniyeh on the Temple Mount today."}, {"id": "05f1c084-9136-42b2-bdad-53441e428a43", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31656/", "date": "2024-08-02 19:32", "message": "The Iranian Fars News Agency from the Iranian Minister of Intelligence:\nThe elimination of Haniyeh was carried out with American approval."}, {"id": "915c8570-b9b6-43b4-a60f-2ddd0d043e87", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31655/", "date": "2024-08-02 19:31", "message": "Further to this, the Lebanese Al-Akhbar newspaper (affiliated with Hezbollah) claims that the Syrian army launched two air defense missiles at Israeli fighter jets that attacked the airfield in the northeast of Qusayr - Hezbollah's stronghold in Syria."}, {"id": "b95fb886-9837-4e7c-bb76-1533732aeff8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31653/", "date": "2024-08-02 17:51", "message": "Initial Lebanese reports of an Israeli attack in the area of the village of al-Qusayr, in the Hermel district in northern Lebanon, near the border with Syria."}, {"id": "d5be505c-a90d-4905-b39a-8edfae3825a4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31652/", "date": "2024-08-02 17:50", "message": "IDF Spokesperson:\n\nFollowing the alerts that were activated a short time ago in the Sufa region, eight projectiles were detected that crossed from the south of the Gaza Strip and fell in open areas, there were no casualties."}, {"id": "433ef89b-a904-46fb-8e16-1dd56e6297c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31651/", "date": "2024-08-02 17:49", "message": "In the picture above - Rouhi Mushta, close friend of Sinwar and a member of the political bureau of Hamas, one of the senior members of Hamas in the Gaza Strip who was eliminated in a tunnel in Gaza City."}, {"id": "c1885749-05e6-4fb8-8a30-8740ef82fb3a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31650/", "date": "2024-08-02 17:47", "message": "The Saudi daily Asharq Al-Awast: Israel killed two senior officials in the political bureau of Hamas and three senior officials in the military branch in Gaza\n\nThe newspaper reports from its sources that about a week and a half ago, Israel attacked a tunnel in the Sinaea area in the south of Gaza City (I will mention in this regard the IDF's activity about a week and a half ago in the Tel el Hawa area in the south of Gaza City -AA) in which a number of senior officials were killed.\nAccording to the newspaper, these are the senior officials who were killed in the tunnel:\n\n1. Rouhi Mushta, a member of the political bureau of Hamas, one of the senior members of Hamas in the Gaza Strip and a (very) close friend of Yahya Sinwar (they shared a cell together in an Israeli prison and were released together in the Shalit deal).\n\n2. Samah a-Seraj, a member of the political bureau of Hamas.\n\n3. Abd al-Hadi Siam - the military intelligence officer of the Gaza City Brigade and a senior commander in Nukhba.\n\n4. Sami Odej, one of the commanders of the general security apparatus of the political echelon in Hamas.\n\n5. Muhammad Hadid - one of the commanders of the rocket unit of the Gaza City Brigade in Hamas.\n\n\nAccording to the newspaper, the tunnel was attacked at the beginning of the war, but was only partially damaged, so a number of senior officials returned to stay there.\nThe information reached the newspaper from sources in Hamas after some operatives of the military arm of Hamas went down to the tunnel to check if there were any survivors left.\n\n##\nThis is another impressive achievement.\nThe Political Bureau of Hamas has become a small office. Its people are dwindling."}, {"id": "2c79c404-607e-48fb-8be8-00936528ad11", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31649/", "date": "2024-08-02 16:46", "message": "This time with a bit more willpower..."}, {"id": "152c2529-990b-4494-a8bc-66345bb4be9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31648/", "date": "2024-08-02 16:46", "message": "IDF: Following the sirens that sounded a short while ago in Sufa and Nir Yitzhak, ten launches were identified crossing from the southern Gaza Strip. Some of the launches were intercepted and the rest fell in open areas. No injuries were reported."}, {"id": "88e480c3-3b07-4aa4-b0bf-2cd8cbcdbb77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31647/", "date": "2024-08-02 15:41", "message": "IDF: The Chief of the General Staff to reserve soldiers in Gaza: let those who attack the citizens of the State of Israel know that we are ready to go far, to gather very precise intelligence, to strike and to kill\n\n\"Our message to the entire Middle East this week - those who attack the citizens of Israel, those who attack the State of Israel, we are ready to go far, know how to put in a lot of effort to gather very precise intelligence, to strike, to kill and also to take risks. We struck in Beirut and we are striking in Gaza, and we will be very strong In defense, and then we will strike very strongly. This message is very important. We cannot do these things without relying on the fact that we have reservists with a very high level of professionalism and dedication. The IDF is operating with excellence, you are operating with excellence, but we need to know that we have the patience, the determination to keep doing it right until we reach the goals of the war.\""}, {"id": "fcaacbe7-df7d-4643-81cf-add333c13494", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31646/", "date": "2024-08-02 15:38", "message": "The Turks preemptively lowered the flag to half-mast 👆 at the embassy in Tel Aviv... 🇮🇱❤️\n\nJudoka Raz Hershko humiliates Turkey and scores an ippon in 15 seconds.\n\nShe finished in her category with a silver medal 🥈"}, {"id": "234b0364-908e-43fa-b951-dd0729ecef1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31645/", "date": "2024-08-02 15:33", "message": "The inciting sheikh Ekrima Sabri was taken into questioning after eulogizing Haniyeh."}, {"id": "3565f484-aff5-4740-b4b3-0016bdf6dbaf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31644/", "date": "2024-08-02 14:14", "message": "IDF: Following the sirens that sounded a short while ago in southern Israel, one projectile crossed from the southern Gaza Strip and fell in an open area.\n\n##\nOne for Haniyeh, for the record, hours after he was buried (perhaps half the rocket was for Mohammad Deif?)"}, {"id": "db24df61-e070-4161-b85e-83f7a77b7db2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31643/", "date": "2024-08-02 14:11", "message": "Haniyeh's fresh grave -\nInsisted on premium gravel (:"}, {"id": "911cf4d0-07d4-4106-b472-b35b58ddee2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31642/", "date": "2024-08-02 12:57", "message": "Haniyeh's grave in the cemetery in Lusail, Qatar."}, {"id": "e6730d26-427b-4e47-ba8a-fdeced8559dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31641/", "date": "2024-08-02 11:39", "message": "Spokesman of the Office of the Supreme Leader of Iran:\nThe necessary steps were taken to avenge Haniyeh's assassination. This will come to fruition (in the future)."}, {"id": "451797e4-cab8-48c8-bbb6-a983099e07f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31638/", "date": "2024-08-02 11:12", "message": "East Jerusalem: Ekrima Sa'id Sabri, Al-Aqsa's inciting preacher eulogizes Ismail Haniyeh as part of the Friday prayer - today on the Temple Mount.\n\nThe صلاة الغائب \"Prayer of the Absent One\" was also held in Haniyeh's honor."}, {"id": "30d45a05-0e38-4df0-94d0-73df8140dfc1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31637/", "date": "2024-08-02 11:06", "message": "The municipality of Tehran decided to name one of the streets in the Iranian capital after Ismail Haniyeh."}, {"id": "a4e15ef0-e587-4d58-ba22-3051774a58a4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31634/", "date": "2024-08-02 10:22", "message": "The Palestinians report that Nael a-Sakhl, a prisoner from Nablus who served a life sentence and was deported to Gaza as part of the Shalit deal, was killed in an IDF attack this morning in Gaza City.\n\nNael's father died inside the PA headquarters in Jnaid prison in Nablus in 2013 - Ismail Haniyeh called then to console...\nNael took an active part in the promotion of terrorism from within the Gaza Strip and, as can be seen in the attached photo, participated in the marches of return in the Gaza Strip on the border with Israel in previous years."}, {"id": "d5094530-80dc-4a2b-9942-a727246ae349", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31633/", "date": "2024-08-02 10:18", "message": "The funeral ceremony of Haniyeh and his bodyguard in Qatar:\nKhalil al-Hayya, Yahya Sinwar's deputy on the microphone.\nBehind him, Ziyad al-Nakhalah, seecretary general of the Islamic Jihad, and Zaher Jabarin, senior leader in Hamas and responsible for their activity in the West Bank- both arrived on a flight from Tehran.\nAt the edge of the photo on the right - Abd Salam Haniyeh, Ismael Haniyeh's son and chairman of the Palestinian Sports Association of Gaza - who lives a comfortable life in Qatar (he left the Strip shortly before October 7)."}, {"id": "eeaf8ed5-70f2-409c-a2c5-e32c2ecd4dd9", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72311/", "date": "2024-08-02 10:12", "message": "The flag was lowered to half-mast across Turkey to mourn Haniyeh's death.\nThe same is true at the Turkish Embassy in Tel Aviv."}, {"id": "9435cf88-a976-48d9-ac6c-4b1c14ab9d1b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31629/", "date": "2024-08-02 09:52", "message": "The Palestinians were a little less entertained: \"The Zionist soldiers are destroying the clinics in Gaza\""}, {"id": "6af7285e-b8b0-47e9-8f35-328e44b3c71d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31628/", "date": "2024-08-02 09:33", "message": "Doha, Qatar: The crowds are preparing for the funeral of Ismail Haniyeh.\n44 degrees in the shade."}, {"id": "391c8d5d-0be3-4a86-b6fc-7a60f88b6a07", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31624/", "date": "2024-08-02 06:41", "message": "The company Meta removed posts published by the Prime Minister of Malaysia mourning Haniyeh's death.\n\nYou can help Meta with enforcement by reporting every post that praises Haniyeh or expresses sorrow for his death."}, {"id": "9c0ecab6-fc7b-40ff-ac06-45b956ba279a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31622/", "date": "2024-08-02 06:38", "message": "Doha, Qatar: Haniyeh's wife praises him over his coffin placed in their luxury home.\nShe wishes him that Allah will make his path easier in the future... \"You are my beloved in this world and my beloved in the next.\"\n\nNo tears were observed on his wife... He passed away...\nWho will inherit Haniyeh's billions? 😉"}, {"id": "f722cbea-9d1d-4550-a56b-de736970c831", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31621/", "date": "2024-08-02 06:31", "message": "Hamas-affiliated channels are keeping tabs on who condemned the killing of Haniyeh among Arab countries and who did not.\n\nAccording to the data provided, 4 Arab countries did not condemn the elimination of Haniyeh:\nUnited Arab Emirates\nBahrain\nMauritania\nMorocco"}, {"id": "c268877e-aa52-4684-b2b2-d7a5d9d0e372", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31620/", "date": "2024-08-02 06:25", "message": "The White House on the Netanyahu-Biden conversation last night:\n\nThe two discussed the activity of deploying American military defense for the defense of Israel in the face of threats.\n\nPresident Biden expressed his commitment to Israel's security against all Iranian threats.\n\nThe two discussed American support for Israel's defense against UAVs and ballistic missiles.\n\nBiden emphasized to Netanyahu the importance of reducing tensions in the region.\n\nVice President Harris participated in the conversation."}, {"id": "48fc8071-5193-45cd-b1df-760e4e7e653b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31618/", "date": "2024-08-02 06:24", "message": "Hamas is trying to leverage the assassination of Haniyeh to wake up the sleepy Arab street and bring it out to demonstrate\n\nHamas calls for a \"صلاة الغائب\" in honor of Ismail Haniyeh - a special funeral prayer held for a dead person who is not in his city (\"prayer of the absent\"). Hamas is calling for it to be held today in all mosques (in all countries), today after the Friday prayer and after that to go to extensive \"Day of Rage\" demonstrations.\n\nAlso, Hamas calls for tomorrow to observe the \"World Day for Gaza\" that Haniyeh announced last week before his elimination.\n\nHamas wants to fill the streets all over the world with green Hamas flags.\nWe will wait to see if there will be a response."}, {"id": "425bc437-6387-4226-8857-78e95f9e4c52", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31617/", "date": "2024-08-02 06:21", "message": "Turkey: The Ministry of Communications blocks Instagram after deleting millions of posts mourning Ismail Haniyeh.\n\n##\nErdogan was insulted on behalf of his friend..."}, {"id": "b4755bdf-56e8-40b2-b426-efcfbc929035", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31616/", "date": "2024-08-02 06:15", "message": "Further to this 👆\n\nThe Iranian news agency Fars claims that based on a preliminary investigation, it can be determined that Haniyeh was killed by a missile fired at the place where he was staying.\nFars does not specify whether it is a surface-to-air missile or whether it is a different missile, which means that Fars denies the bomb theory published yesterday by the New York Times and leaves the questions of \"where was the missile fired from and what missile was it?\" - open."}]