[{"id": "1887aa27-2211-40b1-9194-691a1b3c8a18", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32223/", "date": "2024-08-11 08:51", "message": "The area of ​​buildings A8 and A7 in the Hamad neighborhood in Khan Yunis - an area that was attacked this morning after an IDF spokesman in Arabic called the residents of the Hamad neighborhood to evacuate to the west.\nThe evacuation continues."}, {"id": "3876f6cb-bb10-4240-91ef-69a089970134", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32222/", "date": "2024-08-11 08:24", "message": "The sons of Ismail Haniyeh, who survived and inherited their father's empire of billions, arrived full of smiles to visit the President of Turkey."}, {"id": "cbb64b8d-369b-490f-afe3-c1eb7ddf3a79", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32221/", "date": "2024-08-11 08:23", "message": "Algeria asked to convene the UN Security Council next Tuesday for an urgent discussion on the \"massacre in the Daraj neighborhood in Gaza\" (the \"A-Taba'een\" school)."}, {"id": "0bbd3bd6-9b85-436a-b774-5d8e1c708868", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32220/", "date": "2024-08-11 07:15", "message": "Gazans began to evacuate the Hamad neighborhood in northern Khan Yunis following the IDF spokesman's announcement and the attacks in the area.\nPalestinian journalists report injuries as a result of the attacks in the Hamad neighborhood this morning."}, {"id": "6b7e4ac5-37dd-4872-9cda-eea148771140", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32219/", "date": "2024-08-11 06:48", "message": "IDF: IDF operational activities continue across the Gaza Strip\n\nIDF troops are continuing to conduct precise, intelligence-based operations in the Rafah area. This morning (Sunday), IDF troops identified a terrorist cell exiting a tunnel shaft in the area of Rafah. The IAF struck and eliminated the terrorists."}, {"id": "d753af2c-b870-4006-be0a-450875d33ff9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32218/", "date": "2024-08-11 06:46", "message": "Iran has issued a NOTAM message about a flight ban over the area of ​​the Iranian air base \"Nuja\" located near the city of Madan in western Iran.\nThe flight ban, at an altitude of ten thousand feet, will apply from August 11 to August 14 from eight in the morning to six in the evening, according to Iran time. According to the announcement, shooting will take place in this area.\n\n(Iranian time is half an hour ahead of Israeli time)."}, {"id": "f6c55fa1-a15f-47c9-8831-a9f9f397d11e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32215/", "date": "2024-08-11 06:42", "message": "The attacks in the Hamad neighborhood (the area that received an evacuation alert this morning), in the north of Khan Yunis"}, {"id": "a45d7a10-c403-4cf7-b94b-65b8138e2811", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32214/", "date": "2024-08-11 06:32", "message": "Trump's campaign team:\nMicrosoft has informed us that one of the campaign's many websites has been hacked by the Iranian government. They were only able to access public information.\nIran will not stop because we have a weak government... not for much longer."}, {"id": "4fe6980e-e910-4f1c-b9eb-1ca90c3fddf0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32213/", "date": "2024-08-11 06:32", "message": "This morning the Palestinians are reporting attacks in the Hamad neighborhood in northern Khan Yunis - this will surely help speed up those who are delayed..."}, {"id": "f292ab67-e6e6-45e0-8c74-7d6e67716bf8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32210/", "date": "2024-08-11 06:31", "message": "Hamad neighborhood in northern Khan Yunis before the war."}, {"id": "e11a0dac-e5e2-49d2-ad71-26199f0a7fc2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32209/", "date": "2024-08-11 06:30", "message": "This morning, the IDF spokesman published another evacuation notice in Arabic announcing the \"adjustment of the humanitarian space\" - in fact the part of the Hamad neighborhood, which was built with Qatari funding, was removed from the humanitarian area of ​​Khan Yunis and the residents are now required to evacuate.\n\nThe IDF explains in both evacuation announcements that it was rocket fire from these areas that led to the evacuation."}, {"id": "ac31e10a-4702-4667-a8c9-c3406a6b7c44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32204/", "date": "2024-08-11 06:28", "message": "Last night, shortly before midnight, the IDF spokesman issued an evacuation notice in Arabic for those staying in the Sheik Nasser, Barbakh and Ma'an neighborhoods in the center of Khan Yunis, in the south of the Gaza Strip.\n\nFollowing the evacuation alert, many Gazans in the center of Khan Yunis began to move west during the night."}]