[{"id": "32c71708-ddac-4325-b1ec-3481128edd2b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28301/", "date": "2024-06-02 19:59", "message": "Palestinian channels reported a short time ago about an Israeli attack that hit the house of Ibrahim Abu Nar (Abu Ayman) on El Ashrin Street, near the Alfarj Mosque in Nuseirat in the center of the Gaza Strip.\nAccording to sources in the center of the Gaza Strip, Ibrahim was killed, as well as his two sons and his wife. A fire broke out there."}, {"id": "cebba5af-f880-46cc-b763-585e6efee848", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28297/", "date": "2024-06-02 19:58", "message": "Portugal: Two planes collided and crashed today during an air show. One pilot was killed."}, {"id": "fe7e1a65-107c-4bdd-9e8d-157d6c5bb9d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28296/", "date": "2024-06-02 19:18", "message": "Elon Musk's satellites were spotted this evening in the skies of southern Lebanon, according to Lebanese channels."}, {"id": "ab9c2a60-c90a-4946-8b1d-aba6e4c5346d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28295/", "date": "2024-06-02 18:43", "message": "Uncharacteristic silence in the last day on the part of senior Hamas officials.\nSince Osama Hamdan's interview last night with Al Jazeera, there has been an unusual silence among Hamas and its leaders - no official statements."}, {"id": "a2f96f22-517c-4b53-94ba-061baff77121", "channel_id": 1560386984, "url": "", "date": "2024-06-02 18:42", "message": "A fire in southern Lebanon as a result of IDF shooting."}, {"id": "2e3ae101-a8c7-440d-844c-63931e4555f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28293/", "date": "2024-06-02 18:42", "message": "On the other side of the border, in southern Lebanon, there are extensive fires in the following villages:\nYaroun\nAyta ash-Shab\nRamiyeh\nOddaisseh \nHoula\n\n#symmetry"}, {"id": "25dbcab2-316c-4ac6-a6e5-2d75b4c684c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28292/", "date": "2024-06-02 18:39", "message": "Hezbollah has accepted responsibility as of an hour ago for ten attacks today in Israeli territory.\nBloggers identified with the Shia axis and involved in the military field estimate that Hezbollah is trying to damage the Israeli air defense systems and \"exhaust\" them under the assumption that Israel will soon carry out an extensive attack in Lebanon. The damage to the air defense systems will, in their view, reduce Israel's ability to defend itself in the face of a response from Hezbollah to such an attack."}, {"id": "7948e795-7fa5-4317-8f2f-b5298147457e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28291/", "date": "2024-06-02 18:38", "message": "The Palestinians report that the evacuation of the American hospital (a field fospital) located on the seashore in Rafah has begun after an evacuation alert was received from the Israeli side."}, {"id": "fc92b467-90b3-4aff-a166-89c44728cb84", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28290/", "date": "2024-06-02 18:37", "message": "The Revolution Square in Tehran was redecorated with a large billboard on the occasion of the 35th anniversary of the death of Ruhollah Khomeini - the creator of the Islamic Revolution in Iran, which will take place tomorrow."}, {"id": "ecb93835-6add-4f13-b248-ec13b27e7cd4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28287/", "date": "2024-06-02 18:36", "message": "In two weeks, the Muslim world will celebrate the Feast of the Sacrifice.\nThe first delegations of Palestinian pilgrims have already arrived in Mecca, in Saudi Arabia, to fulfill the commandment of Hajj - the pilgrimage to Mecca, on the last day of which the Feast of the Sacrifice falls.\nMany delegations of Muslim pilgrims will arrive in Saudi Arabia in the coming days to observe the Hajj, which is one of the five pillars of Islam."}, {"id": "32c361b8-c9c4-4b04-bcd1-bbc6167241a4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28286/", "date": "2024-06-02 18:35", "message": "The Hezbollah organization is implicitly threatening to infiltrate IDF posts on the border:\nThis evening Hezbollah published a video with a quote from one of Nasrallah's last speeches, according to which if Hezbollah operatives wanted to enter IDF positions, they would do so (meaning they have the capabilities - AA)."}, {"id": "e98372c6-a5b5-4eb3-9420-ace28ed2e610", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28285/", "date": "2024-06-02 15:25", "message": "Trump launched his TikTok account... during an event of the UFC - Ultimate Fighting Championship.\nThis is his first video."}, {"id": "8db859ad-d064-4b74-bda9-55964fdf9a4c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28284/", "date": "2024-06-02 15:23", "message": "A senior Egyptian source for Alghad newspaper:\n\nThe tripartite meeting in Cairo between Israel, Egypt and the US regarding the opening of the Rafah crossing has ended.\n\nThe Egyptian side continued to adhere to the demand that the Israelis withdraw from the Rafah crossing as a condition for the resumption of activity there.\n\nThe Egyptian side accuses Israel of being responsible for not bringing the goods from Egypt into Gaza.\n\nIt is necessary to act for the immediate introduction of 350 trucks a day from Egypt to Gaza."}, {"id": "7e927375-5c0c-435d-b96a-8d44f6419fd2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28283/", "date": "2024-06-02 15:22", "message": "Lebanese channels: Israeli Air Force planes break the sound barrier and release flares into the skies of southern Lebanon."}, {"id": "037dbe3a-4ac0-458e-a612-cf15bbc62af1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28282/", "date": "2024-06-02 14:17", "message": "One of the main streets in the Jabaliya refugee camp in the north of the Gaza Strip before the IDF forces entered, and after..."}, {"id": "1887560e-b62a-4078-a4f3-7f923b6f7461", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28281/", "date": "2024-06-02 14:16", "message": "The emergency committee of the municipalities of the northern Gaza Strip:\n\nWe hereby declare the Jabaliya refugee camp and Beit Hanoun as \"disaster areas\".\n\n50 thousand housing units were destroyed in the north of the Gaza Strip.\n\nThe roads and sewerage and water networks in most municipalities in the northern Gaza Strip were destroyed.\n\n35 water wells were destroyed as were the schools and UNRWA facilities in the northern Gaza Strip.\n\nFamine will soon threaten the north of the Gaza Strip.\nWe call on the UN and international organizations to intervene."}, {"id": "46638bb7-1a5e-4ed2-bdb2-27424fc752f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28280/", "date": "2024-06-02 14:16", "message": "One of the most popular videos this afternoon on Palestinian channels and channels affiliated with the Shia axis:\nA large fire in Qatsrin in the Golan Heights as a result of rocket launches by Hezbollah.\n\nHezbollah accepts responsibility for launching dozens of Katyusha rockets at the base of the Golan Division, located in the Golan Heights."}, {"id": "380795d4-0811-4394-9019-cc5ec4c68ee2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28275/", "date": "2024-06-02 14:14", "message": "North Korea vs. South Korea: Garbage balloons vs. loudspeakers \n\nIn the last day, the North Koreans launched over 600 \"explosive balloons\" filled with garbage towards South Korea.\nSouth Korea is considering responding by turning on powerful loudspeakers towards North Korea.\n\nIsrael has also tried this in the past against the activities of the Gazans who launched explosive balloons towards Israel.\nIt was not a great success..."}, {"id": "c6cba082-2ec7-46a5-a864-b5c29462ea3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28274/", "date": "2024-06-02 14:12", "message": "Ali Bagheri Kani, the new Iranian foreign minister (replacing the minister who was killed in the helicopter crash) will arrive tomorrow for his first official visit to Beirut since he was appointed to the position.\n\nThe Iranian foreign minister who crashed had a scheduled visit to Beirut three days after the accident."}, {"id": "d0a947bc-3680-454f-b4c3-e70f09601de8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28272/", "date": "2024-06-02 14:10", "message": "Lebanese channels are reporting casualties in the IDF attack in Meiss el-Jabal in southern Lebanon earlier today."}, {"id": "2f17d9ef-299c-4057-937b-61fb8090e6c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28271/", "date": "2024-06-02 14:09", "message": "The presidential elections in Iran:\n\nIn the last presidential elections, of the 10 candidates who reached the final stage of running in the elections, three of them were blocked (including Mahmoud Ahmadinejad).\n\nOut of the 10 of 2021, there was Ebrahim Raisi and among the 9 remaining besides him, four have already registered for the current presidential race:\nSaeed Jalili\nAlireza Zakani\nAbdul-Nasser Hemmati\nMahmoud Ahmadinejad\n\n##\nAccording to the estimates of foreign commentators dealing with the Iranian arena, there is a significant chance that Ahmadinejad will be blocked from running for president again. Alireza Zakani and Abdul-Nasser Hemmati are regular \"contestants\" to give a sense of democracy.\n\nThe interesting candidates as of this moment (among those who have already registered) are Ali Larijani and Saeed Jalili (I expanded on them here last week). Muhammad Ghalibaf, the Speaker of the Parliament has not yet announced that he will run, but he is \"warming up on the sidelines\" and could be a significant contender.\nBy the 12th of the month we will get a complete picture - and we will know who the supreme leader allows to run..."}, {"id": "7fe863e0-f709-49fb-ad38-051d51154bb8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28269/", "date": "2024-06-02 12:02", "message": "Lebanese channels report two deaths in an IDF attack in Kfar Houla in southern Lebanon in the last hour.\n\nA reporter for the Lebanese Almanar channel (Hezbollah-affiliated) claims that the dead are civilians (shepherds).\n\nAttached is the picture of the dead: Muhammad and Mustafa Kasem (two brothers)."}, {"id": "c68658b7-7123-43e7-bf35-cad04eba1cb4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28267/", "date": "2024-06-02 09:24", "message": "Following what I wrote here 👆 this morning on the subject of consciousness, the IDF publishes its response to the downing of the Israeli drone:\n\nIn response to Hezbollah firing a surface-to-air missile at an IDF UAV that was operating in Lebanese airspace yesterday (Saturday), IAF fighter jets struck a military compound used by the Hezbollah terrorist organization in the area of Beqaa in Lebanon. \n\nMoreover, IAF fighter jets struck an additional Hezbollah military structure in the area of Bint Jbeil and command centers in the areas of Qana and Baraachit in southern Lebanon overnight.\n\n##\nComplex, building and headquarters + black and white videos....\n\nI don't know what they attacked, but the results presented here, in this manner, by the IDF spokesperson, do not communicate consequences and do not convincingly deter."}, {"id": "cec24c74-0395-4690-87a6-4d06c58ef6d2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28266/", "date": "2024-06-02 09:16", "message": "The New York police against more \"keffiyehs\" yesterday in Brooklyn."}, {"id": "346e5fbc-0699-4f67-b246-b19ca1efbb45", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28265/", "date": "2024-06-02 09:15", "message": "Iceland, not only a land of volcanic eruptions:\nThe police spare no tear gas to disperse an anti-Israel demonstration yesterday in the capital Reykjavik."}, {"id": "4fc0ea99-2e6d-4f5f-a86a-a6c2a9809ddc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28264/", "date": "2024-06-02 09:14", "message": "Italy: Rome police officers are forced to use tear gas to hold back a violent anti-Israel demonstration."}, {"id": "e255d0f8-d66f-47be-bb74-cde07500cb93", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28263/", "date": "2024-06-02 09:14", "message": "At the University of Chicago, the local police officers had to deal with the keffiyehs who shout at them:\nShame on you\nShame on you"}, {"id": "f91d8be7-01ad-4248-b814-e1c6efa1b4b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb67992/", "date": "2024-06-02 09:12", "message": "Columbia University in New York:\nWith the warm support of the Supreme Leader of Iran and Nasrallah, the tent camp was re-established, this time it was called the \"Revolution Camp for Rafah\".\n\nThe woman in the attached video, who opposes the activity, shouts at Hamas supporters in the \"Rafah Camp\":\nRapists... I hope you get raped..."}, {"id": "ccbbb1ad-479a-4e72-aed0-cc8b4bf2299c", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb67992/", "date": "2024-06-02 09:09", "message": "The former president of Iran, Mahmoud Ahmadinejad, submitted his candidacy for the Iranian presidential elections this morning."}, {"id": "850dfb96-1afa-4a2d-b165-7bfa692e426d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28258/", "date": "2024-06-02 07:00", "message": "The Arab preoccupation with the photo of the body published last night by the military wing of Hamas continues.\n\nThe prevailing claim on social media is that the body presented by the military wing of Hamas, allegedly of a \"kidnapped soldier\", is that of an Arab mercenary.\n\nIn the attached tweet, which was seen by 1.2 million people in less than a day, the discussion about the origin of the mercenary in the hands of Hamas was discussed.\nThe leading options in the comments:\nEgyptian\nSaudi\nMoroccan\nPalestinian\nEmirati"}, {"id": "29338340-3f8d-4701-a8a8-e27b3ae12c68", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28257/", "date": "2024-06-02 06:57", "message": "Jabaliya refugee camp in the north of the Gaza Strip: Gazans are cleaning their houses after the IDF forces left - they want to go back to living there."}, {"id": "0f79a052-5a61-4a84-b3f3-0fbc37a575fb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28256/", "date": "2024-06-02 06:56", "message": "Nablus: A Palestinian officer was killed in a ramming\n\nSources associated with Fatah claim that Ahmed and Mustafa Hamdan, brothers who live in Nablus, ran over Ra'ad Hakim, an officer in the Palestinian security apparatus, to death last night, because it was revealed that in the past that they had sold land to Jews.\n\nThese sources claim: the Palestinian officer who was run over to death was previously arrested by Israel \"and was warned not to harm collaborators\"."}, {"id": "21d166d8-5e90-4fea-95ca-388a515d1c13", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28255/", "date": "2024-06-02 06:54", "message": "The president of Belarus, Lukashenko, a close ally of Putin, prepares for winter and chops firewood with a locally made ax, which he praises but adds, it could be better."}, {"id": "e36aca93-7f4c-4c23-b9a2-793aa9de15cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28254/", "date": "2024-06-02 06:51", "message": "The Shiite militias in Iraq accepted responsibility for launching a UAV towards Eilat early in the morning."}, {"id": "fa83e6df-c25b-46fa-a14b-d7a99e149eb5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28253/", "date": "2024-06-02 06:50", "message": "It is important to note that from the consciousness aspect that Hezbollah is proud, and rightfully so, of shooting down a \"prestigious\" Israeli Hermes 900 type UAV - a clear achievement, easy to explain and market to the outside world.\nOn the other hand, the IDF explains that \"significant assets were attacked\" - a vague description that may actually be worth more than the downing of the Hermes but is very far from the psychological effect achieved by the downing of the UAV.\nThe public in Israel and those who oppose Hezbollah wants to know how Hezbollah \"paid\" for the their actions. This is also important for the Lebanese domestic audience in terms of deterrence. The IDF does not present its achievements on the Lebanese side in a clear way, compared to Hezbollah which makes excuses for every attack it carries out and makes sure to document it well and edit its videos as first class marketing material."}, {"id": "79b628dc-1f1b-4bfe-bf7c-07a9f89c4bc5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28249/", "date": "2024-06-02 06:48", "message": "In the early morning, Lebanese channels reported on another Israeli attack, this time in Bint Jabil in southern Lebanon, which they described as \"violent\".\n\nAt the same time, despite the many attacks by the IDF throught the day yesterday, no deaths were recorded on the Lebanese side - only wounded. The last death in Lebanon was as a result of an attack on Friday."}, {"id": "02ea9bda-822d-4d0a-b8a9-ef45b2bdcbba", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28248/", "date": "2024-06-02 06:47", "message": "Documentation of last nights attacks in Baalbek.\n\nIn addition, Lebanese media report on a series of attacks by the IDF in southern Lebanon."}]