[{"id": "c361cb93-d292-4682-b7a2-e2547c11d29d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27418/", "date": "2024-05-18 14:04", "message": "The Palestinians report that 5 Hamas policemen were killed in an IDF attack earlier today on Ishrin Street, in the center of Nuseirat (the center of the Strip) near the \"Al Iman\" flour mill."}, {"id": "0199d2c2-795a-416e-a216-0277138eff85", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27417/", "date": "2024-05-18 13:50", "message": "Jenin: Combat engineers of the Palestinian Authority police arrived in the area of ​​Yahya Ayash square in Jenin following a report that a bomb had fallen from a fighter plane was located there."}, {"id": "0d1b149a-e301-4e5e-89a0-192e82e2206b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27416/", "date": "2024-05-18 13:48", "message": "The Palestinians report 22 dead in the attack on the house of the Al-Silawi family in the Jabaliya refugee camp in the northern Gaza Strip, not far from the Kamal Adwan hospital."}, {"id": "cc404b53-17da-4fa8-bae2-477b6d691af7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27413/", "date": "2024-05-18 13:44", "message": "IDF Spokesperson: The Givati ​​Brigade has killed about 80 terrorists in East Rafah.\nSignificant underground infrastructures were located.\nMany weapons were located, including a large number of anti-aircraft weapons (pictured)."}, {"id": "b4b9dfa0-b554-44be-9f10-5a9c245a1fd8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27409/", "date": "2024-05-18 13:43", "message": "Lebanese media: Israel attacked a vehicle in the last minutes in the duty free zone on the border between Lebanon and Syria.\n\nFollowing reports state the attack was carried out in Syrian territory immediately after the vehicle entered Syrian territory from Lebanese territory.\n\nAl-Saudi Arabia Network: The target of the attack on the Syria-Lebanon border was saved."}, {"id": "5c2b5693-b0a3-4364-96ce-c77ef895fcb2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27408/", "date": "2024-05-18 13:41", "message": "The markets in the center of the Gaza Strip are full of goods from Israel - consumer prices are falling\n\nA five minute tour in the market of Deir al-Balah in the center of the Gaza Strip this afternoon.\nThe goods from Israel fill all the baskets in the market.\nAccording to the Gazan filming the video, there is a noticeable drop in prices in the market following the arrival of goods from Israel (not humanitarian aid, but goods purchased from Israel by Gazan merchants).\nAccording to him, there are fruits that have not been seen in the Gaza Strip since the beginning of the war.\nThe Gazan filming says that Gazans need more quality goods from Israel as they have been coming in the last few days. If more goods come in from Israel, he expects that the prices will continue to fall.\n\nThe prices in the market, based on the video:\n\nApple - 15 NIS per kilo\nLemon - 20 NIS per kilo\n5 eggs - 10 NIS\nClementine 20 NIS per kilo\nAvocado 25 NIS per kilo\nMelon - 9 NIS per kilo\nSugar - 9 NIS per kilo"}, {"id": "0dc41493-6e06-4158-83d6-b816da9934fb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27407/", "date": "2024-05-18 13:34", "message": "The Deir al-Balah area in the center of the Gaza Strip is filling up with tents and Gazans who came from Rafah."}, {"id": "39e3eea2-890c-4eb8-b0da-e93d94512c8c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27406/", "date": "2024-05-18 13:33", "message": "The Philadelphia axis area in Rafah in the south of the Gaza Strip is becoming empty of Gazans and tents."}, {"id": "fcdae018-9df1-487c-8d89-c75a76b36a57", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27405/", "date": "2024-05-18 13:33", "message": "Prime Minister of Slovenia: We will recognize a Palestinian state next month."}, {"id": "fa9aaba3-fc99-47f0-b8fd-67b1b1cb5fc4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27404/", "date": "2024-05-18 13:32", "message": "On the other side, the words of the Israeli Knesset member Ram Ben Barak stand out today and are echoed on many Arab channels:\n\n\"Our war in Gaza is pointless. And of course we will lose it.\n\nWe are returning to fight in areas where we have already fought, we are losing many soldiers and our economy is collapsing.\n\nWe are losing in the international arena and our relations with Washington are collapsing. We have not achieved any success.\""}, {"id": "4f965280-3bce-4708-9244-755e2921e215", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27403/", "date": "2024-05-18 13:28", "message": "Senior Hamas official Khaled Mashal:\n\n\"We are facing a historic moment and there is an opportunity to defeat Israel and dismantle the Zionist project. Our enemy is retreating and losing its self-confidence after 8 months of fighting. We call for (demonstrations of) outrage by the Arab public around the Israeli-American embassies.\"\n\n##\nEverything revolved around the firm stance. Whoever is patient will win. Whoever gives up and surrenders will lose. It is a campaign about willpower and patience.\nA campaign whose results will affect how the Middle East (and Israel within it) will look in the decades to come."}, {"id": "f2b21aa1-4fd6-4510-ab31-efe3a7237ba5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27402/", "date": "2024-05-18 13:26", "message": "The Saudi prince Turki bin Salman with his new Tesla  cybertruck..."}, {"id": "ab3ed633-1a78-4d5e-b1bf-ae189a00759e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27399/", "date": "2024-05-18 11:23", "message": "Israeli goods fill the markets of the center of the Gaza Strip (imported by Gazan merchants via the Kerem Shalom crossing).\n\nChips, sugar, chicken liver and wings - all Israeli!"}, {"id": "449c0538-e56e-4b71-8435-46a841a6e6f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27398/", "date": "2024-05-18 11:22", "message": "In the last hour, the Palestinians report 12 casualties in an IDF attack on the \"Ikara\" library in the Jabalia refugee camp in the northern Gaza Strip, where a shelter for displaced Gazans is located.\n\nIn another incident, the Palestinians are reporting that a Gazan named Azami Khalil Abu Daqa was killed in an attack on a vehicle near A-Shahkoosh Street in the northwest of Rafah. Four more Gazans were injured."}, {"id": "0af8446f-1f93-4379-a0a0-d9b5d879bf5d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27393/", "date": "2024-05-18 10:32", "message": "The remains of the command room that was targeted yesterday in an airstrike in Jenin's A-Damaj neighborhood."}, {"id": "97c6f12c-6e3d-495b-b9d3-8cc9fbfd28bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27392/", "date": "2024-05-18 10:31", "message": "The Palestinian Crossings Authority: The Kerem Shalom crossing has been closed to aid trucks for 12 days in a row.\n\n##\nOver the past few days, about 50 trucks of goods have entered through the crossing every evening, for merchants within the Strip. \n\nThis refers to the goods that were paid for and it is not the free humanitarian aid that the Gazans were used to during the first months of fighting.\n\nRafah crossing is still closed."}, {"id": "18ff3134-2044-499a-8f26-b423679483b5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27391/", "date": "2024-05-18 10:30", "message": "The Palestinians are wondering why aid trucks at the floating pier have yellow (Israeli) license plates..."}, {"id": "06c7d2c5-a136-42d8-8e21-0b3ac4ecb591", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27390/", "date": "2024-05-18 08:04", "message": "The beginning of the operation of the American floating pier in Gaza. Footage from yesterday."}, {"id": "1b5ac59e-1d70-41bb-ac49-1de2bf6ae51b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27387/", "date": "2024-05-18 08:03", "message": "The assassination of Sharahabil a-Seid 👆 in Lebanon near the border with Syria\n\nThe IDF spokesman announced last night that the IDF attacked and eliminated the terrorist Sharhabil Ali A-Seid, a senior member of the terrorist organization the Islamic Jama'a in Lebanon - who worked in cooperation with Hamas.\n\nThe military wing of Hamas officially announced this morning that A-Seid was in fact a commander in its ranks."}, {"id": "55e06f3a-ddca-4bd7-949d-0a152200a67d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27386/", "date": "2024-05-18 07:43", "message": "The IDF spokesman reported last night that the attack in Jenin was carried out using a fighter jet and a helicopter . \n\nAccording to the report, the terrorists' command room was targeted in the attack. According to intelligence reports, the men, who were still inside the command room, were preparing an immediate attack."}, {"id": "afd26bdf-5488-42cf-8a06-56fed903c832", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27385/", "date": "2024-05-18 07:39", "message": "Palestinian channels:\nFIFA, the International Football Federation, refuses the Palestinian request to vote on the suspension of Israel's membership in the federation.\n\nAccording to FIFA, the issue should be examined by the FIFA Council."}]