[{"id": "35642faa-0951-4618-8c89-0520757920e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26690/", "date": "2024-05-05 08:12", "message": "The IDF and Israeli Shit Bet announce that senior Islamic Jihad commander Aiman Zaarab was killed in a targeted strike,\n\nAccording to the announcement, Zaarab took part in the Oct. 7th attacks, and lead terrorist from the PIJ's elite Nukhba Force in their attack on the Kibbutz of Sufa and a neighboring military outpost."}, {"id": "02cb5956-9f36-4b95-8d0b-faf8380a274d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26689/", "date": "2024-05-05 08:09", "message": "The Lebanese report a number of wounded in an Israeli attack in Meiss Ej Jabal in southern Lebanon, which took place about an hour ago."}, {"id": "e4ebd834-b955-4a6b-b73d-f57a2431ea5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26688/", "date": "2024-05-05 08:07", "message": "The Palestinians report: an Apache helicopter attacked targets in Rafah in the southern Gaza Strip this morning."}, {"id": "7e87021b-8c77-46e0-bd20-933dce5afd4f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26687/", "date": "2024-05-05 08:06", "message": "Hezbollah's answer to the French proposal\n\nSources report that tomorrow morning Nabih Berri, the Speaker of the Lebanese Parliament (and the head of the Shiite Amal movement, fighting against Israel alongside Hezbollah) is expected to deliver Hezbollah's and the Amal movement's response to the French proposal for a cease-fire with Israel.\n\nAccording to Arab sources, the answer is likely to be that Lebanon is bound by UN Resolution 1701 and that the document will be the basis for negotiations after there is a ceasefire in Gaza.\n\n###\n\nResolution 1701, which ended the Second Lebanon War, spoke of 15,000 armed UNIFIL soldiers with powers south of Litani river, tasked with preventing the introduction of weapons and the presence of Hezbollah militants in the area - which were both violated. If Resolution 1701 had been enforced, we would not have reached the situation we are in today, with a massive deployment of Hezbollah in the south to the Litani.\n\nThe current situation shows how invaluable such agreements are - they shouldn't be taken seriously as they do not hold water.\n\nI suggest that France and the US, who are so keen on ending the fighting in Lebanon with a diplomatic solution, put themselves as guarantors to any new ceasefire agreement - so that any violation of the agreement will be met with with a French or American aerial strike. \n\nI wonder if they'd be willing to agree to this."}, {"id": "c269f643-4bdb-4b67-bffc-ca6cc11b68b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "The Shiite militias in Iraq claim to have attacked the Israeli port of Haifa yesterday evening with a cruise missile."}, {"id": "1efad064-b590-4fe5-91d7-d2c52fa83ee1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "University of Virginia, US:\n\nPolice officers armed with transparent plastic shields slowly advance in a single line towards anti-Israeli protesters armed with umbrellas, chanting \"shame, shame\".\n\n##\nLike a medieval battle..."}, {"id": "fb2637cd-d843-4e05-8c77-d89c5f3a5b76", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26684/", "date": "2024-05-05 07:55", "message": "A senior Hamas official told the American CBS network about the negotiations in Cairo:\n\nNo progress was made in the current round of talks on Saturday.\nAnother round will be held on Sunday (today).\n\n###\nAccording to Al-Arabiya, Hamas requested an additional period of time to examine some of the clauses before giving its final answer to the proposal."}, {"id": "f5891c46-0b12-4fe8-8e91-08ceb53e9e05", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26683/", "date": "2024-05-05 02:31", "message": "The follower Ben Zion Mekels points out that in the past week you can see in satellite images a new road that was broken (by IDF forces) in the area of ​​the Kerem Shalom crossing (near Rafah).\n\nGetting ready for Rafah..."}, {"id": "9128bfa7-b034-416a-83ac-d3596c234958", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26681/", "date": "2024-05-05 00:04", "message": "USA: The police of Wisconsin do not make exceptions for academic staff: Samir Elatot, professor of sociology at the University of Wisconsin was arrested after taking an (over) active part in anti-Israel demonstrations."}, {"id": "c1580a95-55e3-4444-894a-00d2709ff320", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26680/", "date": "2024-05-04 22:02", "message": "A photo that caught on among Gazans on Facebook... The Chief of Staff at a table on the beach of Gaza.\n\nA prominent Gazans asked: Where are the Al Jazeera experts who will give an interpretation of the picture?"}, {"id": "d14a2d0c-c1cf-476e-9eb2-9b75e69a0f53", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26679/", "date": "2024-05-04 22:00", "message": "Al Jazeera from a Hamas official:\n\"The movement will in no way sign an agreement that does not sincerely include the cessation of the war in Gaza.\""}, {"id": "b03e5994-3739-4082-a637-2e249978a049", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26678/", "date": "2024-05-04 17:47", "message": "Palestinian channels report: The IDF attacked the home of the prominent journalist in the Gaza Strip, Hassan Aslih (Hamas-affiliated) in the Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.\nThere were no casualties in the attack."}, {"id": "8f73455b-0c27-42cf-840a-f658947590db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26677/", "date": "2024-05-04 17:31", "message": "Palestinian channels: The Palestinian Authority's security mechanisms detonated, in a controlled manner, explosive devices they located in Tubas (Northeastern Samaria)."}, {"id": "5f2da1ac-cdd6-4f7d-a73e-4cf94c61d70d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26676/", "date": "2024-05-04 17:20", "message": "Hamas-identified channels: All four killed (whose names have been published) 👆 in the IDF's activity in the village of Deir al-Ghusun in the north of Tulkarm, were operatives of the military wing of Hamas.\nAlaa Sharitah was the commander of the military wing of Hamas in Tulkarm."}, {"id": "a1169e79-dad5-461b-952a-c0284bc3575b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26675/", "date": "2024-05-04 17:19", "message": "Further to this👆\nA joint statement to the IDF spokesperson, the police spokesperson and the Shin Bet spokesperson:\n\nThe soldiers of Yamam, the IDF and the Shin Bet eliminated five terrorists who had barricaded themselves in a building in Tulkarm in a 12-hour battle\n\nThe soldiers of the Yamam, IDF and Shin Bet, under the precise intelligence guidance of the Shin Bet and IDF Intelligence, operated for over 12 hours in Tulkarm in a targeted activity to defeat a terrorist cell.\n\nThe soldiers closed in on a building where the terrorist squad was entrenched, which opened fire on them. The fighters responded by shooting with shoulder-fired missiles and other means from the building, and at the end of the exchange of fire, the five terrorists were eliminated.\nMilitary equipment and weapon parts were confiscated.\n\nDuring the activity, an IDF fighter was injured and brought to continue receiving medical treatment in a hospital; his family was informed."}, {"id": "651fade1-206b-44ca-9d06-28f3ca3e3e44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26674/", "date": "2024-05-04 16:10", "message": "The Palestinians publish the names of four of the \"martyrs\" who were killed in the IDF operation tonight in the village of Deir el Ghusun in the north of Tulkarm:\n\n1. Alaa Sharith (the leftmost one).\n2. Tamer Fuqaha (next to Alaa' - both are behind the attack in which Elhanan Klein fell in November 2023. Tamer is also an operative of Erin al Aswad).\n3. Adnan Samara\n4. Asal Badran\n\nIn addition, there is the \"headless martyr\" who has not yet been identified - DNA tests will be conducted on him to confirm his identity."}, {"id": "b738c76d-d90d-4d4e-8a91-c35640021d9d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26673/", "date": "2024-05-04 15:36", "message": "The Palestinians report that the IDF forces have finished their activities in Deir al-Ghusun in the north of Tulkarm and have left.\nSources in Tulkarm say that the Palestinian rescue forces located another Palestinian \"martyr\" among the ruins, apparently headless."}, {"id": "ef1b38ed-b93d-4409-b7eb-467ec702c161", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26672/", "date": "2024-05-04 14:06", "message": "The Palestinians report that the person who came out from under the ruins of the house in Deir al-Ghusun and was arrested by IDF forces is the released prisoner Salma Badran, an operative of the military wing of Hamas with a \"heavy\" family lineage: he is the brother of the two \"martyrs\" of the wing - Fawaz and Seif Allah Badran. Salma is the owner of the apartment where the Hamas terrorists hid last night and which the IDF destroyed.\n\nFawaz (Salma's brother) was one of the senior bomb engineers of the Izz ad-Din al-Qassam Brigades in the West Bank and was the one who assembled the explosive device that exploded in the first suicide attack of the second intifada (March 2001), in which 3 Israeli citizens were killed in Netanya. Fawaz was also the one who recruited the suicide bomber for the attack and also guided other suicide bombers in Tulkarm. He was eliminated by the Israeli security forces that year using an explosive device planted in his car."}, {"id": "fea352ca-7f55-47a3-b0fa-8099718e151f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26671/", "date": "2024-05-04 14:00", "message": "The official Palestinian news agency Wafa: 6 Palestinians were killed in the IDF operation in the village of Deir al-Ghusun in the north of Tulkarm."}, {"id": "54d6bd74-25f7-4326-b900-6fdfad04c66f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26668/", "date": "2024-05-04 13:56", "message": "More footage from Deir al-Ghusun north of Tulkarm from the IDF operation today."}, {"id": "48e4cef9-7ee6-4d10-82fb-b1469448215a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Palestinian sources in Tulkarm claim that Tamer Fuqaha, an operative of the military wing of Hamas, (and the terrorist who carried out the attack in which Elhanan Klein fell on November 2, 2023), was killed in an IDF operation tonight in the village of Deir al-Ghusun in the north of Tulkarm."}, {"id": "4773f148-f165-4317-bdec-0534480e454c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Deir al-Ghusun north of Tulkarm:\nThe IDF forces packed the body of the Palestinian who was killed in the area of ​​the building.\n\nPalestinian sources claim the IDF forces took 3 bodies.\n\nIDF forces then arrested a Palestinian who emerged from under the ruins of the house that the forces had besieged for many hours."}, {"id": "308a2430-9a2a-43ed-9899-d6b660b7beca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26661/", "date": "2024-05-04 13:10", "message": "The \"Holy Fire\" ceremony held today in the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\" that Christians celebrate today."}, {"id": "73febcaf-0f0a-4f84-92e7-439d8df2130b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26658/", "date": "2024-05-04 13:07", "message": "For nearly ten hours starting last night, IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\nAccording to the estimates, the terrorists Tamer Fakha and Alaa Sharitah, the operatives of the military wing of Hamas involved in the shooting attack in which Major General Elhanan Klein was killed near Beit Lid on November 2, 2023, were hiding in the house.\nSources associated with Hamas and Islamic Jihad operatives claim that the two managed to escape from the house which was surrounded by the IDF for many hours and fired upon by a large number of missles (and finally destroyed with a bulldozer - in the attached videos you can see the shooting and the demolition the house)."}, {"id": "26080395-2be4-40e9-9829-41d926a29fd4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26657/", "date": "2024-05-04 13:02", "message": "The Al Jazeera network claims: an Israeli drone launched a missile a few hours ago at a vehicle in Bint Jabil in southern Lebanon.\n\nUnofficial Lebanese sources: No casualties."}, {"id": "438a9a27-9a2e-4ffd-8c2c-4bbc02c157fe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26656/", "date": "2024-05-04 12:30", "message": "The Qatari Al Jazeera cites a report by Reuters according to which Qatar is considering closing the offices of the political office of Hamas in its territory as part of an overall plan to continue its function as a mediator in the conflict between Hamas and Israel."}, {"id": "861bf77c-519e-4f40-b77d-56027bceb644", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26655/", "date": "2024-05-04 12:29", "message": "At least 3 different Israeli military reporters publish the exact same message:\n\nPolitical actor:\n\nContrary to the publications, Israel will under no circumstances agree to the end of the war as part of an agreement to release our abductees.\n\nAs the political echelon decided, the IDF will enter Rafah and destroy the remaining Hamas battalions there - whether or not there will be a temporary respite for the release of our hostages."}, {"id": "68286f53-ca56-4f18-8174-8f439295a234", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26654/", "date": "2024-05-04 12:28", "message": "Heavy political pressure on Israel from all directions to silence all sectors, (mainly) at the expense of the Israeli interest. It will only get worse."}, {"id": "2e3bf7b7-29eb-4467-85cc-76ebc55505a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26653/", "date": "2024-05-04 12:27", "message": "Today, Lebanese sources report: Hezbollah will soon submit its comments to the French proposal to end the war in southern Lebanon\n\nJournalist sources in Lebanon state that Hezbollah and the Amal movement discussed the French proposal and decided not to reject it (so as not to be perceived as refusers - AA) but to submit 10 comments to amend the proposal.\nThe comments will be forwarded to the Speaker of the Lebanese Parliament (who happens to also be the head of the Amal Shiite movement fighting alongside Hezbollah in southern Lebanon - AA) and he will discuss them with Prime Minister Mikati and forward them to the French side."}, {"id": "1c84311a-7492-49fe-a3b0-54a4cd076677", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26652/", "date": "2024-05-04 12:26", "message": "Yesterday, Lebanese Al-Akhbar newspaper publishes the French proposal for a ceasefire between Israel and Hezbollah\n\nThe Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, once again manages the agenda regarding the ceasefire agreements with Israel and reveals the details of the French proposal to end the war between Israel and Hezbollah in southern Lebanon.\n\nThe proposal includes three stages:\n\nFirst step (according to areas of responsibility)\n\nHezbollah the militias in South Lebanon stop the fire and allow UNIFIL to move freely in South Lebanon without restriction.\n\nIsrael will stop its attacks on Lebanese territory and stop jamming the radar in Lebanon.\n\nUNIFIL will increase patrols in southern Lebanon.\n\nSecond stage (within 3 days from the start of the first stage)\n\nHezbollah militias will dismantle all their facilities near the blue line, including observation towers and tents.\nAll military operatives, including the Radwan force, as well as equipment that enables the remote launch of anti-tank missiles, will be moved north beyond the ten-kilometer line from the border with Israel.\n\nIsrael will stop air flights over Lebanon.\n\nLebanon will begin deploying 15,000 soldiers on its behalf in southern Lebanon, south of the Litani River with the support of UNIFIL and international agencies.\n\nUNIFIL will resume its participation in the meetings of the tripartite mechanism (with Israel and Lebanon) and logistically assist the deployment of the Lebanese army south of Litani.\n\nThird stage (within ten days)\n\nThe renewal of the negotiations between Israel and Lebanon for the registration of the land border based on the negotiations that took place in 2017.\nBeginning of negotiations on the establishment of a zone free of armed military militias south of Litani (with the exception of the Lebanese army and UNIFIL forces).\n\nSupport for social and economic development in southern Lebanon."}, {"id": "f058e7d9-7955-45cb-9add-7181fb99cdb8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26651/", "date": "2024-05-04 12:20", "message": "The Saudi Asharq channel:\n\nHamas will announce within hours that it accepts this deal after receiving American guarantees for the end of the fighting and the complete withdrawal of IDF forces from all parts of the Strip at the end of the third and final phase of the deal, without the return of Israeli forces to the territory of the Strip.\n\nIt was also reported that Israel removed its objection to some of the names of the prisoners that Hamas demanded to be released in the deal - something that made progress possible."}, {"id": "5dfff21b-1371-44c5-99bc-16310ea161f2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26650/", "date": "2024-05-03 20:33", "message": "The Saudi Asharq channel from its sources:\nHamas obtained American confirmation through the Egyptian and Qatari mediators that the term \"sustainable peace\" that appears in the agreement is in fact a permanent ceasefire.\n\n##\nI remind you, this will make or break the agreement.\nIf Hamas receives guarantees not to resume fighting, it will sign the agreement.\nThere are no disputes between the parties regarding the other sections."}, {"id": "78a6a09c-b9fe-4cb5-ba5d-c6300b115633", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26649/", "date": "2024-05-03 20:30", "message": "Documentation of one of today's attacks in the area of ​​the displaced persons' tents in Rafah in the south of the Gaza Strip - note the rocket rising into the sky. This indicates a precise hit by the aircraft on the target."}, {"id": "b2f68741-1b35-4d18-ae8e-896427ab7a51", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26648/", "date": "2024-05-03 20:27", "message": "Hamas in an official announcement:\n\nIn light of the recent contacts with the mediators, tomorrow a delegation of the movement will arrive in Cairo to complete the talks.\n\nWe emphasize that the leadership of the movement reacted in a positive spirit to the proposal it received while discussing it. We are going to Cairo in the same positive atmosphere to reach an agreement.\n\nWe are determined to reach an agreement that will realize the demands of our people for a total cessation of aggression, the withdrawal of forces, the return of the displaced, aid to our people, the beginning of the reconstruction of the Gaza Strip and a serious exchange deal."}, {"id": "9f502114-c7eb-4919-abee-c22091f08e82", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26645/", "date": "2024-05-03 19:03", "message": "Gazans complain: as part of the food packages distributed at UNRA schools, we received a food product that contains pork 🐷...\n\nحسب الله ونعم الوكيل"}, {"id": "c658988b-baaa-42bf-982b-c383ada9f032", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26644/", "date": "2024-05-03 17:44", "message": "Reuters from a senior Hamas official: a Hamas delegation will arrive in Cairo tomorrow."}, {"id": "baaa32df-a7ab-4d73-be22-ee20ed62a4c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26643/", "date": "2024-05-03 16:51", "message": "The Houthis clarify the words of the Houthi military spokesman and point out that starting today every ship that docks in an Israeli port will be \"marked\" and as soon as it passes through an area within the reach of the Houthis it will be attacked even if it is not on its way to an Israeli port at the time.\n\nIf Israel enters Rafah, the next step for the Houthis will be to attack all ships belonging to companies that even one of their ships docks in Israeli ports."}, {"id": "5ec8b641-d316-4dfd-a40b-45cadb161a07", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26642/", "date": "2024-05-03 16:36", "message": "One of the signs of abundance in the northern Gaza Strip: Gazan donkeys receive fresh pita bread\n\nA Gazan from the north of the Gaza Strip to the donkey: once (when there was a shortage of bread) we ate from your food, now take and eat bread from today. You are better than many people..."}, {"id": "0952976e-c3cd-4050-80af-0d5a54ff1e56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26641/", "date": "2024-05-03 16:28", "message": "American Central Command:\n\nDue to weather conditions, construction work on the floating pier off the coast of Gaza was stopped and it was moved to Ashdod port, where its construction will be completed.\n\nAfter the completion of its construction, it will be floated along the shores of Gaza to the place where it was planned to be placed."}, {"id": "cf438971-410d-43ee-b032-35c52f39a99b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26640/", "date": "2024-05-03 15:56", "message": "Reuters from an Egyptian source:\n\nThe head of the CIA, William Burns, arrived in Cairo to promote the ceasefire in Gaza.\n\n##\nThe Americans are using all their weight and are firing their heaviest guns to reach a ceasefire."}, {"id": "fecc36f7-626b-4467-ae51-cb6d32467bf1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26639/", "date": "2024-05-03 15:55", "message": "The Palestinian Ministry of Health in Gaza:\n26 dead in the Strip in the last day.\n\nThe number of deaths in the last few days:\n28\n33\n47\n34\n\nTotal dead in the Gaza Strip since the beginning of the war: 34,622. Total wounded: about 78 thousand.\n\n##\nIn the last day, the number of dead was the lowest in the Gaza Strip since the beginning of the war (with the exception of the hodna period in November 2023)."}, {"id": "d864fccb-740a-4421-818b-0b6f0338f8dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26638/", "date": "2024-05-03 15:14", "message": "The American Wall Street Journal:\n\nIsrael gave Hamas an extension of one week that will end this coming weekend to respond to the proposal it submitted.\n\nYahya Sinwar has not yet responded to the Israeli proposal.\n\nAccording to the newspaper, Hamas is asking for American guarantees for the non-renewal of fighting after the upcoming deal, since in its view the clause in the proposal surrounding the matter is \"too vague\" and allows Israel to return to fighting."}, {"id": "bdbc3ff8-3939-49ec-a520-7980d1e019c0", "channel_id": 1560386984, "url": "", "date": "2024-05-03 15:14", "message": "Berlin: A large fire at the Diehl company's weapons manufacturing plant. \nThe Diehl company manufactures defensive weapon systems and guided missiles."}, {"id": "65918163-d83e-462b-9e99-113dc80d258d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26633/", "date": "2024-05-03 13:36", "message": "Paris: French security forces break into Sciences Po the Institute of Political Science to break up an anti-Israel demonstration by the students there."}, {"id": "f77d6b32-538e-44d8-a3f7-59d33aefc394", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26632/", "date": "2024-05-03 13:29", "message": "The Houthi military spokesman:\n\nWe announce, under the direction of Commander Abdelmalek Alhouthi, the fourth phase of our activities:\n\nWe will hit all the ships whose destination is Israel's ports, wherever we can get our hands on them (that is, the innovation is that the activity is not limited by location - AA).\n\nIf Israel starts an operation in Rafah, all the ships of the companies that have any connection to Israeli ports will be affected (for example, if a certain shipping company works with Israeli ports, all its ships, even those whose destination is not Israel, will be affected - AA)."}, {"id": "fddaab5f-c8a5-442b-af05-b185759347b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26631/", "date": "2024-05-03 13:27", "message": "A few points to note:\n\n1. Hezbollah said anyway that it will stop the fire as soon as there is a ceasefire in Gaza.\n\n2. The French proposal does not answer the question of implementation and enforcement. What do we do if Hezbollah does not vacate? What happens if in six months Hezbollah returns south of Litani River? After all, the non-enforcement of Resolution 1701 at the end of the Second Lebanon War is what brought us to the current situation.\nEnforcement is the heart of the matter in the Lebanese arena. What enforcement measures are there and what are the sanctions for violations by Hezbollah?\n\n3. Israel was flying in the skies of Lebanon before the war, now it will have to commit that it will stop...\n\nThe bottom line, the proposal creates a situation where Israel will be left with just a paper in hand, without any deterrence and with Hezbollah's military force threatening the residents of the north.\n\nFor the Americans and the French this is excellent. This is a disaster for Israel."}, {"id": "50a2831f-9558-4331-b92c-879ec622d696", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26630/", "date": "2024-05-03 13:15", "message": "About 100,000 Palestinians have left the Gaza Strip since the beginning of the war\n\nThe Palestinian ambassador in Egypt: since the beginning of the war and until April, 85 thousand Palestinians left the Gaza Strip for Egypt through the Rafah crossing.\n\nTaking the month of April into account, it can be estimated that about one hundred thousand Palestinians left the Strip since the beginning of the war."}, {"id": "d35a5b7f-4ec0-4ea0-aa3c-94da7a859ee6", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65962/", "date": "2024-05-03 13:11", "message": "A must watch:\n\nStudents from the \"Free Palestine Army\" charge Portland police officer with shields made from trash cans.\n\n##\nNot the sharpest tools in the shed..."}, {"id": "34646444-9e80-4517-961d-f741d5142749", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26628/", "date": "2024-05-03 13:11", "message": "Fox News: The Iranian flag was raised by the students at the University of Irvine in California.\n\nIran is offering scholarships to students who will be expelled from US universities following the protests."}, {"id": "4e70feda-0cbf-475c-a1bd-9fec73612507", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26627/", "date": "2024-05-03 13:06", "message": "Footage from the last couple of days of an \"evening prayer\" at UCLA University in California, is also provoking harsh reactions among Americans on Twitter."}, {"id": "98ac96af-bcdf-44fe-a708-ba5d99a60d57", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26626/", "date": "2024-05-03 13:05", "message": "An image that received millions of reactions on Twitter under the title: American students convert to Islam.\n\n###\nHow nice of them to take their shoes off... but why stop there? Where are the Abayas for the young women in the group to cover all their bare body parts..."}, {"id": "8144086b-aee8-4d73-9dc3-c97dc7d3ae2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26625/", "date": "2024-05-03 11:05", "message": "Reuters from the Turkish Minister of Commerce:\n\nThe suspension of trade with Israel will continue until a permanent cease-fire in Gaza and until Israel allows all aid into the strip. \n\n##\nTurkey has de-facto joined the Shiite axis - like the Houthis... they are harming the Israeli economy until a ceasefire is reached. The Sultan became a Houthi pirate.\n\nIsrael should remember this when Turkey wants to resume trade between the countries."}, {"id": "f0945874-4208-41f6-a32f-0e10272f54af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26624/", "date": "2024-05-03 11:04", "message": "The Shia militias in Iraq claim:\nYesterday afternoon (May 2nd) we launched two cruise missiles from Iraq at a target in Tel Aviv and at a target in Be'er Sheva.\n\nThe militias in Iraq also claim that they attacked an Israeli target in the Dead Sea early this morning \"with appropriate weapons\".\n\n###\nSources of the Lebanese al-Mayadeen claim that the Iraqi cruise missiles were launched at the Glilot Base in Tel Aviv and the Avraham Base in Be'er Sheva."}]