[{"id": "566acbe6-2b81-4945-b384-7d52f9ae283b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32562/", "date": "2024-08-17 06:30", "message": "Muhammad bin Zayed, the ruler of the United Arab Emirates came to demand the safety of the prime minister of the Taliban (Afghanistan) who is hospitalized in one of the hospitals in Abu Dhabi (United Arab Emirates)."}, {"id": "d73eed75-ae30-44f7-9d4b-4cac12812ec1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32558/", "date": "2024-08-17 06:29", "message": "The Palestinians report 15 deaths tonight in an attack on a shed belonging to the al-Ajala family in the a-Zuwayda area in the center of the Gaza Strip.\n\nAmong the dead, the father of the family, Sami al-Ajala."}, {"id": "ced73e1c-a6a0-4939-8ba9-f418a047b746", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32557/", "date": "2024-08-17 06:27", "message": "The area that was attacked in Nabatieh in southern Lebanon as it appears this morning."}, {"id": "21fca93c-67d4-4c34-ae21-5b35e9b90c44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32556/", "date": "2024-08-17 06:26", "message": "The Lebanese Almanar channel (affiliated with Hezbollah):\n10 dead, including children and 3 seriously injured in an Israeli attack in the Wadi al Kfour area in Nabatieh in southern Lebanon.\n\n##\nAccording to other Lebanese sources, a \"factory\" was attacked and Syrian refugees are among the dead.\n\n##\nAccording to the IDF spokesman, a Hezbollah ammunition depot was attacked in Nabatieh."}, {"id": "b30ade4f-7125-4ef0-bc15-caf20d4b327c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32555/", "date": "2024-08-17 06:24", "message": "A short time ago, the IDF spokesman in Arabic published another evacuation notice, this time for the residents of the Maghazi refugee camp in the center of the Gaza Strip, as marked on the map.\nThis is an area that has not been cleared before.\n\nThe pressure is increasing on the residents of the center of the Gaza Strip - in areas that the IDF has not yet maneuvered in since the beginning of the war."}, {"id": "34cee73e-c157-41d9-8e70-74617ea11ada", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32554/", "date": "2024-08-17 06:23", "message": "The Palestinian Ministry of Health in Gaza: The first confirmed case of polio has been located in the Gaza Strip.\n\n##\nHow convenient for them this publication, at this time, a day after the UN called for a one-week ceasefire to vaccinate 640,000 Gazan children and after Hamas joined the call. Coincidence?"}, {"id": "f681a37c-2a17-4793-9bf4-eabc63aeafe2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32553/", "date": "2024-08-17 06:23", "message": "President Biden: I spoke with the ruler of Qatar and the Egyptian president about the great progress made in the Doha talks over the past two days.\n\nI am optimistic about reaching a ceasefire agreement in Gaza. We have an opportunity."}, {"id": "4438351c-3c99-474c-a994-fb7bc536227a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32552/", "date": "2024-08-17 06:22", "message": "Senior Hamas official Ghazi Hamed in an interview with the Al-Mayadeen channel about the ceasefire talks:\n\nWe expected the negotiations to reach this result.\n\nNetanyahu spoke honestly when he said he would not stop the war. It was in the media.\n\nThe occupation set new conditions regarding the Philadelphi Axis after we previously agreed that Israel would withdraw from it.\n\nThe publication in the Wall Street Journal regarding an Israeli withdrawal from the Philadelphi axis is not true.\n\nNetanyahu blew up the agreement from the beginning.\n\nWe will not allow an Israeli presence on any piece of land in the Gaza Strip.\n\nIsrael wants there to be a loophole in the agreement that would allow it to return to fighting.\n\nIsrael failed the Doha agreement and there was no progress.\n\nThe talk about negotiations, about coexistence with the occupation and about peace - is all a lie."}]