[{"id": "ad978059-6c6a-4b18-a1d5-9c3dd73abc9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27384/", "date": "2024-05-17 22:20", "message": "Another photo of the Iranian Sayyad 2 that is in the hands of Hezbollah. A strategic weapon."}, {"id": "55e57980-7727-4b76-842e-a35224316f7b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27383/", "date": "2024-05-17 22:20", "message": "What you see in the video are the remains of an Iranian Sayyad 2 air defense missile.\n\nThe missile has a range of at least 75 km. The targets were attacked in the village of Najariya, which is located about 50 km from the border with Israel.\n\nThat is, today it was publicly revealed that Hezbollah has Iranian air defense systems with missiles that cover part of Israel's airspace."}, {"id": "625beca9-ec66-4b85-b599-331d761cb53d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27382/", "date": "2024-05-17 22:17", "message": "This is the video that Hezbollah would prefer not to be leaked online."}, {"id": "73d5d203-d9ee-480c-a071-1352d17170e2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27381/", "date": "2024-05-17 22:16", "message": "Earlier today, the IDF spokesperson revealed that in this morning's attack in the area of ​​the village of a-Najariya in Sidon, the target was Hezbollah air defense complexes that posed a threat to Israeli aircraft.\n\nThe IDF spokesperson did not comment at all on the assassination of Hezbollah senior Hussein Mahdi.\n\nLebanese sources indicate that due to the video recording of irresponsible Lebanese locals at the sites that were attacked in the village of Najariya, a \" big secret \" of Hezbollah has been revealed 👇👇👇"}, {"id": "5b39e7ab-9fd5-4728-bcd4-ca7f294a1f4c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27380/", "date": "2024-05-17 22:12", "message": "Gazan sources: Today in Jabaliya the IDF killed Amid (corresponding to the Special Forces) Mu'taz Elkhtari (Abu Kusai), the commander of the Hamas military police responsible for the north and center of the Gaza Strip."}, {"id": "98d25a0a-906e-48d2-8365-4c8ba4f6e10d", "channel_id": 1560386984, "url": "", "date": "2024-05-17 22:10", "message": "In an unusual move for the West Bank, the IDF carried out an airstrike on a target in Jenin's a-Damaj neighborhood, killing a wanted terrorist. Four other people were reportedly injured in the attack.\n\nThe target of the targeted strike, Islam Khamaiseh, was responsible for the murder of Israeli civilian Meir Tamari and also carried out the shooting attack in Barta'a in June 2023, in which several soldiers were injured.\n\nAhmed Barakat, seen in the attached photo next to Khamaiseh, also took part in the aforementioned attacks, and was killed by the IDF in March of this year."}, {"id": "bbb0a2ab-d509-4aeb-8ad9-9c1b1e2ebd82", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27373/", "date": "2024-05-17 18:41", "message": "US Central Command publishes first photos of the activity of the American floating dock in Gaza.\n\nHamas Information Bureau:\nThe floating dock does not cover the needs of the Strip. We need 7 million servings of food a day. The US set up the pier to improve its image."}, {"id": "1d5af1fa-df1c-4443-bb76-4a6027395297", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27371/", "date": "2024-05-17 18:40", "message": "Gaza residents: cigarettes entered the Strip through the Kerem Shalom crossing - (there is writing in Hebrew on the boxes).\n\nAccording to the residents, cigarette prices are still high and have not changed.\n\nIn any case, they have no problem smoking goods from Israel..."}, {"id": "34053666-1398-4956-9292-810411d9c9e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27369/", "date": "2024-05-17 18:40", "message": "Hamas-identified channels confirm that the person killed in the car attack in Rashiyeh near the border with Syria is senior Hamas official Sharabil al-Sid, Abu Amro."}, {"id": "43385216-3ce7-4553-b833-f30d15df17f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27368/", "date": "2024-05-17 18:35", "message": "Lebanon: The moments of the car attack👆 in the Rashiyeh area near the border with Syria this evening."}, {"id": "9c29ed37-93b2-4e6c-9706-dd77710b143f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27365/", "date": "2024-05-17 18:11", "message": "Lebanese sources: An IDF drone attacked a vehicle in the area of ​​the village of Rashiyeh, near the border with Syria deep in Lebanon earlier this evening."}, {"id": "c0fddc8c-52a2-47d8-9ef8-f79e081e9929", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27364/", "date": "2024-05-17 18:09", "message": "The IDF Spokesperson announced the death of a soldier in battle in the northern Gaza Strip.\n\nMay his memory be a blessing."}, {"id": "7b9f13af-5685-48f1-a1bb-747dc4164125", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27363/", "date": "2024-05-17 17:52", "message": "IDF Spokesman: The 3 abductees escaped from the Nova Party and arrived at Mefalsim on October 7th. There they were murdered.\nTheir bodies were taken to the Strip."}, {"id": "6f796eb5-3027-4c04-bb15-ca658e83c876", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27362/", "date": "2024-05-17 17:50", "message": "IDF spokesperson:\n\nTonight, the bodies of three abductees were recovered from the Strip:\nYitzhak Galanter\nAmit Buskila\nShani Louk"}, {"id": "a67a7351-6c68-4949-9ad9-aac034c36e88", "channel_id": 1560386984, "url": "", "date": "2024-05-17 14:17", "message": "In continuation of what I wrote here 👆 about yesterday's assassination of Hamas terrorist Muhammad Akel - Fatah supporters are also celebrating his death on social media.\nAkel has acted extensively against them in the Gaza Strip and against the activists of \"Bidna Neish\" (Want to Live) who wanted to demonstrate against Hamas in the Gaza Strip in recent years.\n\nAttached is a post published by Akel on September 12, 2023 (which is also the anniversary of the terrorist attack carried out by his uncle in 1993) in which he wrote:\n\n\"After the liberation of the West Bank from Mahmoud Abbas (Abu Mazen) we will take the women of the West Bank (as property) 🌶\nPraise to the Izz ad-Din al-Qassam Brigades\npraise for the greens\" (ie Hamas -AA)\n\n##\nLess than a month before 10/7 he speaks publicly about liberating the West Bank and turning women into sex slaves (this is the meaning of the expression).\n\nHe probably knew a thing or two about future planning. He is the scum of the human race. The world is better off without him."}, {"id": "8eeedeb7-f4df-424b-a284-fea52d4c5cd5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27360/", "date": "2024-05-17 14:15", "message": "Gaza: A column of Gazan trucks waiting inside the Gaza Strip to reach the American floating dock in order to unload the American aid that will arrive in Gaza by sea."}, {"id": "2d6594cc-4929-4ec9-9dd1-7d36c5865d79", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27359/", "date": "2024-05-17 14:14", "message": "The IDF spokesperson summarizes a week of fighting in the Zeytoun neighborhood in the south of Gaza City:\nOver 90 terrorists were eliminated.\nAbout 300 terrorist infrastructures were destroyed including launch sites, headquarters and underground sites.\n\nAttached is documentation of the destruction of a tunnel in the Zeytoun neighborhood last week."}, {"id": "c203f6a1-1e0e-4ed5-9505-925c9ea3b9e0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27358/", "date": "2024-05-17 14:13", "message": "USA: Republicans continue to attack the Biden administration against the backdrop of the delay in the shipment of weapons to Israel\n\nFollowing the passage of the law tonight in Congress ☝️ against delaying arms shipments to Israel, led by the Republicans and with the support of some members of the Democratic Party, the American news site Axios reports that Republican Senator Ted Cruz plans to attack the policy of the Biden administration through a proposal to discuss the American floating dock in Gaza that began working today.\n\nCruz threatens that if the Democrats do not vote in the Senate in favor of the law that prevents the delay of arms shipments to Israel, he will bring up the issue of the continued operation of the dock in Gaza, based on the information that the dock was attacked by Hamas rocket fire at least twice.\n\nCruz, a Republican, is promoting another separate bill that would prohibit the Biden administration from delaying arms shipments for a period of at least a year from the moment a ceasefire takes place.\n\nAccording to Axios, the Democrats are furious that the Republicans forced them to vote on Biden's policy on the issue of arms shipments.\n\nThe White House threatened that the president would use his veto power against the move.\n\n##\nRepublicans are taking advantage of Biden's move to freeze arms to Israel to gain points in public opinion in the presidential race. Biden is trapped."}, {"id": "13baa683-552f-4b99-9c97-5c514f206673", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27357/", "date": "2024-05-17 14:12", "message": "IDF: Following the sirens that sounded in northern Israel a short while ago, approximately 75 launches were identified crossing from Lebanon into Israeli territory, dozens of which were intercepted.\n\nEarlier today, IDF soldiers identified a Hezbollah launcher in the area of Yaroun which was ready to fire launches toward Israeli territory. A short while afterward, an IDF fighter jet struck and dismantled the launcher, preventing a large number of launches."}, {"id": "0529707e-8ea6-4434-b3e1-c838bc2247c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27356/", "date": "2024-05-17 14:11", "message": "Civil Defense in Gaza: 93 bodies of Gazans have so far been rescued from the Jabaliya refugee camp in the last 6 days."}, {"id": "e8a53ff5-02db-44a0-ae76-8dafb0994530", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27355/", "date": "2024-05-17 14:11", "message": "Al Jazeera: About 40 rockets were launched a short time ago from Lebanon towards the Golan and Galilee."}, {"id": "371ba314-e35d-42bd-afbd-2db50748a861", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27354/", "date": "2024-05-17 14:10", "message": "Lebanon: The moment of the attack in the village of Najariya, in which Hezbollah senior Hossein Mahdi was apparently killed."}, {"id": "a70c3fd8-806e-45fb-8e43-ee92b297275f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27353/", "date": "2024-05-17 14:09", "message": "Hezbollah confirms the attack and announces a death in its ranks:\n\nHussein Mahdi, born in 1962, from the village of a-Najariya (Sidon district).\n\nHe was killed in an Israeli drone attack this morning on the pick-up vehicle in which he was traveling.\n\nNumber 303"}, {"id": "f89d0e88-4314-40b5-a53e-ba42457c4fc6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27352/", "date": "2024-05-17 14:08", "message": "As of this morning, according to Palestinian reports, the forces are not continuing to advance further.\n\nI will mention that the IDF required residents to evacuate in the area of ​​the 6 km line from the border with Israel, which means that further progress towards the west requires additional population evacuation (beyond those who decided to evacuate even without receiving an explicit evacuation instruction from the IDF.\n\nAbout a kilometer west of the current troop location is the Kuwaiti hospital - a significant landmark, where Hamas operatives find refuge."}, {"id": "71fb8cb0-cf39-425c-afc3-3a4d0dcfd246", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27352/", "date": "2024-05-17 14:08", "message": "The advance of IDF forces in the Rafah sector\n\nFollowing the Palestinian report from a few days ago about the entry of IDF forces into the Barazil neighborhood in Rafah, many Palestinian channels are updating this morning that the maneuvering forces on the Philadelphia axis (on the border with Egypt) were located near the fuel terminal corresponding to the Bahlul building in the Barazil neighborhood (the location on the Philadelphia axis is marked on the Google map attached).\n\nThis means that the IDF forces have established control over approximately 6.8 km of the Philadelphia axis - meaning that more than half of the Philadelphia axis is now under Israeli control, including the Rafah crossing of course - which is definitely the highlight in terms of the influence on Hamas.\nThere are still about five kilometers left to the coast."}, {"id": "5d1dc32d-afdb-4f9d-b4f3-f793186f59e4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27349/", "date": "2024-05-17 10:22", "message": "Gaza channels on the IDF operation in Jabaliya in the north of the Gaza Strip:\nDozens of bodies of Gazans are lying in the streets of Jabaliya and there is no way to reach them due to the movement of the maneuvering forces in the area."}, {"id": "f340c1c4-34b9-4020-86ed-d1df31a2f8e1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27348/", "date": "2024-05-17 10:21", "message": "A video taken yesterday in Lebanon where you can see a Hezbollah suicide drone on its way to Israel.\n\nChannels affiliated with Hezbollah are condemning the person who filmed this video in Lebanon because they claim that this morning the IDF attacked the area seen in the video and that the video helped the IDF discover the flight path of the drone."}, {"id": "5fa7f180-24db-49cb-87f4-cdf6ebb25316", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27347/", "date": "2024-05-17 10:20", "message": "The correspondent of the Lebanese Almanar channel (Hezbollah-affiliated) details the results of 3 of the attacks carried out by the IDF in the Sidon area:\n\n1. The attack in the orchards area of ​​a-Najariya - no casualties.\n2. The attack in the Saha area (adjacent to a-Najariya) - one Lebanese dead and 3 Syrians wounded. (This is the attack on the vehicle in which the senior Lebanese official was eliminated and was carried out using a UAV).\n3. The attack on the stone factory - 2 Syrians dead, two wounded and there are missing.\n\n##\nThe IDF carried out a combined attack - fighter jets attacked and drones along with them."}, {"id": "d92c0026-5f8c-43c6-a89d-08adcaf6f6be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27346/", "date": "2024-05-17 09:21", "message": "UNRWA: About 630,000 Gazans have evacuated from Rafah since May 6."}, {"id": "ca250423-6705-461a-8ba7-9782ed7115b0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27344/", "date": "2024-05-17 09:20", "message": "Arab sources indicate that Hussein Mahdi, a senior Hezbollah official who was killed this morning in the village of Najariya in the Sidon region of Lebanon, was a senior member of Hezbollah's air force and was responsible, among other things, for launching the attack that led to the damage to the \"Tel Shamaim\" observation balloon west of Tiberias.\n\nBoth balloons were deflated..."}, {"id": "7413946b-97c4-4171-863d-4164b643a489", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27343/", "date": "2024-05-17 09:18", "message": "Al-Arabiya Network: In attacks in the Sidon area (in the village of Najariya), a senior member of Hezbollah named Hussein Khader Mahdi was killed."}, {"id": "8ff78a3d-9a15-4086-8b4f-801fa4f56e95", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27339/", "date": "2024-05-17 09:15", "message": "The IDF raises the bar of reactions and attacks with intensity this morning in the village of A-Najariya in the Sidon area - about 50 km north of the border with Israel."}, {"id": "1c984502-1522-4854-a1dc-911070aa4d5a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27338/", "date": "2024-05-17 09:02", "message": "Senior Hamas official Al Hayya (Yahya Sinwar's deputy and member of the Hamas Political Bureau), claims in an interview with the Lebanese Almanar channel (affiliated with Hezbollah):\n\n70% of the abductees were killed as a result of IDF attacks."}, {"id": "432ec18d-5b75-4104-9ac1-36ffa61b496f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27337/", "date": "2024-05-17 06:56", "message": "The military wing of Hamas accepts responsibility for firing rockets at the Rafah crossing this morning.\n\n##\nThe crossing continues to be closed in the meantime due to Egypt's refusal to coordinate the operation of the crossing with Israel."}, {"id": "47789744-9651-44ce-a062-7be39c19d9d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27336/", "date": "2024-05-17 06:54", "message": "The Shiite militias in Iraq accept responsibility for launching a suicide drone at the southern Israeli city of Eilat."}, {"id": "e63ab64a-e02b-4398-9ee1-a83a5825c790", "channel_id": 1560386984, "url": "", "date": "2024-05-17 06:52", "message": "Yemeni media: The Houthis' air defense systems managed to shoot down an advanced American MQ9 drone last night.\n\nThe price of a single drone is 30 million USD."}, {"id": "acd8b046-3f24-41aa-8ce0-dec3eadb14c8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27331/", "date": "2024-05-17 06:52", "message": "Hezbollah accepted responsibility for this morning's launch of a number of suicide drones towards the headquarters of the 401st Artillery Battalion in Gaaton (Nahariya), this in response to the killing of two Hezbollah militants of the organization yesterday in Qana.\n\n##\nAccording to Israeli media, at least one of the drones was intercepted and another landed in an open area."}]