[{"id": "bc53a058-150f-475e-b38f-0aca0ae8ce94", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27329/", "date": "2024-05-16 21:59", "message": "As expected, the American Congress approved a bill a short time ago that aims to prevent the Biden administration from delaying arms shipments to Israel.\n\nThe proposal was approved by a majority of 224 supporters against 187 opponents. Despite explicit instructions from the White House, 16 members of the Democratic Party (headed by Biden) violated them and voted along with the Republicans in favor of the bill.\n\nPresident Biden threatened earlier this week to impose a presidential veto on the proposal if it is approved."}, {"id": "eebf7a5e-1aec-46c3-95bb-f923f0f4cde3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27328/", "date": "2024-05-16 21:50", "message": "The original article on the attack in September 1993 which was carried out by Emad Akel, one of the founding members of the Izz a-Din al-Qassam Brigades, in which three Israeli soldiers were killed (courtesy of the Israeli National Library)."}, {"id": "b1a56f05-4951-4fdc-aa64-64e6dcc39bf8", "channel_id": 1560386984, "url": "", "date": "2024-05-16 21:48", "message": "Today, Israeli jets attacked the house of the \"martyr\" Emad Akel in the Al-Faluja area in Jabalia in the north of the Gaza Strip.\n\nEmad Akel, for those who don't know, was one of the original founders of the military wing of Hamas, and was a cruel terrorist who had a lot of Israeli blood on his hands.\n\nAkel carried out the first filmed attack in the history of the Izz a-Din al-Qassam brigades and the \"Palestinian Resistance\", when he murdered three Israeli Druze soldiers near the Mas'ab Bin Amir Mosque in Zeitoun in 1993. He was killed two months later and has since been considered a \"legend\" among Gazans.\n\nSo why am I telling you this?\nFour people were killed in the attack on Akel's house today, including Muhammad Akel (pictured), Emad's nephew - a Hamas terrorists in his own right who sought to continue his uncle's legacy and even named his son Emad Akel.\n\nOver the last few years I came to know how cruel and despicable he was. The things he published on Oct 7 were shocking.\n\nHe will not be missed."}, {"id": "20f1ced0-c41f-455d-b661-b8462b492997", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27326/", "date": "2024-05-16 21:27", "message": "Hezbollah publishes a recording of the UAV that today launched two S5 missiles at an Israeli military target in Metula and then exploded at another target."}, {"id": "2962022c-658a-4818-9e62-e7f81779f95b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27324/", "date": "2024-05-16 21:18", "message": "Israel did well to decide to enter Rafah despite the American and international threats.\nThe delayed arms shipment eventually arrived and bought Israel public support in the US at the expense of the move the Biden administration was trying to make.\nThe spectators in the stands of the Middle East saw that Israel stood its ground and was successful.\nThe pressure on Israel regarding the operation in Rafah has decreased.\nThe Biden administration will not be in a hurry to delay further arms shipments due to the negative effect for him in American public opinion.\n\nIt is a shame that Israel did not decide to do this earlier.\nA lesson for the future..."}, {"id": "d0a1ea4a-95be-4c36-b6d8-cad15ee903a1", "channel_id": 1560386984, "url": "", "date": "2024-05-16 21:11", "message": "The previous American envoy to Lebanon: an agreement with Hezbollah would not be worth the price\n\nDavid Schenker, who was the US Assistant Secretary of State for Near East Affairs of the Trump administration (he was Trump's strongman in Lebanon and knows Hezbollah well), in an article for the Washington Institute for Near East Policy:\n\nAs part of the agreement that the Biden administration is trying to obtain between Hezbollah and Israel, Hezbollah will take advantage of the situation to obtain American concessions regarding the identity of the next Lebanese president (so that it will be convenient for Hezbollah - AA) and other issues and then simply avoid meeting its obligations regarding the borders towards Israel.\n\nLink to the full article (in English and Arabic):\nhttps://www.washingtoninstitute.org/ar/policy-analysis/alatfaq-byn-lbnan-wasrayyl-qd-la-ysthq-alna"}, {"id": "455aea34-6c6e-4cad-87dc-fbc13aa3a008", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27322/", "date": "2024-05-16 19:09", "message": "Key points from the IDF spokesman's announcements this evening:\n\nThe commando brigade joined the fighting in Rafah.\n\nThe two Hezbollah militants who were killed today were operating suicide drones and were on their way to carry out an attack against Israel.\n\nTwo of the Thai workers kidnapped by Hamas on Oct 7th to Gaza are not alive (they were murdered that day and their bodies were taken to Gaza, thus bringing the number of hostages officially confirmed dead to 40).\n\n\"Tal Shamaim\", the IDF's observation balloon, was damaged while on the ground as a result of Hezbollah's suicide drone attack yesterday west of Tiberias. It was not operational."}, {"id": "a2debeaa-cfee-4d5f-ad19-dc8168415221", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27321/", "date": "2024-05-16 19:00", "message": "The IDF reports on the death of a soldier, 39-year-old Ran Yavetz, from the 6862 battalion of the 828 brigade.\n\nMay his memory be a blessing."}, {"id": "a90dc7a4-55ac-45d1-a6bf-2723d65e001c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27320/", "date": "2024-05-16 18:01", "message": "Leading Arab media cite the reports on the Israeli \"Kan11\" news channel this evening:\n\nThe delayed shipment of weapons from the US has landed in Israel."}, {"id": "447343ab-9376-4c7e-8603-9c30cbce905d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27319/", "date": "2024-05-16 17:58", "message": "Hamas against Abu Mazen\n\nHamas in an official announcement: We regret Abu Mazen's remarks about the heroic \"Tufan al-Aqsa\" (Hamas's name for the Oct 7th attack, and the war that followed - AA) at the Arab summit in Manama today. The enemy doesn't need a reason to commit its crimes.\n\n \"Tufan al-Aqsa\"  is the most important chapter in the Palestinian struggle against the occupation. It returned the Palestinian issue to the top of the agenda and achieved strategic achievements - we got closer to freedom and \"self-determination\"."}, {"id": "d3dfcf80-f516-4b06-bffb-6d7cb5f363b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27318/", "date": "2024-05-16 17:52", "message": "For the second time today, rockets wee launched towards Kerem Shalom - from there, Israel has been bringing goods into the Gaza Strip, on top of dozens of trucks, for two nights in a row.\n\nThis is the only route for goods to enter the southern Gaza Strip since Israel took control of the Rafah crossing."}, {"id": "5b2105e8-535a-4ddb-b69c-e59c22848fa6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27314/", "date": "2024-05-16 17:48", "message": "IDF spokesperson:\n\n*Rocket launchers, ready for launch, found in eastern Rafah; Fighters of the Shaked Battalion continue raids targeting the area*\n\nFighters of the 401st Brigade combat team under the 162nd Division continue to lead the raid in East Rafah.\n\nDuring the attack, female fighters of Unit 414, operating under the 401 Military Command, flew drones that located launchers loaded and ready to fire long-range rockets into Israeli territory. These launchers were used by the terrorist organizations in the Gaza Strip and launched towards the territory of the country in recent months. The launchers were destroyed.\n\nIn a raid on another launch area, soldiers located a central and branched launch infrastructure in the Rafah area that contains dozens of launch canes that were connected to each other and with rockets ready for launch. The launch infrastructure was used in firing rockets at Israel in recent months and was also destroyed."}, {"id": "07841d00-c461-458e-bb86-eebe069560e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27312/", "date": "2024-05-16 17:41", "message": "Hezbollah announced two casualties in its rank:\n\nAli Ayoub\nMohammed Fares\n\nThe two were likely killed in today's drone strike at a vehicle near Qana in southern Lebanon 👆\n\nNumber 300 and 301."}, {"id": "155618d3-445b-436b-bdcd-55bd0748db17", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27308/", "date": "2024-05-16 17:38", "message": "The connection of the floating pier in the Gaza Strip has been completed. In recent weeks, the IDF and the Ministry of Defense have made extensive preparations for the reception of the floating pier.\n\nThe preparations were carried out in the last few weeks by the engineering and construction division at the Ministry of Defense, the PADM engineering formation, the 563rd construction division, the Navy, ATL, the coordinator of government operations in the territories and in cooperation with the US Army."}, {"id": "f921d24c-3d3b-4432-8d05-0928e7e6aa08", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27307/", "date": "2024-05-16 17:34", "message": "Following the reports here 👆: Earlier today (Thursday), an explosive UAV crossed from Lebanese territory into northern Israel and exploded in the area of Metula. The incident is under review. \n\nAs a result of the explosion, an IDF soldier was severely injured and two additional soldiers were lightly injured. The soldiers were evacuated to the hospital for medical treatment. Their families have been notified."}, {"id": "5b1f80a4-62f1-4459-98db-d08af4e5757c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27306/", "date": "2024-05-16 14:23", "message": "The Crown Prince of Saudi Arabia, Muhammad bin Salman, met today with Syrian President Bashar Assad, in Manama, the capital of Bahrain, as part of the 33rd Arab Summit."}, {"id": "dccf059f-86a4-43d4-826d-128917a6c264", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27305/", "date": "2024-05-16 14:22", "message": "Palestinian channels are publishing footage of an Israeli attack today in the Jabaliya camp in the north of the Gaza Strip."}, {"id": "7531f6e4-353d-49e8-8a1d-e530b9028b8c", "channel_id": 1560386984, "url": "", "date": "2024-05-16 14:21", "message": "°When was the last time a hostile aircraft attack by firing a missile from the air at a target in Israeli territory?"}, {"id": "ee01393b-ec49-453b-ba97-87f4aa9e8ff4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27303/", "date": "2024-05-16 14:21", "message": "S5 missile, which Hezbollah claimed to have used today by firing from a UAV.\nThe missile was developed by the Soviet Air Force."}, {"id": "868f97c2-0f57-46ef-b2bb-c0f75dccd5c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27302/", "date": "2024-05-16 14:20", "message": "Hezbollah: At 13:38 we attacked a post in Metula using an attack drone that carried two S5 missiles. After launching them at the selected targets, the drone completed the operation and \"suicided\" itself on the designated target.\n\n##\nHezbollah describes here a situation of a suicide drone that launched missiles before carrying out the action of crashing on the target.\nThis is the first time that Hezbollah has claimed this type of action."}, {"id": "d686d242-02d6-487b-ad30-39646837604e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27301/", "date": "2024-05-16 14:09", "message": "PA Chairman Abu Mazen, at the 33rd Arab Summit in Bahrain:\nThe military operation carried out by Hamas on October 7 was an independent decision by Hamas and provided Israel with many pretexts to attack Gaza."}, {"id": "b00ff729-416b-47ce-bc82-54d6ab11eeb5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27300/", "date": "2024-05-16 14:08", "message": "The Minister of Defense Gallant said at the end of the visit:\n\n\"I am now in the Rafah area after meeting the commander of the Southern Command, the commander of the 162nd division, the 84th brigade, the 401st brigade, and the fire brigade, all of them are working in unique ways, they are shooting in the field, hundreds of targets have already been attacked, the forces are maneuvering and have come close to their lines.'\n\n\"This operation will continue through additional forces that will enter. Several tunnels in the area have been destroyed by our forces and more tunnels will be destroyed soon. This operation will intensify and Hamas is not an organization that can renew itself now - it has no reserves, it has no ability to produce weapons, it has no supplies, it has no armament, it has no ability to properly treat terrorists who are injured and the meaning is that we are wearing it down.\""}, {"id": "c1c2cebe-8ea5-4f71-9ab1-a2938f238d1d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27299/", "date": "2024-05-16 14:07", "message": "Defense Minister Gallant at the end of an assessment of the situation at the border of the Gaza Strip, in the Rafah area: \"Additional forces will join the ground operation in Rafah, a number of tunnels in the area have already been destroyed - the Hamas taps are getting shut off\"\n\nYesterday, Defense Minister Yoav Gallant visited the headquarters of Division 162 operating in the Rafah area and held a situation assessment together with the commander of the command, Colonel Yaron Finkelman, the commander of the division, Lieutenant Colonel Itzik Cohen and the commanders of the brigades fighting in the field."}, {"id": "66dd070b-b8db-48a9-9373-f3ee6b5d1499", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27298/", "date": "2024-05-16 12:28", "message": "East Rafah: The Palestinians report that IDF forces are blowing up (from the ground) buildings in the Jneineh neighborhood (as they did in the A-Salam neighborhood in the last two days).\nThis indicates a good grip also in the Jneineh neighborhood 👆 in east Rafah."}, {"id": "f3315c3b-a89d-49c4-bcf3-db92f25eb734", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27297/", "date": "2024-05-16 11:52", "message": "Lebanese channels: The second person injured in the attack was pronounced dead."}, {"id": "0433ead1-da1e-44f5-8b73-16594ccab792", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27296/", "date": "2024-05-16 11:24", "message": "IDF spokesperson:\n\nAt the end of a three-hour manhunt: the IDF and the Shin Bet arrested the suspect behind today's stabbing attack at the Yitzhar Junction."}, {"id": "a6ff5bdd-fb67-41b8-99b2-87269c8fa215", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27294/", "date": "2024-05-16 11:11", "message": "Lebanese channels report on an Israeli drone strike on a vehicle near the village of Qana in southern Lebanon.\n\nA man was killed and another was reportedly injured in the attack."}, {"id": "93e2971a-e79b-442e-b8ec-43cb58fd6ee2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27291/", "date": "2024-05-16 10:25", "message": "The Lebanese army today raided the Palestinian drug den called the Shatila refugee camp.\nArmy forces arrested 15 drug dealers and raided production laboratories. One drug dealer was killed.\nAccording to Lebanese sources, Shatila is responsible for 40% of the drugs that reach Beirut."}, {"id": "5a848065-0bed-4d9b-b1bf-282649ca5f10", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27290/", "date": "2024-05-16 10:12", "message": "The Egyptians are trapped with the Rafah crossing\n\nThe Lebanese Al-Akhbar (Hezbollah-affiliated) from Egyptian sources:\nSenior Egyptian officials have informed their American counterparts in recent days that forcing changes on the border between Egypt and Gaza (Philadelphia Axis) through military force is unacceptable. Israel replied to them, through the Americans, that the issue of Israel's control of the Rafah crossing has been decided and that Israel will not withdraw from it, and that the situation must be treated as a matter of course.\n\n##\nI will mention that the Egyptians refuse to open the Rafah crossing for the movement of goods as long as Israel controls the crossing and their position is that they are willing to cooperate in the crossing only with a Palestinian entity and not with Israelis.\nTheir position stems from a fear that they will be perceived as agreeing to the new reality in which Israel controls the crossing. As a result, the crossing remains closed even though Israel is ready to open it for the entry of goods and aid from Egypt.\nLast night Ismail Haniyeh, the chairman of the political bureau of Hamas, stated that the movement is in direct contact with the \"Egyptian brothers\" on this issue.\nEgypt is in an interesting trap that will only get worse as time passes and the crossing remains closed. In the meantime, beyond the issue of goods, there is no going out and no coming in through the crossing gates. Gazans who want to go to Egypt cannot.\nUntil before Israel took control of the crossing, about 700 people per day crossed into Egypt."}, {"id": "bfe1bb42-3582-467d-aed9-722ffa99f9f6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27289/", "date": "2024-05-16 08:23", "message": "Hezbollah:\nWe launched 60 rockets at Nafah, Kela and Yoav bases in response to the overnight attacks in the Al-Beqah area."}, {"id": "eca595d4-765b-40e6-8cb5-f9655695ce88", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27288/", "date": "2024-05-16 08:12", "message": "IDF Spokesperson: Following the report of a stabbing attack in the Samaria area, a short while ago, a terrorist arrived at the Yitzhar junction, stabbed an IDF NCO who was in his vehicle and fled. IDF soldiers are searching for the terrorist and have blocked roads in the area. \nThe NCO was moderately injured and has been evacuated to the hospital for medical treatment. His family has been notified."}, {"id": "28715c53-44bd-41b2-a353-727a8562a7db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27284/", "date": "2024-05-16 08:11", "message": "The Palestinians report that the IDF dropped leaflets this morning in the Deir al-Balah area in the center of the Gaza Strip, in which the details of Hamas operatives who carried out surveillance and spying operations on residents in the Gaza Strip to monitor that they are not acting against Hamas and its interests were revealed.\nThe IDF publishes a long list of identity card numbers of Gaza residents that appeared in Hamas's surveillance reports and invites each and every resident of Gaza to check if he was also followed by Hamas's intelligence personnel, according to the reports located in the Strip."}, {"id": "30e90b4f-bcac-43fe-aeb3-e2e53cdf8cf9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27283/", "date": "2024-05-16 08:10", "message": "Al Jazeera: About 40 rockets were launched about an hour ago from Lebanon towards the Golan and the Galilee."}, {"id": "d2945e54-13ee-45dc-aca3-767a2ca4e27b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27282/", "date": "2024-05-16 08:09", "message": "US Central Command:\nThe floating pier off the coast of Gaza has been completed.\nIn the coming days, the aid containers will start arriving. American soldiers did not enter the territory of the Gaza Strip as part of the construction of the pier."}, {"id": "0ac938c9-3c38-447a-8de0-7bd33a7d37d2", "channel_id": 1560386984, "url": "", "date": "2024-05-16 07:57", "message": "An operative of Fatah's Al-Aqsa Martyrs Brigades cooperated with an operative of the military wing of Hamas, shooting together at the Tibba checkpoint this morning in revenge for the death of three Palestinians in Tulkarm tonight during the IDF's activity there."}, {"id": "2c17a8a5-eddc-432e-a2e5-5f9cb37217f8", "channel_id": 1560386984, "url": "", "date": "2024-05-16 07:55", "message": "Extensive IDF activity tonight in West Bank cities to capture money exchangers who aided terrorism\n\nTonight, the IDF raided money exchangers throughout the West Bank in:\nTulkarm, Ramallah, Bethlehem, Hebron, Tubas, Qalqilya, Jericho and Jenin.\nAt the center of the activity was a large chain of money exchangers called \"Al-Khalij\", which has branches all over the West Bank. According to the Palestinians, funds were confiscated and employees of this network were arrested, including the director of the network, Alaa Abiat.\nAn activity was carried out against additional exchangers and in Tulkarm 3 Palestinian deaths were recorded as a result of an exchange of fire with the IDF during the activity.\nThe security mechanisms of the Palestinian Authority were informed in advance about the extensive activity of the IDF in the West Bank.\n\nAt the end of the activity, the IDF soldiers handed out \"bills\" with a warning about the activities of the Al-Khalij network and its support for terrorism (attached)."}, {"id": "20954718-1dbd-4fe0-9385-31f1b13058c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27276/", "date": "2024-05-16 06:38", "message": "Russian President Putin visited his Chinese counterpart Xi Jinping as part of strengthening relations between the countries (and after Putin's re-swearing in as President of Russia for the next six years).\nPutin was highly respected according to all the rules of the ceremony."}, {"id": "138341c4-747d-41b8-82fd-8e837bb79027", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27275/", "date": "2024-05-16 06:36", "message": "The scenes of destruction from the Zeitoun neighborhood in the south of Gaza City, after, according to the Palestinians, IDF forces withdrew from the area yesterday."}, {"id": "f5551fd9-5811-492a-9b77-6c7dcb31769a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27274/", "date": "2024-05-16 06:35", "message": "The Palestinians report that tonight about 50 trucks of goods entered from Israel through the Kerem Shalom crossing, ordered by merchants from the Strip (not humanitarian aid - AA).\nHamas does not collect taxes on these goods (because they enter without going through Gaza customs - AA), which is supposed to lower the prices of the goods for the consumer, but in reality the prices are very expensive, according to reports from Gazans shared online."}, {"id": "8e413bd4-f48a-489d-978c-3953f8bac821", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27273/", "date": "2024-05-16 06:34", "message": "The American NBC network reported last night that the construction of the floating dock of the US Army for the purpose of bringing goods into the Gaza Strip, will be completed within 24-48 hours."}, {"id": "04c17bc9-f1d7-4e70-bf61-0092ad39ec7f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27272/", "date": "2024-05-16 06:34", "message": "The Shiite militias in Iraq claim that they attacked a target in Eilat and the refineries in Haifa early in the morning using drones."}, {"id": "1659c3bf-4fd7-400d-b32f-dd65130a098f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27271/", "date": "2024-05-16 06:33", "message": "The Israel Police publishes documentation of the neutralization of a terrorist who tried to stab security forces soldiers around three in the morning in the Old City of Jerusalem.\nThere are no casualties among the police officers."}, {"id": "0d03d421-f2b6-4ab2-b400-8ed0744b16c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27267/", "date": "2024-05-16 06:32", "message": "Tonight's IDF attacks deep in Lebanon\n\nThe Lebanese Al Mayadeen channel notes that the Israeli Air Force carried out 14 attacks tonight on targets in the Baalbek area (Al Baqa district).\n\nAccording to Lebanese sources, targets were attacked in the villages: Nabi Chit, Brital, Jarud and Al-Khariba.\n\nThere were no reports of casualties, it seems that the IDF mainly attacked infrastructure.\n\nThe attached diagram published by the IDF spokesperson in September 2019 shows an area in the village of Nabi Chit where Hezbollah's precision missile factories are located.\nAccording to Lebanese sources, this may have been one of the targets of the attack."}, {"id": "5c2a16b5-4b31-4d2f-a0cd-6717ae6cd158", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27266/", "date": "2024-05-16 06:21", "message": "The IDF spokesperson announced this morning the death of 5 soldiers of the 202nd Battalion in the Paratrooper Brigade in battle in the northern Gaza Strip.\n\nMay their memories be a blessing.\n\nIn this battle, three more soldiers of the 202nd Battalion were seriously injured."}, {"id": "be2e8d1b-d0d9-45a5-894a-3d49cc94fb3e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27265/", "date": "2024-05-16 06:19", "message": "Fires broke out at the site that was attacked in Baalbek."}]