[{"id": "d46539a6-bb69-4d17-9d91-310067aced1a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32128/", "date": "2024-08-08 20:15", "message": "A Syrian refugee jokes at the expense of the Iranians over the delay in their response against Israel (subtitles included)...\n\nIn this context, I’d like to remind you of what Trump said last November 👆.\n\nAnd some might see a connection to tonight's report from The Wall Street Journal about the warning the Iranians received from the Americans regarding the attack..."}, {"id": "150f7e20-c47f-4f73-a382-c90eefadb846", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32124/", "date": "2024-08-08 19:34", "message": "Additional footage of Palestinians evacuating from eastern Khan Yunis, taken earlier today."}, {"id": "24dc8fac-1eeb-497e-83c0-87b307e68593", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32123/", "date": "2024-08-08 19:34", "message": "The military wing of Hamas released footage today of an RPG attack on a remotely-operated M113 armored personnel carrier (known as \"Zelda\",) later showing  an explosive device being attached to it. The event was filmed three days ago in Tel al-Sultan, Rafah.\n\nAs mentioned, according to reports from Gaza, these types of armored vehicles are remotely operated and contain explosives rather than soldiers. Based on the footage, it can be assumed that the militants in the video were aware of this, which is why they felt comfortable filming the attack for a relatively long period compared to other videos."}, {"id": "d395d54a-b2c1-4b11-86ca-73afb46be221", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32122/", "date": "2024-08-08 18:46", "message": "Documentation attributed to the Israeli attack on weapons warehouses at the Shayrat airfield in eastern Homs in Syria."}, {"id": "3169e100-c36f-4d88-ba63-009eae27979e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32121/", "date": "2024-08-08 18:45", "message": "Following the report here 👆 about the cargo planes that landed in Syria today, Syrian channels reported a short time ago on an Israeli attack on the Shayrat airfield in Homs, Syria.\n\nAccording to other sources, an weapons warehouse was attacked. There are reports of secondary explosions."}, {"id": "06afe7f6-659b-41ba-947f-170b60de0a9d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32120/", "date": "2024-08-08 18:43", "message": "The Wall Street Journal from an American executive:\n\nWe warned Iran that it would suffer a devastating blow if it carried out a broad attack against Israel.\n\nWe sent a message to Iran that there is a danger of escalation if its reaction is broad.\n\nOur message did not include a threat of an American attack against Iran.\n\nWe warned Iran of the consequences for its economy and the stability of its government if it carried out a broad attack on Israel."}, {"id": "eeb4e40c-3323-4ce3-abff-0594ce774a74", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32119/", "date": "2024-08-08 17:39", "message": "Documentation of the demolition of the Abu Hanifa al-Na'aman mosque in the Kashta district in Rafah (south of the Gaza Strip)."}, {"id": "1c304432-5349-4c1d-a3b0-3f8ac40c6877", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32118/", "date": "2024-08-08 17:36", "message": "Posters of Yahya Sinwar were hung today on the walls of the historic Diyarbakır Citadel in southeastern Turkey."}, {"id": "dc4057c9-f524-4898-bcf1-fb9a7929bd89", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32115/", "date": "2024-08-08 17:35", "message": "Three cargo flights, one from Russia and two from Iran, landed in Syria today."}, {"id": "60b4a66e-6b3c-4207-bd28-d4cb8cf7a050", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32114/", "date": "2024-08-08 17:35", "message": "Hezbollah announces a death in its ranks:\n\nHassan Aatef a-Sid. Born in 1978 from the village of Aitaroun.\n\nHe was injured in an IDF attack yesterday afternoon in Aitaroun in southern Lebanon and died today from his wounds.\n\nNumber 402"}, {"id": "01df1022-d993-452f-9fc0-db3d252b3905", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72882/", "date": "2024-08-08 16:21", "message": "American military presence in the region continues to increase."}, {"id": "778b836b-e14e-4123-b21e-4f7615ff065c", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72875/", "date": "2024-08-08 15:15", "message": "Palestinian channels report that the death toll in the attack on the two schools in Gaza City rose from 15 to 32."}, {"id": "b9a16f9d-78c4-41e1-b9f9-492bb83f52af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32128/", "date": "2024-08-08 15:14", "message": "Khan Yunis exodus: the sights are truly apocalyptic this time."}, {"id": "dca3d63b-4ca6-4771-b8d6-911a6cc42c1d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32128/", "date": "2024-08-08 15:13", "message": "The Khan Yunis exodus: this is one of the most popular photos on Palestinian channels right now - from the current evacuation.\nOne Gazan gave a title to the photo:\n\"Doomsday horrors\"\n\n##\nThe Palestinians look at the picture from an Islamic theological angle. Elements of the end times.\nThe shock is great. The number of evacuees is high."}, {"id": "a6e460c7-448c-476e-843c-42c04c6be31a", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72875/", "date": "2024-08-08 14:18", "message": "The flow of displaced people from eastern Khan Yunis is increasing."}, {"id": "811ec2d4-1754-4602-9544-6b5a21a5ce96", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72882/", "date": "2024-08-08 13:29", "message": "Additional documentation of Gazans evacuating from eastern Khan Yunis following the IDF announcement."}, {"id": "1a117796-0b84-4433-8ada-36ee9894624d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72869/", "date": "2024-08-08 13:11", "message": "The Palestinians update: 15 dead and 30 wounded in the attack on the two schools in Gaza City."}, {"id": "1ac0db5d-991d-4907-becd-6c2a6d5f6d99", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72873/", "date": "2024-08-08 13:07", "message": "Civil Defense in Gaza City: 7 killed in the attack on the Zahra school and 5 killed in the attack on the Abdelfattah Hamouda school (Yafa Street)."}, {"id": "686eef97-a64c-47ad-8eb3-d83a759972fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72875/", "date": "2024-08-08 13:06", "message": "IDF Spokesperson: A short while ago, the IAF conducted an intelligence-based strike on Hamas command and control centers inside of which Hamas terrorists were operating. The command centers were embedded in the areas of the 'Abdelfattah Hamouda' and 'Al-Zahra' schools in Daraj Tuffah. The school compounds were used by Hamas terrorists and commanders as command and control centers, from which they planned and carried out attacks against IDF troops and the State of Israel.\n\nPrior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of precise munitions, surveillance, and additional intelligence.\n\n##\nI will point out that in the recent times when the IDF attacks schools and \"sensitive sites\" in the eyes of the international community, the IDF preempts, unlike in the past, and publishes shortly after the attack the background that led to it.\n\nI think this is a welcome change - to start playing on the field of international consciousness at zero time, similar to the Palestinians. It is also worth adding visual aids immediately with the attack. Visuals are the name of the game."}, {"id": "b3b3ba16-1d21-4cfe-90e6-97cd61ed79a4", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72873/", "date": "2024-08-08 13:04", "message": "The Palestinians report deaths and injuries a short time ago as a result of an attack on two school complexes in Gaza City:\n'Al-Zahra' school, in the Darj neighborhood.\nAbdelfattah Hamouda School, on Yafa Street, in the Tuffah neighborhood."}, {"id": "7920aa36-9d98-4791-86c9-b89911976dbf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32128/", "date": "2024-08-08 13:01", "message": "Gazans are evacuating from east Khan Yunis."}, {"id": "191b2020-da73-40e3-9257-51851784c6fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72869/", "date": "2024-08-08 13:01", "message": "The Palestinians report the movement of IDF vehicles in the Kissufim area in eastern Khan Yunis - this certainly contributes to speeding up the evacuation of the population..."}, {"id": "8ea1b836-56b8-4c8a-9692-de6f91f9cfef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32101/", "date": "2024-08-08 12:07", "message": "The prominent quote on Palestinian channels from Prime Minister Netanyahu's interview with Time magazine:\n\nThe war in Gaza is not going to end soon."}, {"id": "9d444226-e8ab-49fc-9301-197d1a48b911", "channel_id": 1560386984, "url": "https://abualiexpress.com/en32101/", "date": "2024-08-08 12:06", "message": "First documentation of the movement of displaced people from east of Khan Yunis (Khuza'a and Abasan) towards the west, following the IDF spokesman's announcement in Arabic."}, {"id": "68801b5f-36dd-4138-8987-5c73a5522626", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32095/", "date": "2024-08-08 12:05", "message": "A short time ago, the IDF spokesman in Arabic published an extensive evacuation alert for the area east of Khan Yunis and parts of the center of Khan Yunis west of the Salah al-Din axis.\nIncluded in the evacuation are: Salqa, Qarara, Bani Suheila, Abasan, Khuza'a, Sheikh Nasser neighborhoods, Khan Yunis Center and a-Satar and al-Mahta areas.\n\nGazans are asked to evacuate to the west into the dense humanitarian area of ​​West Khan Yunis.\n\nLet's hope that this time the evacuation warning will also be accompanied by artillery fire, otherwise the effectiveness of this tool used to evacuate the population will be further undermined."}, {"id": "29798b72-2db8-4086-89b1-f416e87e02da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32094/", "date": "2024-08-08 11:52", "message": "Southern Lebanon:\nsraeli attack a vehicle between Jebbayn and Yarine in southern Lebanon.\n\nUnofficial Lebanese channels report two wounded in the attach which they claim was carried out by a suicide drone."}, {"id": "e6b15206-5b80-4f42-a1a8-eb259895d256", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32093/", "date": "2024-08-08 11:47", "message": "The Palestinians report an IDF attack earlier this afternoon in the Sheikh Nasser area of ​​Khan Yunis in the center of the Gaza Strip.\n\nEarlier, the Palestinians reported 15 dead in an IDF attack on two buildings in Block 5 and Block 12 in the Bureij refugee camp in the southern Gaza Strip.\n\nIt was also reported that tanks were seen moving on the coastal axis of the Netzerim area towards the new camp in the northern Nusierat area (the center of the Strip)."}, {"id": "0f614670-aa2b-49da-abf6-8fd957e15a8c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32091/", "date": "2024-08-08 11:45", "message": "Turkey: After the Turkish Ministry of Communications blocked access to Instagram, the block also extends to the popular international online game Roblox, and access to 27 leading VPN servers in Turkey that made it possible to bypass the blocks was also blocked.\n\nErdogan is tightening his grip and censoring content that is an \"inconvenience\"."}, {"id": "9a542ca2-c3ec-4371-aef8-aa49b090fe0c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32090/", "date": "2024-08-08 11:43", "message": "Rafah.... The Palestinians did not love the format...\n\nDo they pass as undercover? (:"}, {"id": "f0ff0b89-c481-4aa8-8d37-86606755b2f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32089/", "date": "2024-08-08 10:04", "message": "The Lebanese Al Mayadeen:\nHamas is waiting for Yahya Sinwar's decision on who will be appointed as his deputy.\nAmong the leading candidates for the position: Khaled Mashal, Khalil al-Hayya (who was his deputy as leader of Hamas in the Gaza Strip) and Musa Abu Marzouk."}, {"id": "5a19124f-dc40-4c5a-a9a5-c2e390bd5d7e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32088/", "date": "2024-08-08 08:56", "message": "The background is the eulogy 👆 that Ekrima Sabri broadcasted in honor of Ismail Haniyeh last Friday at the Temple Mount."}, {"id": "96cc7fe2-f7ce-42c6-8cbd-6c81cb8e2a99", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32087/", "date": "2024-08-08 08:55", "message": "Al Jazeera from the lawyer of the inciting Sheikh Ekrima Sabri: The Israeli police decided to prevent Sabri from entering the Temple Mount for six months."}, {"id": "63108e79-a00b-4bbc-9482-fc4d3f670d88", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32086/", "date": "2024-08-08 08:44", "message": "Dr. Talaat Fahmi, spokesman for the Muslim Brotherhood, welcomes the (Islamic) revolution in Bangladesh."}, {"id": "ab114285-7699-456f-9271-cfc8a0141f9e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32085/", "date": "2024-08-08 08:43", "message": "The coup in Bangladesh: Muslims destroy Hindu temples."}, {"id": "404ea7e5-5db0-4382-a28c-c11ead5db8ad", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32084/", "date": "2024-08-08 08:27", "message": "The Palestinian Ministry of Foreign Affairs: We demand that the Criminal Court in The Hague issue an arrest warrant against Minister Smotrich.\n\n###\nThis comes against the background of Smotrich's statement that perhaps it is moral to starve 2 million Gazans until the Israeli abductees are returned."}, {"id": "5f6558fb-b00e-402b-89a8-ba2bc72c39dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32082/", "date": "2024-08-08 08:01", "message": "Mike Johnson, speaker and chairman of the American House of Representatives - a Republican - yesterday called on the Biden administration to remove the current restrictions on arms shipments to Israel.\n\nOn the other hand, Kamala Harris, the Democratic presidential candidate, according to a report by the New York Times, is open to discussing an arms embargo on Israel at the request of pro-Palestinian groups."}, {"id": "c5072633-f896-48be-a807-75e46c35cb1c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32081/", "date": "2024-08-08 07:59", "message": "A popular video this morning on Palestinian channels:\n\nقوات الاحتلال تواصل عمليات نسف المربعات السكنية في رفح جنوب قطاع غزة\n\nThe occupation forces continue to blow up residential complexes in Rafah in the southern Gaza Strip.\n\n##\nIn the reactions to the video, it seems that it turns the Palestinians inside out and hurts them a lot.\nAny issue related to land, including real estate, is a particularly painful point for them.\nThe soldiers also do a pretty good imitation of Gazan TikTok personality Awad Barabakh..."}, {"id": "eecac721-b878-4fc7-882f-e1756b8ead83", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32080/", "date": "2024-08-08 07:46", "message": "A month and a day have passed since the last appearance of Abu Obaida, the spokesman for the military wing of Hamas.\n\nSince his last appearance, Muhammad Deif, Rafa'a Salameh (Major General of Khan Yunis), Ismail Haniyeh, and the Hezbollah Chief of Staff Fuad Shukr were all eliminated... and Yahya Sinwar was appointed the big boss.\n\nIt would be appropriate for him to issue at least a tweet...\n\nWhere did he go?\nHis friends are worried..."}, {"id": "1f8fa153-c7d8-43cf-a437-be65e54f4a69", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32079/", "date": "2024-08-08 05:59", "message": "Kamala Harris election rally tonight in Detroit\n\nPro-Palestinians shouted at her - \"we will not vote for genocide\" and interrupted her speech.... Harris responds:\nIf you want Trump to win, then say that, otherwise... I'm speaking."}, {"id": "78f6f089-2b79-438e-b3c0-7bf16a5771cd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32078/", "date": "2024-08-08 05:56", "message": "The Palestinians claim that Nadi Salut, a Palestinian working for the World Kitchen Organization, died of his wounds tonight.\nAccording to them, he was injured during an attack in the Deir al-Balah area while he was working.\n\n##\nA few months ago, the USA was furious with Israel following the death of several Europeans from this organization due to an erroneous Israeli attack."}, {"id": "aa218075-38e4-49a4-8406-a7affeab6fc2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32077/", "date": "2024-08-08 05:55", "message": "Further to the report here 👆 on August 2, the IDF spokesperson updates:\n\nJoint IDF and ISA announcement:\n\nThe IDF and ISA eliminated a senior Hamas terrorist in the Gaza Strip who was involved in directing terror attacks in Judea and Samaria\n\nOn July 24th, during a joint IDF and ISA activity, a location in which the senior Hamas terrorist Nael Sakhl operated was struck in the Gaza Strip. \nSeveral days following the strike, intelligence was received, indicating that he was eliminated.\n\nFor over a decade, Nael operated in Hamas' \"West Bank Headquarters\", an organization responsible for directing terror activities in Judea and Samaria. In parallel, he was involved in directing terror activities, financing and supplying weapons to terrorist cells that promoted terror attacks against Israeli civilians and IDF soldiers in Judea and Samaria."}, {"id": "da76814e-4490-4155-8be7-cd895dcd0f66", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32076/", "date": "2024-08-08 05:52", "message": "Do you remember the documention 👆👆 that I published over the last few days of Gazans from the center of the Gaza Strip robbing fruits and vegetables from supply trucks that are supposed to reach the north of the Gaza Strip?\n\nWell, with a fierceness that is hard to describe, last night the spokesperson of the Civil Defense in Gaza, Mr. Mahmoud Besal claims that Israel has been preventing the introduction of fruits and vegetables into the northern Gaza Strip for 91 days..."}, {"id": "ca3b8665-d328-468e-9ad2-fe20a69e14c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32072/", "date": "2024-08-08 05:48", "message": "Last night in Dura, Hebron IDF forces destroyed the home of Muamen Masalma, the terrorist who carried out the stabbing attack in Gan Yavne at the end of March, in which an Israeli was murdered and two others were injured."}]