[{"id": "07c392b0-e779-4f44-9cbb-e87b64ee8e15", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33108/", "date": "2024-08-25 19:37", "message": "Volume on\n\nSyrian exile Shazar provides a summary of Nasrallah's speech.\nYou don't need to understanding Arabic...\n\n##\nOn the same matter, I will quote the words of a Lebanese journalist about Nasrallah's speech this evening:\n\nIf you need to explain and detail the importance of a military strike - it is probably not important.\nThe Japanese did not need to be explained the importance of the attack on Pearl Harbor.\nRommel did not have to go out and explain the importance of the battle at El Alamein.\nIsrael should not have come out and explained what it means to assassinate Imad Mughniyeh and Fuad Shukr.\n\nThe results of a painful blow are immediately apparent and there is no need to explain them at length...\n\n##\nGo out and learn, Ya Nasrallah!"}, {"id": "031a9ca8-0a6b-4f6a-aeb5-92146e0465af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33107/", "date": "2024-08-25 19:10", "message": "I'm waiting for David the company sergeant major to open a falafel stand - Philadelphi branch 👆, like he did in Netzerim...\n\nNow that there is already a paved road, clients will be able to get there easily... maybe even on a scooter..."}, {"id": "485e7fed-e212-45f0-be3d-7b444f5259ee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33106/", "date": "2024-08-25 19:05", "message": "IDF: Sirens sounded in Rishon LeTsiyon, central Israel."}, {"id": "d2f7de81-304d-4fb5-9f84-ee5e625be6a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33105/", "date": "2024-08-25 19:04", "message": "The military wing of Hamas recently accepted responsibility for launching an M-90 rocket towards Tel Aviv."}, {"id": "6c749c69-69ba-4de2-afb4-ae67c0f54ef1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33104/", "date": "2024-08-25 18:54", "message": "Palestinian sources report that Zahar Redad, who was arrested about a month ago, who was wounded and carried on the hood of an IDF jeep in the north of Tulkarm, died today of his wounds in the hospital in Israel, according to the announcement of the liaising organizations.\n\nThese sources also reported that Redad, a Hamas operative, was the one who carried out the attack near the Harmesh settlement about a month ago, in which four Israelis were slightly injured."}, {"id": "e32495b4-5adf-4ffd-a564-bf818be1462b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33103/", "date": "2024-08-25 18:47", "message": "Dahiyeh, Beirut: After Nasrallah's speech, supporters of the organization were instructed to take to the streets \"and celebrate Hezbollah's powerful response\" to the assassination of Fuad Shukr.\n\nAfter all, we are in a war of consciousness and Hezbollah wants to show, to establish a narrative, that it will avenge an act of assassination and avenge it properly...\n\nAccording to what can be seen in the video, the celebration is quite forced... I have seen more serious celebrations than these among Hezbollah supporters."}, {"id": "10205a5f-87b9-40c5-8690-3f252bb7ecc5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33102/", "date": "2024-08-25 18:37", "message": "Senior Hamas official Izzat al-Risheq:\n\nThe Hamas delegation left Cairo this evening.\n\nThe delegation demanded to force the occupation to commit to what was agreed upon on July 2.\n\nHamas is ready to implement what was agreed upon on July 2.\nAny agreement must include a permanent ceasefire, a full withdrawal from the Strip, the return of the displaced to their homes, the restoration of the Strip and a serious prisoner deal.\n\n##\nAccording to the rumors from senior Hamas officials - there was no breakthrough in Cairo..."}, {"id": "128f064a-e539-4c37-9ddc-4fc4d4a604b4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33101/", "date": "2024-08-25 18:36", "message": "IDF: The Chairman of the Joint Chiefs of Staff, Gen. Charles Q. Brown, Jr. landed in Israel this evening (Sunday), and is due to meet with the Chief of the General Staff, LTG Herzi Halevi, as well as additional members of the IDF General Staff Forum."}, {"id": "a9789dd7-7a70-44fd-b7b1-65ad79a2c365", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33100/", "date": "2024-08-25 18:34", "message": "Hamas senior Osama Hamdan:\nThe American administration is planting false hopes and talking about an imminent agreement for reasons related to the election campaign."}, {"id": "81342eb4-22f6-46cc-b361-fdfa2eb52ef2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33099/", "date": "2024-08-25 18:34", "message": "Amit Segal's publication about the construction of a road on the Philadelphi axis is making waves among Arab, Gazan and Palestinians online...\n\nThis is the kind of report that shocks them: it is a change in the ground, a change in reality. something that can become permanent. Definitive proof of the loss of territory caused to the Gazans following October 7th."}, {"id": "c7f08e64-c0e0-4c2f-90f9-1599946efe28", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33103/", "date": "2024-08-25 18:32", "message": "Deir al-Balah - the Palestinians report the evacuation of the Shuhada al-Aqsa hospital - the main hospital of the center of the Gaza Strip (not evacuated so far), following an attack near the hospital and due to the evacuation directive issued by the IDF spokesman in Arabic."}, {"id": "c6082ae2-fc88-453e-ac09-ecd4e4629473", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33096/", "date": "2024-08-25 18:31", "message": "The spokesman for the military wing of Hamas, Abu Obaida, sends a congratulatory tweet this evening to Hezbollah on the occasion of the revenge response and is quite flattering: you have changed the reality in a strategic way.\n\nStill no mention on Abu Obaida's channel of the issue of the assassination of Ismail Haniyeh, even though the operator of his channel tweeted four times since the assassination...\nAnd this time, neither a voice recording nor a video clip, but a tweet that anyone with access to the channel can write..."}, {"id": "4c1642f5-4283-4902-9448-90b3d407b629", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33093/", "date": "2024-08-25 17:32", "message": "Gazans are evacuating from Deir Al-Balah (not far from the Shuhada al-Aqsa Central Hospital), following the instructions of the IDF spokesman 👆."}, {"id": "19dad06b-0696-4f32-bb7b-7603015351db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33092/", "date": "2024-08-25 17:30", "message": "At the end of Nasrallah's speech, he said:\nThe enemy must understand: Lebanon is not weaker and he cannot invade it as before with a military band.\nA day will come when we will invade Israel with a military band.\n\nWith this his speech ended, an hour after it started.\n\nEven though Nasrallah left the issue of \"completion of the response\" seemingly open, I would allow myself to bet and read between the lines: the response to the elimination of Fuad Shukr has been completed.\n\nOfficials in Israel should not insist too much on publicly humiliating Nasrallah regarding today's attack.\n\nA little formal ambiguity is fine, and he will fnd his way out of the situation himself... and move on..."}, {"id": "2ae42e7e-9fbf-437c-bfbb-db2c3edcb425", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33091/", "date": "2024-08-25 15:53", "message": "Nasrallah regarding whats next:\n\nWe will continue to follow the results of the attack today.\nIf the result seems to be satisfactory, we will decide that the response on the elimination of Fuad Shukr has been completed.\n\nIf it seems that this is not enough and it is necessary to continue the response, we will do so at a later time."}, {"id": "8f722012-e216-461d-a426-6246650c492d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33090/", "date": "2024-08-25 15:53", "message": "Nasrallah:\nThe enemy did not dare to harm civilians in Lebanon today. He attacked outside the villages.\nThis is because of the \"resistance\"."}, {"id": "7d94ba9e-c69a-40c4-a434-21a6ef572159", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33089/", "date": "2024-08-25 15:47", "message": "Nasrallah:\n\nToday we saw the courage of the \"resistance\" who made the decision to attack despite all the threats.\nOpen shelters in Tel Aviv. They closed Ben Gurion Airport.\nThe \"resistance\" decided and followed through."}, {"id": "a894da73-f6ec-492d-be70-2af9f29ad4a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33088/", "date": "2024-08-25 15:44", "message": "Nasrallah:\nAll the launchers that were attacked this morning by the enemy were not intended as part of the response.\n\nTherefore there is no preemptive attack here.\n\nThe planning of our response attack this morning was not affected at all by the Israeli attack."}, {"id": "c0da6f3a-6840-4159-b1a0-0057176a668e", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74051/", "date": "2024-08-25 15:42", "message": "Nasrallah admits:\nSeveral dozen launchers with rockets were destroyed today (Katyusha launchers)."}, {"id": "afd6d7e4-3111-4cf6-9d2c-5ad6b7d5fd56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33086/", "date": "2024-08-25 15:42", "message": "Nasrallah:\n\nEach launcher costs us $8,000-$10,000.\nWe have thousands of them.\nEven if they destroyed a few Katyusha launchers it doesn't matter to us."}, {"id": "662c7706-0c2c-461e-8486-f2137a9cee2c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33085/", "date": "2024-08-25 15:42", "message": "Nasrallah:\n\nThe Israelis are big liars. They always say that they attacked warehouses of military weapons and strategic missiles - so that they would pleased... but we are silent... these places have been evacuated."}, {"id": "c269af73-b0f2-4d02-99a5-1c7e84ffef79", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33084/", "date": "2024-08-25 15:40", "message": "Nasrallah:\n\nWe have no problem with the propaganda that the Israelis spread to raise their morale, but these are lies:\n\n1. We wanted to launch 320 rockets and we launched 340. More than planned - they didn't thwart anything. There is no truth in the report of thousands of rockets.\n\n2. We launched dozens of UAVs as planned.\n\n3. We did not launch ballistic missiles or precision missiles."}, {"id": "4ed254c4-0845-498f-99e6-b67aef593b0c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33083/", "date": "2024-08-25 15:32", "message": "Nasrallah:\n\nAccording to the data we have, the UAVs reached the targets in Glilot and Ein Shemer."}, {"id": "ce625e9d-0675-4f54-b332-94c93c1e5d56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33082/", "date": "2024-08-25 15:31", "message": "Nasrallah:\n\nAll the UAVs that were launched successfully crossed into Israel, including those that traveled a long way from the Beqaa area."}, {"id": "a5b2d1b5-39b8-476c-ab97-dc2ea3a4378f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33081/", "date": "2024-08-25 15:30", "message": "Nasrallah:\nNot a single launcher was hit before we attacked."}, {"id": "f3816c18-dfba-42b1-934a-1af14bad6ccf", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74046/", "date": "2024-08-25 15:30", "message": "Nasrallah:\n\nWe chose the 40th day.\nAt night all the rocket launchers were already prepared for the attack and so were the UAV launchers.\nWe also launched UAVs from the Beqaa area for the first time."}, {"id": "f238a0e8-2d0b-48c5-a511-faf01b40eb58", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33079/", "date": "2024-08-25 15:29", "message": "Nasrallah:\n\nAll the outposts in the north were attacked with Katyushas.\nWe launched 300 rockets, that's what we decided in advance. This is a sufficient amount for 11 outposts and the engagement of the Iron Dome.\n\nRegarding the UAVs: some were launched to Ein Shemer, but the majority were launched to Glilot."}, {"id": "79212919-cecc-42b9-8e68-76b443df78dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74045/", "date": "2024-08-25 15:28", "message": "Nasrallah:\n\nThere was another goal - a number of Israeli facilities and outposts in the north of Israel - for the benefit of engaging the Iron Dome so that the UAVs could reach their target in central Israel."}, {"id": "efaac4b2-9487-4602-ac74-b41bef45342c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33077/", "date": "2024-08-25 15:26", "message": "Nasrallah:\n\nIn the same area, Glilot, there is a base of the Mossad and there is a base of unit 8200.\n\nThe target is 110 km from Lebanon and very close to Tel Aviv.\nThis is the main goal.\n\nWe also chose a secondary target: an air force base in the Ein Shemer area, 75 km from the border with Lebanon.\n\nThose were the two targets today."}, {"id": "7f71f9ff-daaf-451b-b6fe-1af0a5a55a71", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33076/", "date": "2024-08-25 15:25", "message": "Nasrallah:\n\nCivilians were killed in the attack in Dahiyeh, so we had the right to attack civilians.\n\nDespite this, we decided to attack a military target and not a civilian target and not infrastructure.\n\nWe decided to attack a military target of an intelligence nature in the Tel Aviv area, in the depths of the entity.\n\nWe chose a target: Glilot base."}, {"id": "6b4a82cd-9576-48bf-a278-61d05a59f305", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33075/", "date": "2024-08-25 15:24", "message": "Nasrallah admits:\nThere was also a lot of tension in Lebanon in anticipation of a response and a psychological war was being waged against the Lebanese in this regard. That's why we decided to respond."}, {"id": "b7f62fd3-581d-45f4-8892-c408ac68f04d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33074/", "date": "2024-08-25 15:23", "message": "Nasrallah:\n\nHezbollah announced that it would respond to the elimination of Fuad Shukr in order to maintain the equation with the enemy.\nIt could not be given up.\nWe will call today's attack \"the 40th day attack\" (40 days since the death of Imam Husayn ibn Ali, the grandson of the Prophet).\n\nWe were ready but the response was delayed.\nThe enemy was on high alert.\nThe delay in response is a punishment for the enemy. The vigilance exhausts him. This is part of the punishment.\n\nWe needed some time to consult how the axis of resistance would react, whether individually or together.\nIn addition, we decided to give a chance to negotiations for a ceasefire in Gaza.\n\nWe gave sufficient opportunity, but Netanyahu and the Americans just killing time."}, {"id": "7680d7c0-dc79-43ed-aa52-e517ba46af0d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33073/", "date": "2024-08-25 15:09", "message": "Nasrallah's speech began a few minutes ago (right on time)."}, {"id": "4917da6f-2ad6-4221-b0a6-7a49b0ac1162", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33072/", "date": "2024-08-25 14:58", "message": "A short time ago, the IDF spokesman in Arabic published an evacuation notice for the residents of a neighborhood in the center of Deir al-Balah, which is west of the Salah al-Din axis.\nIts residents are asked to move west.\n\nThis is the first time that these residents have received an evacuation notice."}, {"id": "cfa75dbc-accf-4777-8c2d-729bae64da02", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33071/", "date": "2024-08-25 14:35", "message": "The IDF announces the death of David Moshe Ben Shitrit, from the Navy's 914th Squadron.\n\nAccording to Israeli media, he was killed from fragments of an Iron Dome interceptor that struck his vessel during the Hezbollah attack.\n\nMay his memory be a blessing."}, {"id": "607beb1e-3998-4252-9ffd-d7d721c1cbb9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33070/", "date": "2024-08-25 14:19", "message": "Hezbollah’s reporter Ali Shoieb:\n\nAfter Hezbollah fulfilled its commitment and responded to the Israeli attack on the Dahiyeh area in Beirut, and after thwarting the objectives of the Israeli strikes on southern Lebanese villages by launching hundreds of rockets at enemy bases (according to Shoeib, Hezbollah thwarted the IDF’s preemptive strike), Hezbollah has returned to its usual role of supporting Gaza and attacked a technical facility in Kibbutz Manara.\n\n##\nIt’s interesting what Ali Shoieb is saying here. As Hezbollah's mouthpiece, he is the first to publicly announce \"Hezbollah's narrative\" - and now he is claiming that Hezbollah has already fulfilled its commitment regarding the assassination of its top commander, and is now returning to its \"regular role\" in the ongoing war. This contradicts Hezbollah's announcement this morning that its attack was just the first stage of the response to the assassination of Fuad Shukr. \n\nSo which one is it? In just a few moments we'll probably get an answer from Nasrallah on this."}, {"id": "6a13da1b-7284-4c9a-95d0-a0dd5aab1d26", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33069/", "date": "2024-08-25 14:10", "message": "A Syrian social media user joins in on mocking Hezbollah: \"Poultry prices in Israel are skyrocketing following Hezbollah's attack...\""}, {"id": "582ecef5-b180-4a4d-8e65-bb9a97780af6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33068/", "date": "2024-08-25 14:07", "message": "Reuters from a senior Hezbollah official:\n\nThe response to the assassination of Fuad Shukr was delayed due to political reasons, the most important of which is the ceasefire talks in Gaza.\n\nWe wanted to make sure that the response to the assassination would not result in an all-out war..."}, {"id": "d3f0f58e-3036-4b3f-853f-ec9527216a74", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33067/", "date": "2024-08-25 13:47", "message": "Trump, on what's happening in the Middle East today:"}, {"id": "9d4758d2-45f9-4be5-8166-57c15b04fce2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33065/", "date": "2024-08-25 13:03", "message": "CBS network from a senior American source: \"The attacks carried out by Hezbollah did not surprise the Biden administration.\""}, {"id": "58a683a5-b946-4d85-bc0e-dfb52dc09a80", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33064/", "date": "2024-08-25 12:11", "message": "Chairman of the Joint Chiefs of Staff, General Charles Q. Brown Jr., met today in Cairo with Egyptian President a-Sisi."}, {"id": "6a3b0050-6ff4-45e3-ae49-e24745af984f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33062/", "date": "2024-08-25 12:03", "message": "Hezbollah announces two deaths in its ranks:\n\nKhader Souaid\nHamza Zaghlout\n\nBoth are residents of the village of Hariss in southern Lebanon. They were killed in an IDF attack this morning in a-Tiri\n\n432 dead for Hezbollah since the beginning of the war."}, {"id": "bce25933-b5e4-46d4-add0-57518a17f031", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33061/", "date": "2024-08-25 11:18", "message": "Hamas and the Islamic Jihad commend Hezbollah for the \"powerful response\" to the assassination of Fuad Shukr\n\nHamas in an official announcement: Congratulations to Hezbollah for the high-quality and strong response in the depth of the Zionist entity which is a slap in the face of the fascist occupation government...\n\nThe Islamic Jihad in a proclamation: Congratulate the brothers in Hezbollah for the attack in depth of the raping entity and the success in delivering the bold and courageous blows...\nThe enemy only understands the language of power."}, {"id": "56bb0897-c10d-42a2-83fa-7593eae2395a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33060/", "date": "2024-08-25 11:16", "message": "IDF Spokesman: \"We thwarted most of the attack that Hezbollah planned and intercepted most of the threats that were launched against the territory of the State of Israel.\""}, {"id": "f300b577-c952-4a73-b112-919d41e9e92a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33059/", "date": "2024-08-25 10:38", "message": "More memes from social media mocking Hezbollah on its attack on Israel this morning:\n\nLeaders and military heads of the chickens held an urgent meeting today to figure out how to respond to Hezbollah's attack on the chicken coop.\n\nLet’s hope that both sides exercise restraint..."}, {"id": "8334bb1b-9e42-4783-9df7-7009fafdea5e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33058/", "date": "2024-08-25 10:27", "message": "Supporters of the Syrian opposition:\n\nBelow - Homs after Hezbollah's missiles\nAbove - Tel Aviv after Hezbollah's missiles"}, {"id": "d1fde060-4530-4510-bfd4-81cb3dd199be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33057/", "date": "2024-08-25 09:57", "message": "IDF: It was decided that restrictions will be lifted in the areas of the Upper Galilee, specified communities in the southern Golan, the Lower Galilee, the Central Galilee, the Beit She'an Valley, the Valleys, the Haifa Bay, the Carmel, Wadi Ara, Menashe, Sharon, and Dan.\n\nIn specified areas of the confrontation line, the northern Golan, and specified communities in the southern Golan, partial activity will be permitted as detailed in the defensive guidelines."}, {"id": "ff7c6b0d-c1a9-4345-9139-5bc49b2e1c3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33056/", "date": "2024-08-25 08:17", "message": "The leader of the Dutch Party for Freedom Greet Wilders addresses this morning's exchange of fire between Israel and Hezbollah.\n\nhttps://x.com/geertwilderspvv/status/1827598071787647042?s=19"}, {"id": "5928a21d-4665-4801-967a-c745b301331b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33053/", "date": "2024-08-25 08:15", "message": "Lebanese channels claim that an Israeli drone crashed in Ain Tanta in northern Lebanon this morning."}, {"id": "ef25aa93-1697-4f03-8d39-68ab8e44dbc3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33052/", "date": "2024-08-25 07:59", "message": "Elon Musk is calling on France to release Pavel Durov, the founder of Telegram."}, {"id": "d3cf3062-6990-4995-a79c-26a6edf7283c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33051/", "date": "2024-08-25 07:42", "message": "Lebanese Ministry of Health: Two people were killed in an IDF strike on the village of a-Tiri in southern Lebanon (a different strike from the one in al-Khiyam - AA)."}, {"id": "016208fc-02d1-44e2-b812-0970f5893fa5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33050/", "date": "2024-08-25 07:41", "message": "A military operative from the Shiite Amal Movement, a resident of the village of al-Khiyam in southern Lebanon, was killed \"while fulfilling his jihadist duty.\"\n\n##\nHe may have been the one killed in the Israeli strike in al-Khiam earlier this morning."}, {"id": "3ef42cb2-8ec6-43f8-a20e-de3ae07bea47", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33049/", "date": "2024-08-25 07:40", "message": "Hezbollah’s Third Announcement Today:\n\nAll UAVs launched on time, crossed into Israeli territory, and hit their targets on multiple routes. The mission was successful.\n\nClaims by Israel of a pre-emptive attack are false and will be disproven in Secretary General Nasrallah’s speech later today.\n\n###\n\nNasrallah is expected to speak today at 6 PM (local time)."}, {"id": "3ee7f16d-0274-4d14-b11d-354d6e5ba2eb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33048/", "date": "2024-08-25 06:05", "message": "Lebanese sources: at least one dead in the Israeli drone strike on a vehicle in the al-Khiam area 👆"}, {"id": "f92f8ef8-84de-4d60-82f6-9431c142f43d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33046/", "date": "2024-08-25 05:52", "message": "Footage of the victims of the Hezbollah attack..."}, {"id": "ad76deaa-7fb1-45d5-9e7c-d987d2c4af6e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33045/", "date": "2024-08-25 05:49", "message": "An example of what's happening online - mocking Hezbollah:\n\nحزب الله الإيراني انتقم لمقتل فؤاد شكري وهنية بضرب مزرعة دجاج إسرائيلية وسقوط عدد من الدجاجات.\n\nTranslation: Hezbollah has sought revenge for the deaths of Fuad Shukr and Haniyeh by attacking an Israeli chicken farm, resulting in the deaths of several chickens."}, {"id": "acbe5635-557a-48cd-a0dd-0706dad9d473", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33044/", "date": "2024-08-25 05:39", "message": "The battle between Israel and Hezbollah is now moving to the virtual dimension - to social networks..."}, {"id": "1dd1fbc3-3f45-450d-b671-d72a88355d3d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33043/", "date": "2024-08-25 05:38", "message": "The Lebanese Al Mayadeen from \"reliable sources\":\n\n\"The response to the elimination of Fuad Shukr was carried out in a very precise and successful manner.\nWhat the occupation army said about thwarting Hezbollah's operation is a lie and propaganda to mislead the Israeli public.\"\n\n##\nNow the \"dance of glorifying the Hezbollah attack\" will begin between the mouthpieces and tweeters of the Shiite axis and the opponents of the axis, who will mock Hezbollah's feeble and weak response to the assassination of Fuad Shukr."}, {"id": "20f49ee1-bb83-47db-94f9-1d78d27264dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33042/", "date": "2024-08-25 05:24", "message": "Lebanese media reports on an attack on a vehicle by an Israeli UAV in the village of al-Khiam in southern Lebanon.\n\nAt the same time, Lebanese media reports on attacks in other villages in southern Lebanon."}, {"id": "7ec95cee-f9ea-4ba7-bb15-bde81805aa4f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33041/", "date": "2024-08-25 05:23", "message": "The IDF, through the military reports: We hit thousands of Hezbollah launchers that were aimed at the north of the country and its center. 100 fighter jets participated in the attack.\nThe IDF thwarted the firing of thousands of rockets."}, {"id": "7a7a83cd-ad66-4794-9f48-2cfbb59f1bd7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33040/", "date": "2024-08-25 05:22", "message": "Israeli interception of a UAV launched by Hezbollah this morning."}, {"id": "efa4ec3c-e9da-4022-9384-d41534119922", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33039/", "date": "2024-08-25 04:49", "message": "It can be said that Hezbollah's attack was quite limited in terms of damages so far. The Ben Gurion airport was closed for less than two hours.\nOn the other hand, it was worth taking down the Hezbollah Chief of Staff.\nMaybe it's time to strive for more than that (:"}, {"id": "d132ce67-742f-4a03-b75c-20444264a584", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33038/", "date": "2024-08-25 04:45", "message": "The IDF spokesperson announced the fall of a soldier in the paratrooper brigade in the battle in the southern Gaza Strip.\n\nMay his memory be a blessing."}, {"id": "344292fc-17e2-4d1d-b479-11eb8d4add80", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33037/", "date": "2024-08-25 04:28", "message": "US Department of Defense:\n\nThe Minister of Defense spoke with his Israeli counterpart and emphasized to him the commitment of the US to defend Israel against attacks by Iran and its proxies."}, {"id": "d5eaa28e-a958-4bc7-b186-269917fc4499", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73992/", "date": "2024-08-25 04:28", "message": "France arrested Telegram founder Pavel Durov tonight\n\nDurov, who holds dual  French and Russian citizenship, was arrested after arriving in France on his private plane.\nHe is charged with crimes of supporting terrorism, child exploitation, drug trafficking, money laundering and fraud - this is against the background of Telegram's non-cooperation with the French authorities to prevent activities carried out through Telegram.\n\nThe punishment for the charges against him reach up to 20 years in prison in France.\n\nThe virtual currency Ton that Telegram promotes (and owns) reacted with a decrease of about 7%."}, {"id": "2a639a69-eb04-4df9-895a-b9cf6a70d36c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33035/", "date": "2024-08-25 04:21", "message": "A few hours before the Hezbollah attack and the IDF's preemptive strike, the Al Mayadeen channel published the following from a \"source in the opposition\":\n\nThe meeting of the Hamas delegation in Cairo did not lead to significant progress.\nIsrael stuck to the decision to stay in the Philadelphi axis in the first phase.\nHamas adheres to the July 2 proposal and opposes an Israeli presence on the Philadelphi axis."}, {"id": "a1438e9e-55e5-421a-8100-d3f36257f651", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33034/", "date": "2024-08-25 04:20", "message": "Hezbollah in an announcement on the nature of the attack this morning:\n\n1. The first phase of the attack, which included attacking IDF posts and equipment to facilitate the passage of the UAVs, was successfully completed. The UAVs crossed towards the target, as planned. \n\n2. 320 Katyusha rockets were launched at enemy bases. \n\n3. (Hezbollah lists 11 bases that were attacked - AA) \n\n4. The other details of the attack will be published in additional announcements."}, {"id": "e8939659-00bc-4fdd-b9aa-492ab5aa436d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33033/", "date": "2024-08-25 04:19", "message": "IDF Spokesperson: Ben Gurion Airfield will reopen to air traffic at 07:00."}, {"id": "a2c1d967-9cbc-4113-889d-ddf8f37145d6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33031/", "date": "2024-08-25 04:18", "message": "IDF attacks in Ein Qana and Rihan in southern Lebanon."}, {"id": "26c009cc-2917-4f12-8ae3-d988d6daf4d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33030/", "date": "2024-08-25 04:18", "message": "The White House: President Biden is following the events in Israel and Lebanon."}, {"id": "08d110ed-3eba-432f-8bb5-2e7f00575726", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33029/", "date": "2024-08-25 04:17", "message": "IDF: Following the situational assessment, it was determined that as of today (Sunday) at 06:00, life-saving changes will be made to the Home Front Command’s defensive guidelines.\n\nAs part of the changes, it was decided that in the areas of the northern Golan, the southern Golan, the confrontation line, the Upper Galilee, the Lower Galilee, the Central Galilee, the Beit She'an Valley, the Valleys, the Haifa bay, the Carmel, Wadi Ara, Menashe, Sharon, and Dan partial restrictions will be imposed.\n\nWe ask the public to follow the instructions of the Home Front Command regarding the situation and wait for additional instructions. \n\nThe instructions published on the official Home Front Command channels must be followed. The full instructions are updated on the National Emergency Portal and the Home Front Command app."}, {"id": "988625b0-92fe-478b-bb11-85cdcdf77fab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33028/", "date": "2024-08-25 04:16", "message": "Hezbollah has announced the beginning of its response following the assassination of its Chief of Staff\n\nHezbollah recently issued a statement declaring that this morning, on the fortieth day since the death of Imam Hussein bin Ali, the grandson of the Prophet Muhammad (a significant date in Shiite religious tradition), its operatives began their initial retaliation for the assassination of Hezbollah's Chief of Staff, Fuad Shukr.\n\nAccording to the statement, Hezbollah operatives targeted a high-value military objective using numerous drones; details of the target will be released later. This was in parallel with attacks on several IDF positions using a large number of rockets.\n\nA formal statement will be released upon the conclusion of the attacks.\n\n(Hezbollah's announcement was also prepared in advance)"}, {"id": "c75c0b80-7ecd-4fdd-9984-5f4f4512c837", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33027/", "date": "2024-08-25 04:15", "message": "Defense Minister Gallant announced: adjustments made to the situation on the home front for 48 hours."}, {"id": "727e054f-84a8-441f-b6df-d49423be4a9b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33026/", "date": "2024-08-25 04:14", "message": "Lebanese sources: Most of the Israeli attacks in southern Lebanon were in wooded and uninhabited areas, outside the villages."}, {"id": "908a8487-a77f-4776-9084-b9c4ac1e2e8a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33025/", "date": "2024-08-25 04:13", "message": "Additional footage from the wave of IDF attacks in southern Lebanon."}, {"id": "e751f7c4-d6be-4ad7-a280-0f9df45a657b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33024/", "date": "2024-08-25 04:13", "message": "Ben Gurion Airport closed around 4:30AM for takeoffs and landings."}, {"id": "a73c7a99-fa01-4617-be5b-1a2052eef835", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33023/", "date": "2024-08-25 04:13", "message": "Footage of IDF attacks in southern Lebanon\n\nThe Lebanese define them as \"Belt of Fire attacks\" - they use terminology that almost exclusively applied to attacks in the Gaza Strip to this day."}, {"id": "d39bff15-680c-4e58-824d-aadc2da68fe7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33022/", "date": "2024-08-25 04:12", "message": "The Lebanese Al Mayadeen: The wave of attacks around 5AM lasted 20 minutes."}, {"id": "a46dead0-0421-42cc-a609-415e18ceaaa1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33021/", "date": "2024-08-25 04:11", "message": "Lebanese sources report that the Air Force planes were spotted in the skies of Beirut around 5AM local time."}, {"id": "ad097173-42aa-4bd6-82a3-f6a2e2e09172", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33020/", "date": "2024-08-25 04:10", "message": "The IDF spokesperson appeals to the citizens of southern Lebanon (Arabic subtitles) and asks them to stay away from the areas from which Hezbollah is attacking - to protect themselves.\n\n##\nYou can see that this is a pre-prepared video."}, {"id": "f232af43-615e-4932-9d36-b61e236273f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33017/", "date": "2024-08-25 04:09", "message": "Lebanese sources report at least 40 attacks by the IDF around 5am in southern Lebanon - a preemptive attack, according to the IDF spokesperson."}]