[{"id": "2c0018e5-2c07-4c2f-9f04-565fd8f2c11f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28539/", "date": "2024-06-07 07:16", "message": "The figures of the dead and wounded of the Palestinian Ministry of Health in Gaza\n\nYesterday afternoon, the Palestinian Ministry of Health in Gaza reported 68 deaths in Gaza in the past day.\nThese are the numbers of the dead in the days leading up to that:\n36\n71\n40\n60\n95\n60\n53\n75\nAccording to the ministry's data, there are 36,654 dead and 83,309 wounded in the Gaza Strip since the beginning of the war.\n\n##\nDespite the Palestinian reports and their echo around the world this past week about \"terrible massacres\" and mass killing, you can see that there are no dramatic jumps in the number of dead, even according to the Hamas Health Ministry.\nThe daily death toll did not exceed 100 and on some days did not even reach 50.\nAt the start of the war the figures were in the hundreds daily."}, {"id": "2e54f670-e3ba-4fae-bc78-a1c7dd978003", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28537/", "date": "2024-06-07 07:15", "message": "Lebanon: Last night in the airspace of Al-Zahrani (about 35-40 km north of the border with Israel), Lebanese residents claim that they saw the launch of a Hezbollah air defense missile at the Israeli Air Force planes that broke the speed of sound and caused supersonic booms."}, {"id": "7ab8b4d2-68a9-470e-93c7-2c2361e1f657", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28537/", "date": "2024-06-07 07:14", "message": "Here is the quote from \"Haaretz\" this morning along with Khamenei's quote."}, {"id": "290668c2-b5b9-488e-9308-3075e5fed98f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28536/", "date": "2024-06-07 07:13", "message": "This is what the supreme leader of Iran tweeted in Hebrew yesterday:\nWe are seeing the beginning of the end of the Zionist entity, this entity is gradually melting before the eyes of the world.\n\nThere are Arabs on Twitter who made the connection between this tweet and the Haaretz editorial this morning."}, {"id": "b3f10a4e-95e9-44dd-8089-b68345305ff5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28535/", "date": "2024-06-07 07:11", "message": "The Lebanese Al Mayadeen channel quotes from the editorial of the Haaretz newspaper this morning:\nThe countdown has begun and it is only a matter of time to the final collapse of Israel.\n\nAl Mayadeen is also quoted from the editorial in \"Haaretz\": The Lebanon war will push Israel into the abyss with a lack of international legitimacy and an exhausted army\n\n##\nFor the media channels of the Shia axis, \"Haaretz\" has become the official generator of creative anti-Israeli content.\nJust copy and paste. We don't need to pay content creators on behalf of the Shia axis. And it even comes with an Israeli stamp. There is nothing better than that for them."}, {"id": "123c8d32-b85f-4b0a-8ef6-c1e2b2e34462", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68340/", "date": "2024-06-07 07:10", "message": "Trump at an election rally in Phoenix on the issue of illegal immigrants:\n\nOn the first day of my term as president, I will close the borders, stop the invasion and begin the largest deportation operation in US history. We have no choice. Biden is giving us no other choice.\n\n###\nAccording to estimates, there are about 20 million illegal immigrants in the US. The issue of illegal immigrants is a central issue for the Americans (much more so than the war in Gaza)."}]