[{"id": "b835617e-ec90-4ea0-abb3-1161ca18afb2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28641/", "date": "2024-06-08 21:13", "message": "Arab bloggers: In the video 👆 from the first moments of today's attack in Nuseirat, you can see the firing of 3 Hellfire AGM-114 missiles. They were apparently shot from the Israeli Apache helicopters."}, {"id": "5dab5f24-a3d9-4942-b42e-a6ebefd84833", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28640/", "date": "2024-06-08 21:12", "message": "On the other side, they are also starting to understand exchange rate..."}, {"id": "8c5cd167-1ac2-46dd-b1ee-868784e4bd8e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28639/", "date": "2024-06-08 19:44", "message": "After the operation to release the kidnapped today in Nuseirat and the large number of dead among the Palestinians, Israel's intelligence agencies should take advantage of the momentum and appeal again (it should never have stopped) to the citizens of the Gaza Strip to provide information about the kidnapped and the location of Yahya Sinwar if they want to prevent another incident like today.\nYou have to strike while the iron is hot."}, {"id": "03e10c48-4896-4aa0-ad30-bd721a9890f4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28638/", "date": "2024-06-08 19:42", "message": "Among the wonders of Al Jazeera's live broadcast today:\nAn angry Gazan bursts into the broadcast and wishes the President of Egypt, the Crown Prince of Saudi Arabia and the King of Jordan that Allah will avenge them..."}, {"id": "a2cab410-70f5-4cfa-8294-d53c74f9643c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28637/", "date": "2024-06-08 19:41", "message": "Hezbollah announces another death in its ranks:\n\nAhmed Yousef\n\nKilled in one of the IDF attacks today in southern Lebanon.\n\nNumber 335"}, {"id": "fb45478c-6f75-44e6-882d-9a57051a1ec6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28636/", "date": "2024-06-08 18:26", "message": "Pro-Palestinian whining: the world is busy with the rescuing of the four abductees and is not ignoring the dead Palestinians...."}, {"id": "d712086b-f6dd-459a-86d7-4c9ef4413b21", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28635/", "date": "2024-06-08 18:24", "message": "Documentation released by the IDF spokesperon from the helicopter that rescued Noa Argamani."}, {"id": "5db07646-5426-4377-af79-592ae325d0c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28634/", "date": "2024-06-08 18:22", "message": "Egypt and Jordan published messages condemning the \"barbaric attack in Nuseirat\"."}, {"id": "ddf16df8-e951-4329-8323-83fe07a1cebc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28633/", "date": "2024-06-08 18:22", "message": "The Palestinians report that Apache helicopters fired between the IDP tents in the coastal area of ​​Zawayda and Nuseirat in the center of the Strip."}, {"id": "0f4fc0fe-e79c-4f55-9f97-e02d7f8458de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28632/", "date": "2024-06-08 18:20", "message": "Hezbollah announces a death in its ranks:\n\nRadwan Issa was born in 1977 from the village of Khomin al-Hattha.\nApparently killed in the UAV attack in Aitaroun 👆\n\nNumber 334"}, {"id": "46eb98a4-5da3-4f5a-bd73-75895c7c6206", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28631/", "date": "2024-06-08 16:32", "message": "Lebanese sources: 2 dead and 2 wounded in an IDF attack in Markhaba in southern Lebanon."}, {"id": "5c2d3d0e-e5f3-417b-b378-b072cc84fcd3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28628/", "date": "2024-06-08 15:30", "message": "Lebanese sources: one of the dead in the Israeli drone attack on the \"Wahid\" station in Ayaroun in southern Lebanon is Ali Hamed.\n\nThe IDF spokesman publishes documentation of the attack."}, {"id": "86706a55-2c94-4320-9044-1a231b6acccd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28626/", "date": "2024-06-08 15:29", "message": "اللحظات الأولى للمجزرة الأمريكية الإسرائيلية بحق الفلسطينيين في مخيم النصيرات وسط قطاع غزة والتي راح ضحيتها أكثر من 210 شهداء.\n\nPalestinian channels: The first moments of the American-Israeli genocide against the Palestinians in the Nuseirat camp in central Gaza, in which more than 210 people were killed."}, {"id": "e433234f-cc4d-4481-9685-5a195db1532f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28623/", "date": "2024-06-08 15:24", "message": "Hamas in an official announcement, following Barak Ravid's report that the American hostage cell in Israel assisted today's hostage rescue operation:\n\nThis is proof of the full complicity of the US in the war crimes that Israel is commiting."}, {"id": "683d6e98-f386-4261-9975-2c876df5bc81", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28615/", "date": "2024-06-08 14:23", "message": "The street in Nuseirat where the Israeli special forces passed through as part of the rescue operation, according to Palestinian sources."}, {"id": "072fa94a-2256-4f56-98c9-8f288583a940", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28614/", "date": "2024-06-08 14:20", "message": "Al Jazeera from the Hamas information office:\n210 dead and more than 400 wounded in the IDF operation in Nuseirat.\n\n##\n It seems that the numbers were inflated to fit the narrative that Hamas chose to go with."}, {"id": "b81bb658-722f-4b02-8b4a-1957bb5462b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28613/", "date": "2024-06-08 14:20", "message": "The IDF has released footage from today's hostage rescue operation, showing the moment when three of the four hostages boarded the helicopter that flew them back to Israel."}, {"id": "f9ac6f43-8770-4b1b-b426-2f9975faad38", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28611/", "date": "2024-06-08 14:17", "message": "Gazan channels claim this truck to be the vehicle used by Israeli special forces in their hostage rescue operation in Nuseirat.\n\nThe attached clip allegedly shows the same truck leaving Nuseirat while being accompanied by Israeli tanks."}, {"id": "bf949552-c1f0-4c7e-b31d-010cc2d3cfe9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28610/", "date": "2024-06-08 13:58", "message": "Many Palestinian channels publish the attached video from the evacuation as part of today's operation in which four hostages were rescued.\n\nIn the video, an evacuation helicopter can be seen near the floating American pier, which was returned to its place just yesterday.\n\nAccording to Palestinian channels, this is proof that the floating pier is part of the Israeli war machine, and therefore from now on the \"resistance\" will treat it differently."}, {"id": "dbbf2657-c880-4117-9c71-c3879f8f2793", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28609/", "date": "2024-06-08 13:29", "message": "The Israeli police announce the death of one of it's officers today, Chief Inspector Arnon Zamora, a commander in the force's elite counter-terrorism unit Yamam.\n\nZamora was seriously injured during today's hostage rescue operation, and died of his wounds at the hospital.\n\nA true hero. May his memory be a blessing."}, {"id": "6a1f84d5-94ff-4384-affd-bb966f657f04", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28608/", "date": "2024-06-08 12:31", "message": "Unofficial Lebanese sources: 2 killed in Israeli drone strike on Aitaroun's \"Wahid station\" in southern Lebanon."}, {"id": "46a7178e-96a1-4f7d-93de-18d09f5e7232", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28607/", "date": "2024-06-08 12:14", "message": "Sources in the Nuseirat refugee camp reported that Israeli special forces infiltrated the Nuseirat market using a vehicle typically used to move the furniture of displaced Gazans.\n\nThe spokesman for the al-Aqsa Martyrs Hospital in Deir al-Balah stated that 55 bodies have arrived at the hospital so far following today's attack in the center of the Strip.\n\n##\nThere appear to be more bodies of dead Palestinians still lying in the street."}, {"id": "812bedb0-4e03-48b6-8b0b-979cb174e00c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28606/", "date": "2024-06-08 11:44", "message": "IDF spokesman quells rumours that have been circulating on social media since the announcement of the release of the Israeli hostages: \n\nHamas Chief of Staff Muhammad Deif was not killed."}, {"id": "12db936c-580f-4c12-9591-4b3f9c5c9ebf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28605/", "date": "2024-06-08 11:42", "message": "Al-Jazeera: The number of Palestinian casualties in the center of the Gaza Strip has risen to 80. There are dozens of wounded."}, {"id": "c2fd0c57-6003-49bb-b32b-e66b688675a4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28604/", "date": "2024-06-08 11:20", "message": "IDF Spokesman: A Yamam special forces officer was seriously injured in the rescue operation."}, {"id": "29e077ae-e581-4306-822c-95c877a39c03", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28603/", "date": "2024-06-08 11:11", "message": "A Gazan who supports Fatah posted the following on social media: \"A question to the senior Hamas officials - why did you keep the prisoners in (the densely populated civilian area that is - AA) the market of Nuseirat?\""}, {"id": "919ddf8d-d807-4363-b88a-af657aeb8525", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28602/", "date": "2024-06-08 10:57", "message": "Looking at the numbers in the most recent proposal for a ceasefire deal between Israel and Hamas - Israel averted the potential release of hundreds of terrorists with blood on their hands.\n\n##\nToday proved, once again, that Israel can only rely on itself."}, {"id": "9908dd84-a18a-4b27-aa73-af597ddfa943", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28601/", "date": "2024-06-08 10:49", "message": "Al-Jazeera: 47 Palestinians killed and dozens injured in the IDF's military operation in Nuseirat."}, {"id": "9a37858a-55d3-402d-bf3c-ba040cfa863a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28600/", "date": "2024-06-08 10:46", "message": "Exactly one week ago, Hamas published a psychological warfare video with the voice of Israeli hostage Noa Argmani.\n\nToday she was released. \nA heavy blow for Hamas."}, {"id": "8de3fdac-7cdc-4d20-9288-9eee2801db16", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28599/", "date": "2024-06-08 10:44", "message": "The deal that Hamas got this morning: Israel released four Israeli hostages alive in exchange for dozens of Palestinian casualties.\n\nSinwar, these are the type of deals we're after."}, {"id": "cf1373fa-6617-494f-8d5e-18230d8f4cbe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28598/", "date": "2024-06-08 10:39", "message": "Welcome home!\n\n🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱🇮🇱❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️"}, {"id": "49e9cecd-ba41-40f5-b296-307f2f0344c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28597/", "date": "2024-06-08 10:39", "message": "A joint statement by the IDF spokesperson, the Shin Bet, and the Israeli police:\n\nIn a complex operation by the IDF, the Shin Bet, and the Israel Police (YMM), four Israeli hostages were rescued this morning (Saturday). The hostages are Noa Argamani (25), Almog Meir (21), Andrey Kozlov (27), and Shlomi Ziv (40), who were kidnapped by Hamas and taken to the Gaza Strip from the 'Nova Festival' party on October 7. The abductees were rescued by Shin Bet and IDF fighters from two different locations during the operation in the heart of Nuseirat.\n\nThey are in stable medical condition, and they have been transferred for further medical examinations at the Tel Hashomer Sheba Medical Center.\n\nIsrael will continue to make every effort to bring back the hostages."}, {"id": "1b61e87a-8a59-47c0-bb87-eba0b2e51238", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28595/", "date": "2024-06-08 10:34", "message": "Al-Aqsa Martyrs Hospital in Deir al-Balah:\n\nJournalists evacuate from the tents in the hospital plaza following an evacuation call from the IDF to the nearby Hamas police station."}, {"id": "9f8a114f-383e-4929-942a-a8c57bd61bfb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28594/", "date": "2024-06-08 10:28", "message": "Gazan sources report that the \"main event\" is over and that some of the Israeli special forces evacuated via a helicopter that landed near the coast in Nuseirat.\n\nAccording to Palestinian channels, there are dozens of bodies of Palestinians in the streets following the Israeli military operation."}, {"id": "411cf302-42f1-44b8-ad99-a72a3b676607", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28593/", "date": "2024-06-08 10:27", "message": "The moment Nuseirat residents discover that there are Israeli special forces inside the city's market."}, {"id": "b4e0d88e-dfc6-459b-86dc-3566e5eee28f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28592/", "date": "2024-06-08 10:15", "message": "The military wing of the Islamic Jihad accepts responsibility for the shooting at Kissufim."}, {"id": "70639e54-e378-4326-a9d5-51e3e5107665", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28590/", "date": "2024-06-08 10:14", "message": "Gazan sources in the center of the Gaza Strip: the Israeli tanks have returned to the Netzarim corridor."}, {"id": "89c6fad2-828b-45a0-badc-e73ee4d0800f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28589/", "date": "2024-06-08 10:07", "message": "Gazan sources in the center of the Gaza Strip report that Israeli forces and tanks are withdrawing out of Nuseirat."}, {"id": "17f3d09a-fc52-4b26-9381-9f0bfb9fc433", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28588/", "date": "2024-06-08 10:07", "message": "A leading Gazan journalist from the spokesperson of the Hamas Information Bureau:\n\nIsraeli special forces infiltrated the market in the center of Nuseirat."}, {"id": "d8d6d5d7-5778-43fc-8970-7feea5bb350d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28587/", "date": "2024-06-08 10:06", "message": "Rocket fire at Kissufim, not far from Nuseirat and Deir al-Balah, where IDF forces are operating today."}, {"id": "2298fc94-2e37-4e4e-ac7f-70c26c29e8fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28586/", "date": "2024-06-08 09:52", "message": "The spokesman of the \"al-Aqsa Martyrs\" hospital in Deir al-Balah: 15 dead and dozens injured in the IDF attacks in the center of the Gaza Strip."}, {"id": "dced34ef-bad5-4a47-a77d-0f493d576762", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28585/", "date": "2024-06-08 09:48", "message": "Palestinian Channels are confirming that a large number of Israeli tanks crossed the Wadi Gaza bridge near the coast and are heading south into Nuseirat, accompanied by Apache helicopters."}, {"id": "407f4d85-14c0-47a8-bf6f-0bc2c2a0acda", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28584/", "date": "2024-06-08 09:44", "message": "Residents of the al-Bureij \"refugee camp\", located next to Nuseirat in the center of the Gaza Strip, are also reportedly evacuating."}, {"id": "ce14d877-bd98-4925-b7be-dd240ffbeb22", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28583/", "date": "2024-06-08 09:42", "message": "The Palestinians report that residents of the tents around \"al-Aqsa's Martyrs\" Hospital in Deir al-Balah are receiving evacuation calls warning of an imminent attack.\n\nSources in the center of the Gaza Strip report that IDF forces are surrounding several houses in the \"new camp\" area in northwest Nuseirat, alongside intense fire from the forces there."}, {"id": "33a3273a-ec85-43c7-8d69-8027d0188975", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28582/", "date": "2024-06-08 09:39", "message": "Confusion in the Central Camps area\n\nAljazeera channel reporter in the center of the Gaza Strip: We don't know what's going on.\n\nThere is mass hysteria in all the central camps. There are reports of many wounded and dead in the center of the strip, but there are no official numbers as of this moment.\n\nThe Palestinian Ministry of Health reports difficulties in receiving casualties at Deir al-Balah's largest medical center, \"al-Aqsa's Martyrs\" Hospital."}, {"id": "dcbe58bc-675b-4b76-984d-cc3f01cbbf48", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28581/", "date": "2024-06-08 09:36", "message": "IDF spokesperson: The IDF has recently been attacking terrorist infrastructure in the Nuseirat area.\n\nPalestinian journalists report that in addition to the attacks from the air and the movement of tanks on the ground, the Nuseirat \"refugee camp\" is also being attacked by gunfire from Israeli navy ships.\n\n##\nSea, air, land."}, {"id": "c2709ae9-e65c-4c55-9d4b-68bcdabc8a40", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28580/", "date": "2024-06-08 09:35", "message": "Following the attacks in the center of the Strip, in the area of ​​Deir al-Balah and Nuseirat, the Palestinians report the movement of displaced persons from east of Deir al-Balah towards the west (in green)."}, {"id": "f9211998-df6f-4326-8661-bc205c79e295", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28579/", "date": "2024-06-08 09:33", "message": "The Palestinians report the movement of Israeli maneuvering forces and armored vehicles from the area of ​the Salah al-Din road, at the intersection with the Wadi Gaza bridge, in the direction of Nuseirat (in red).\n\nGazan also claim on social media that Israeli tanks are moving towards the Nuseirat \"refugee camp\" from the west, from the coastal road (in blue).\n\n##\nThere is still no footage but there is definitely a lot of hysteria in the Nuseirat area."}, {"id": "1b29b1a8-27de-4e7c-8223-ee78a35ee849", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28577/", "date": "2024-06-08 09:28", "message": "Significant attacks inside Nuseirat's \"refugee camp\" are happening now."}, {"id": "0f0381f0-a63c-4cf1-880a-997b097d3848", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28576/", "date": "2024-06-08 09:28", "message": "An Israeli airstrike in Nuseirat, in the center of the Gaza Strip, a short time ago."}, {"id": "8c9116bf-84ac-47c5-a2c6-e3fb249e0054", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28573/", "date": "2024-06-08 09:27", "message": "Gazan sources in the center of the Gaza Strip report an unusual military operation in the Nuseirat \"refugee camp\" in the center of the Gaza Strip, with an emphasis on al-Aashreen Street in the east of the \"camp\".\n\nAccording to the reports, there are five Israeli Apache helicopters taking part in the attack.\n\nThere are unverified reports of Israeli special forces activity inside the Nuseirat \"refugee camp\"."}, {"id": "8f6554cb-a394-4b29-a023-2c94e9e17b16", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28572/", "date": "2024-06-08 07:47", "message": "IDF Activity in the Gaza Strip\n\nThe IDF spokesman recently reported on the IDF's activities in various areas of the Gaza Strip:\n\n1. Security around the American floating pier will be increased following its reconstruction, and in preparation for the re-entry of goods through it.\n\n2. Brigade 401 raided a military compound belonging to Hamas' Tal a-Sultan battalion in western Rafah (south of the Gaza Strip). Tunnel shafts and weapons were located.\n\n3. Division 98 is engaged in combat in the center of the Gaza Strip, specifically in the eastern sector of Deir al-Balah and eastern al-Bureij, operating near one of the tunnel shafts were rockets that were ready to be launched exploded.\n\nIn the Deir al-Balah sector, Palestinians reported this morning a new advance of Israeli armored vehicles in the Abu al-Ajeen area in the southeast of Deir al-Balah (located in the western part of central Gaza).\n\nIt's worth noting that the IDF forces have not yet conducted an in-depth maneuver in the Deir al-Balah and Nuseirat areas in central Gaza, which - after Rafah - remain the last ground targets in the Gaza Strip that the forces need to address."}, {"id": "01fd35d4-5f1c-494c-a206-6e9aa4b470c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28571/", "date": "2024-06-08 07:42", "message": "Iran: Bahrain sent a request to normalize relations with us, through Russia."}, {"id": "fd1a497e-653a-4a48-b66b-295328b05e6c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28570/", "date": "2024-06-08 07:42", "message": "Hamas is trying to counter public opinion following the revelation by the IDF spokesman that 17 terrorists were killed in the attack on the UNRWA school in Nuseirat.\n\nAfter the IDF spokesman published 👆 a new list last night of 8 terrorists who were killed in the attack on the school in Nuseirat, an event that received significant international attention, Hamas moved to a defensive position.\n\nLate last night, the Hamas information office held a press conference, claiming that 3 of the dead mentioned by the IDF were still alive and that 3-4 others were killed in different circumstances (not at the school). Hamas also published a list of 12 children it claims were killed in the attack.\n\nWhat are the following conclusions?\n1. When Israel does PR right, Hamas goes on the defensive. This is a positive development.\n2. Instead of talking about the \"massacre,\" Hamas focuses on the details of the \"massacre.\" In such a situation, the intensity of criticism of Israel is reduced. \"The issue is under investigation\" and not clear and absolute.\n3. When Israel counters Hamas's propaganda instead of observing from the sidelines, the situation improves slightly.\n\nAnd now to the main question that Israel should present to Hamas as part of the debate on the \"Massacre\":\nHamas claimed that 40 people were killed, and published a detailed lists of the names of 12 children. Hamas pretends to have extensive knowledge of the names of the casualties and the circumstances of their death. Why don't they publish the complete list of all 40 dead? Why hide? What about the other 10-11 militants? Why were they hiding in the school? Let's discuss all the names.\n\nWhich brings me to my next point, why doesn't Hamas publish the names of its military operatives who were killed in airstrikes? \n\nOne would think that the terrorist organization would pride itself in its \"martyrs\" - honor their dead, and publish the names of those killed in battle.  It appears that Hamas is more concerned about its public image. By not publishing these names, it maintains ambiguity with which it can accuse Israel of targeting civilians in schools / shelters / hospitals. \n\nEven Hezbollah does not behave this way. Hamas dishonors their dead just so it can lie and accuse Israel of war crimes. Pathetic."}, {"id": "ce9ca89b-383d-40df-a2b6-0aecf2ed5799", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28569/", "date": "2024-06-08 07:36", "message": "Berlin, Germany, yesterday: a particularly determined arrest of one of the \"keffiyehs\" by German police officers, in the heart of an Arabic-speaking area.\nThe detainee shouts in English: I can't breathe."}, {"id": "04eda536-2313-4fd1-98b1-c5695f622006", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28568/", "date": "2024-06-08 07:35", "message": "In Gaza, not everyone has time to go to an orthopedist to fix a leg brace, so you go to a friend who picks locks instead..."}]