[{"id": "3c95d377-cbd1-4fb0-8925-624b853e61e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31614/", "date": "2024-08-01 21:13", "message": "Unofficial Lebanese channels claim that Hezbollah's air defense systems were activated again a short time ago against Israeli fighter jets in the skies of southern Lebanon."}, {"id": "a298dc9f-b2fa-40a2-9a93-347130ba931d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31613/", "date": "2024-08-01 20:06", "message": "Iranian discourse on social networks: how was Haniyeh eliminated?\n\nToday, the IDF spokesman stated, in response to a journalist's question, that the Israeli Air Force did not carry out airstrikes apart from the assassination in Beirut that night - implying that Israel did not launch an airstrike at the time Ismail Haniyeh was eliminated.\n\nEarlier today it was published in the New York Times, at an interesting moment (against the American attempts to lower the flames and perhaps the magnitude of the expected Iranian response), that Haniyeh was eliminated using an explosive device planted in his room a couple months ago.\n\nAnother possibility that is being discussed very seriously among Iranian bloggers dealing in the security field is the firing of a guided missile at Haniyeh's room in the guest house of the Iranian Revolutionary Guards. \"Travelers\" can in fact easily reach the mountain areas surrounding the guest house.\n\nIn any case, the picture is becoming clearer to many that contrary to the announcement of the Iranian media identified with the regime - the assassination was carried out from within Iranian soil.\n\nThis is a major matter with far-reaching implications for the Iranians:\n1. Their sovereignty was apparently not violated.\n2. There is a good chance that someone from the Iranian Revolutionary Guards is involved - after all, this is a sensitive area secured by the Iranian Revolutionary Guards.\n\nThe nature of Haniyeh's assassination is more reminiscent of the way Iranian nuclear scientists were assassinated and less of an incident of an attack from outside.\n\nIt will be interesting to see what the Iranians will present to the world at the end of the investigation of the event. This does not interfere with their revenge response."}, {"id": "2e3ee1f8-0656-4f5f-b49c-9c7ab0b035c5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31612/", "date": "2024-08-01 20:01", "message": "Al Jazeera in an official announcement:\nThe IDF spokesman's claims that the journalist Ismail al-Ghoul is a Hamas Nukhba operative are not true."}, {"id": "4a7a8785-7d6c-4fa0-a246-289d65e58df2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31611/", "date": "2024-08-01 20:00", "message": "A reporter for Hezbollah's Al Manar channel hints that the dozens of rockets launched from Lebanon a short time ago into the north of the country are a response to the IDF attack this evening in which a number of Syrian refugees were killed."}, {"id": "cabe16bc-d655-4ac5-ba35-80375eb88584", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72280/", "date": "2024-08-01 19:06", "message": "Supporters of the Shiite axis on social media curse the Jordanians for deciding to defend their airspace - which is actually a buffer between Iran and Israel - this against the backdrop of Iranian statements of intent to take revenge on Israel.\n\nIt is amusing that they protest Jordanian sovereignty when the argument for the Iranian response is Iranian sovereignty."}, {"id": "27873658-dba1-463d-b348-ef39058f320d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72280/", "date": "2024-08-01 19:04", "message": "This is a particularly interesting message from the IDF spokesperson about Ismail al-Ghoul, an Al Jazeera journalist who was killed yesterday in an attack in the west of Gaza City 👆\n\nJoint IDF and ISA announcement: \n\nThe IDF and ISA eliminated a Nukhba terrorist who participated in the October 7th Massacre and was responsible for the recording and publication of attacks against IDF troops\n\nIn a joint IDF and ISA operation, the IAF struck and eliminated Ismail al-Ghoul, a Hamas Military Wing operative and Nukhba terrorist who participated in the October 7th Massacre.\n\nAs part of his role in the military wing, Al-Ghoul instructed other operatives on how to record operations and was actively involved in recording and publicizing attacks against IDF troops. His activities in the field were a vital part of Hamas' military activity. \n\nThe IDF and ISA are operating in order to eliminate terrorists who participated in the October 7th Massacre and will continue to do so."}, {"id": "84c0f749-6905-430a-b5e6-728ace2a1164", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72280/", "date": "2024-08-01 19:00", "message": "The Palestinians report that Ismail Iman Nufal, the son of Iman Nufal from the Central Gaza Brigade in the military wing of Hamas, was killed a this evening in an attack on the Nufal family's home on al Makhcama Street in East Nuseirat (central Gaza).\n\nHis father Iman Nufal was eliminated in October 2023 at the beginning of the war👆"}, {"id": "4368afb4-741c-4c2f-877f-36ea5f5a8ecb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31607/", "date": "2024-08-01 18:46", "message": "Turkish President Erdogan announces that tomorrow will be a national day of mourning in Turkey, in honor of Ismail Haniyeh and as a sign of solidarity with the Palestinian people."}, {"id": "eb10f98d-1166-47e0-8da8-ed234c49b79c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31606/", "date": "2024-08-01 18:36", "message": "The Jordanian Foreign Minister, on the background of the expected Iranian reaction to the assassination of Haniyeh:\n\nWe will not allow anyone to turn Jordan into a war zone."}, {"id": "e72eb68b-5844-49b2-ac23-3600890df6a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31605/", "date": "2024-08-01 17:35", "message": "The Lebanese dead will be DNA tested to determine if there are 4 or 5 dead in the IDF attack 👆 earlier today in southern Lebanon.\nThere was difficulty in identifying the bodies due to their condition.\nIn addition, five others were injured in this attack."}, {"id": "af8645e6-4388-4375-a147-08246a44990d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31604/", "date": "2024-08-01 17:34", "message": "IDF Spokesperson: Based on IDF and ISA intelligence, the IAF struck terrorists operating inside a compound within the Dalal School in the area of Shejaiya in Gaza City. The compound was used by Hamas as a hideout for commanders and operatives and to plan terror attacks against the State of Israel.\n\nPrior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of precise munitions, surveillance, and additional intelligence. \n\nThe Hamas terrorist organization systematically violates international law by operating inside civilian infrastructure and exploiting the civilian population as human shields for its terrorist activities."}, {"id": "75e0fb6f-5a6e-4339-af82-9eea20b33a30", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31603/", "date": "2024-08-01 17:21", "message": "Lebanese channels report that Hezbollah's air defense was activated against Israeli fighter jets that broke the speed of sound in the skies of southern Lebanon."}, {"id": "b9e49847-db26-4049-9165-5c37a29c430f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31602/", "date": "2024-08-01 16:39", "message": "With cheers and sobs the body of Ismail Haniyeh was received in his luxury home in Doha, the capital of Qatar."}, {"id": "c25d9d03-48f3-4ae2-a5cc-8a4fd4652a59", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31601/", "date": "2024-08-01 16:28", "message": "Civil Defense in Gaza: 15 dead and 29 wounded in an attack on the Dalal School in the Shejaiya neighborhood in eastern Gaza City."}, {"id": "bc09b6a1-5a03-4f68-b03f-4f213eaf3920", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31600/", "date": "2024-08-01 16:28", "message": "The body of Ismail Haniyeh in Doha, Qatar"}, {"id": "133c13f9-3571-4558-86c0-5bc941349290", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31599/", "date": "2024-08-01 16:27", "message": "Two medals are guaranteed for Israel in judo🏅🏅🇮🇱🇮🇱"}, {"id": "9ec3fb98-50ee-4457-addf-406eff387a78", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31598/", "date": "2024-08-01 15:20", "message": "The Palestinians report 12 deaths in the attack on the school named after \"Dalal Maghrabi\" in the neighborhood of Shuhja'ya in the east of Gaza City.\n\nGaza channels are reporting that IDF drones are firing at the wounded who were evacuated from the school and arrived at the nearby al Ahli Hospital."}, {"id": "a1a94668-8ccc-4527-976b-4416289272a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31597/", "date": "2024-08-01 15:15", "message": "Haniyeh's body arrived from Iran to Doha, Qatar, ahead of the burial ceremony tomorrow after the Friday prayer."}, {"id": "93a98d42-0e6c-4120-bb37-b5ce0c37aa70", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31594/", "date": "2024-08-01 15:06", "message": "Lebanese channels report 5 deaths among a group of Syrian refugees as a result of an IDF attack 👆 during Nasrallah's speech.\nA number of Lebanese were injured in the attack."}, {"id": "ac1802b4-c80b-4bb3-9fba-3123766a0490", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31593/", "date": "2024-08-01 15:05", "message": "Additional impressions from Nasrallah's speech:\n\nDuring the speech, Nasrallah accidentally hit his microphone a large number of times, it was not well positioned.\n\nHis speech started about half an hour before the time (uncharacteristic of him, usually he is late rather than early).\nThe speech was shorter than usual - it barely lasted 45 minutes - his speeches are usually twice as long.\n\nAs I mentioned before, he was cold and not as sharp as usual.\n\nIn terms of the content of the speech - there was an expectation of something stronger, so among his supporters - the buildup made for the speech did not match the final product.\n\n###\nThis is not the Nasrallah I know... something happened to him :(\nThe pressure has an effect."}, {"id": "ecda0ab5-a505-4c1d-8d80-410e9c2d7dcc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31591/", "date": "2024-08-01 14:51", "message": "During Nasrallah's speech the IDF attacked in Majdal Zoun in southern Lebanon."}, {"id": "8cdb5823-ae6b-4d90-91dc-244ff391ba58", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31590/", "date": "2024-08-01 14:50", "message": "Nasrallah's speech was less than an hour long.\n\nA weak and disappointing speech.\n\nTo summarize his speech in one sentence:\n\nThere will be a response to the elimination, just wait!"}, {"id": "c5313f84-6c84-486a-9c8d-7edc78f1e48b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31589/", "date": "2024-08-01 14:49", "message": "Nasrallah continued:\n\nIt is the enemy who must now wait for vengeance to come.\n\nAccording to past experience, the assassinations of senior officials do not affect the development of the \"resistance\" - this is the case in Hamas, Islamic Jihad and Hezbollah.\nHajj Mohsen (Fuad Shukr) and I had been in contact daily since the beginning of the war.\n\nHe is the one who raised and educated most of the Hezbollah operatives who were killed in the war.\n\nHe wanted to die as a \"martyr\" and not with a heart attack or in a natural way - because that's how his men were killed.\n\nThe reaction to the elimination of Fuad Shukr is a finished matter.\n\nThe enemy must wait for that.\n\nThe enemy is now on the highest alert. Opened shelters, evacuated bases.\nThey don't know where the response will come from.\nThe decision on the form of the response is now in the hands of the \"field ranks\".\n\nWe are looking for an opportunity for a meaningful response."}, {"id": "d1237fbf-5c82-48cf-8b23-1e2e5baaa0eb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31588/", "date": "2024-08-01 14:46", "message": "Nasrallah (sounding a little cold) substantiates the arguments for Hezbollah's expected response:\n\n1. The enemy chose to attack the capital of Lebanon\n2. Attacked a civilian area\n3. Killed civilians including children\n4. Killed a great commander in the resistance\n\nThe occupation justified the attack in Beirut by what happened in Majdal Shams.\n\nWe denied our responsibility for the incident at Majdal Shams. We are not afraid to accept responsibility if we are wrong.\nAccording to an internal investigation we conducted, what happened in Majdal Shams is not our fault.\n\nThe campaign entered a new phase, after the attack in Hodeidah and after the elimination of Haniyeh."}, {"id": "05eec09a-3d65-4024-8d2e-440e80dde824", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31587/", "date": "2024-08-01 14:42", "message": "Lebanon: Nabih Berri, the speaker of the Lebanese parliament and the chairperson of the Shia Amal movement (which fights alongside Hezbollah) met today with the British foreign and defense ministers who arrived in Beirut. The two discussed fear of escalation with him."}, {"id": "46248296-c4e2-4762-aa20-64d87f852199", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31586/", "date": "2024-08-01 14:39", "message": "Iran: One of the air defense systems that was deployed this morning near the University of Tehran during the funeral ceremony of Ismail Haniya, in the presence of the Supreme Leader of Iran and other senior officials."}, {"id": "84acceef-ca4f-4590-9aaf-f26ba327448c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31585/", "date": "2024-08-01 14:39", "message": "An interesting picture from the last century:\nFuad Shukr, kissing the supreme leader of Iran and behind them a \"common friend\" who looks very excited..."}, {"id": "8172dd3d-7988-41aa-aa20-fdbcc51d7d5e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31584/", "date": "2024-08-01 12:29", "message": "Preparations in Dahieh for the funeral of Fuad Shukr."}, {"id": "a993d7e4-3cf7-4db4-ad66-efb0f6c98525", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31583/", "date": "2024-08-01 12:28", "message": "The northern sector is quiet - Hezbollah has not accepted responsibility for attacks against Israel since the Israeli attack in Dahieh of Beirut two days ago.\n\nEveryone is focused on Nasrallah's speech this evening."}, {"id": "d7b22218-433b-4ecd-9284-511edf59813f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31582/", "date": "2024-08-01 12:28", "message": "The German airline Lufthansa extends the suspension of its flights to and from Beirut until August 12."}, {"id": "5c0bbe42-ab5a-4a76-967b-c38cea1c33f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31581/", "date": "2024-08-01 12:27", "message": "Meanwhile, in Beirut's Dahieh, preparations are being completed for the funeral of senior Hezbollah official Fuad Shukr and Nasrallah's speech at 5:00 p.m. in which he is expected to announce Hezbollah's policy of action regarding the response to the assassination."}, {"id": "7c093173-d863-4d7b-a52d-641105c6266d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31580/", "date": "2024-08-01 12:27", "message": "The Iranian Chief of Staff:\n\nThe reaction to the elimination of Hania is a fait accompli.\n\nThe Zionist entity will regret what it did.\n\nWe are considering our reaction and that of the axis of resistance to the elimination of Haniyeh."}, {"id": "8c0f8758-73a1-4247-870a-6b721469fbe2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31579/", "date": "2024-08-01 10:34", "message": "Lebanon: Against the backdrop of security tensions, the British defense and foreign ministers made a quick visit to Beirut.\nThe two are meeting at this time with the Lebanese Foreign Minister."}, {"id": "6e4add82-8adb-4820-b3f0-01784519bd19", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31578/", "date": "2024-08-01 10:33", "message": "Senior Hamas official Izzat al-Risheq reacts to the IDF spokesman's report on the assassination of Mohammad Deif:\n\nConfirming or denying the death of senior members of the Hamas military wing is a matter for the military wing and the Hamas leadership.\nAs long as none of them announced anything, none of the news that appears in the media can be confirmed.\n\n##\nSenior Hamas leader Mahmoud Mardawi, for his part, states, according to the Al-Arabiya network, that Mohammad Deif is safe and sound and that he is following the Israeli claims about his elimination.\n\nThere is no coordination between senior Hamas officials... the head is gone..."}, {"id": "19331468-6295-4e10-b433-19e33e508289", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31577/", "date": "2024-08-01 10:10", "message": "Tehran: A view from above of the crowds that came to accompany the coffin of Ismail Haniyeh."}, {"id": "ea4ded21-d615-4180-8c18-bcbd74ba10c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31576/", "date": "2024-08-01 10:09", "message": "The latest billboard in Valiasr Square in Tehran - the new President of Iran and Haniyeh."}, {"id": "a4c02b8a-0362-4804-8300-f3ddbd55298f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31575/", "date": "2024-08-01 10:09", "message": "Haniyeh's two surviving sons sobbing on his coffin in Tehran.\nZahar Jabarin, the senior Hamas official in charge of Hamas activities in the West Bank (in place of Saleh al-Arouri who was killed in January) consoles them from behind."}, {"id": "5ae3a152-0b25-49d7-b4b2-7745f602e2c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31574/", "date": "2024-08-01 10:07", "message": "A phenomenal month and a half against the \"axis of resistance\":\n\n1. The head of the political wing of Hamas was killed - Ismail Haniyeh.\n\n2. The head of the military wing of Hamas was eliminated - Mohammed Deif.\n\n3. The Hezbollah Chief of Staff was eliminated (according to the definition of the Minister of Defense) - Fuad Shukr.\n\n4. The commander of the Aziz unit in Hezbollah was killed (equivalent to a member of the General Staff) - Mohammed Nasser, Hajj Abu Neema.\n\n5. The commander of the Nasser unit in Hezbollah (equivalent to a member of the General Staff) Taleb Abdullah was killed.\n\n6. The commander of the Khan Yunis brigade in Hamas (equivalent to a member of the General Staff) and Mohammed Deif's right-hand man - Rafa'a Salameh, was killed."}, {"id": "61db61b1-6ac5-4a2d-92d9-f8fa696907ef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31573/", "date": "2024-08-01 09:10", "message": "The State of Israel settles the score with one of the greatest Palestinian murderers: Mohammed Deif is eliminated!\n\nAfter about 30 years of pursuit and 7 failed assassination attempts, on July 13th in Khan Yunis Israel finally managed to eliminate the commander of the military wing of Hamas, the head of the military pyramid, the symbol, the pulsating spirit of the Izz ad-Din al-Qassam Brigades: Mohammed Deif.\n\nMohammed Deif, Abu Khaled, was born in 1965 in Khan Yunis in the southern Gaza Strip (where he also died) under the name Mohammed Diab Ibrahim al-Masri.\nHe received his nickname الضيف Deif, which means \"the guest\" in Arabic, following his activity as a \"guest\" in the West Bank territories  \"Dafa\" الضفة, where he contributed to the establishment of the Izz ad-Din al-Qassam Brigades, since he is considered a guest in the West Bank (he is originally from the Gaza Strip) who did not settle in one place.\n\nIn 1989, Daf was detained by Israel for 16 months, in administrative detention, due to his membership in the Hamas military apparatus founded by Salah Shehade. Later, this mechanism became the military arm of Hamas Izz ad-Din al-Qassam Brigades.\nIn 1993, after the assassination of the commander of the military wing of Hamas at the time, Imad Akel, Mohammed Deif began to establish his status as a \"super terrorist\". Alongside the engineer Yahya Ayyash, who was in charge of Hamas' terrorist activities in the West Bank, Deif became the head of Hamas's military arm in the Gaza Strip. The two cooperated and were behind prominent terrorist attacks such as the kidnapping of the soldier Nachshon Wachsman. In 1996, Yahya Ayyash was killed, and Mohammad Def made sure to carry out a series of revenge attacks for his killing, including a deadly attack on Route 18 in Jerusalem.\n\nIn 2000 he was arrested by the Palestinian Authority but managed to escape from prison during the second intifada.\n\nAfter the assassination of the terrorist chief Salah Shehade in July 2002, Deif was appointed the supreme commander of the military wing of Hamas, until his assassination on July 13, 2024.\n\nDeif was not revealed to the public and for many years they did not know in Israel what he looked like and in what state of health he was.\nOn rare occasions he used to send audio recordings to raise the morale of his operatives, he did on October 7th when the massacres broke out.\n\nThis is an important achievement of the IDF and Israel - first and foremost at the cognitive level - he has become a symbol, a myth and a legend in the eyes of the Palestinians and their supporters. He has been implicated for decades in the Israeli intelligence mechanisms time and time again. His elimination is an important closing of the circle.\n\nOn the practical level, his military influence at the current stage of the war was little, but Israel can and must leverage the awareness of his death and convince the senior Hamas officials who are still alive, that their time is drawing near... for if Israel succeeded in eliminating the cat with nine lives, then their chances of avoiding a similar fate are not high and it would be wise to surrender.\nLet them ask Haniyeh...\n\n🇮🇱🇮🇱🇮🇱"}, {"id": "c69ba4bf-ef6f-4ae9-91eb-c113b603f751", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31572/", "date": "2024-08-01 08:58", "message": "Words I kept in the drawer for two weeks on Mohammed Deif (except for the last few which I added today): 👇"}, {"id": "c42cdd3d-6bda-4df8-8c28-979386749322", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31571/", "date": "2024-08-01 08:56", "message": "Joint Statement by the IDF and ISA: Muhammad Deif, Hamas Chief of Staff - eliminated!\n\nThe IDF announces that on July 13th, 2024, IDF fighter jets struck in the area of Khan Yunis, and following an intelligence assessment, it can be confirmed that Mohammed Deif was eliminated in the strike."}, {"id": "9455986a-f5d8-4167-816f-ae6c96e4a367", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31570/", "date": "2024-08-01 08:00", "message": "The Palestinians report that at least 22 Gazan prisoners were released today by Israel.\n\nThey arrived at the Shuhada al-Aqsa hospital in Deir al-Balah in the center of the Gaza Strip."}, {"id": "c159aa39-6069-4d30-abe2-b920146f3c7e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31569/", "date": "2024-08-01 07:58", "message": "The head of the political bureau of Hamas was eliminated and the military arm of Hamas was not able to launch a single explosive at southern Israel.\n\nWho would have believed a year ago that such a thing could happen."}, {"id": "b90cb794-b8ca-459d-8ab7-e38efa1c5d30", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31568/", "date": "2024-08-01 07:56", "message": "I wonder if Ismail Haniyeh, the Sunni, who led mass prayers in the Gaza Strip, ever imagined that the day after his death, his body would walk the streets of Iran surrounded by thousands of Shiites waving flags with symbols of the Shiite religion.\n\n#يا_علي\n#يا_حسين"}, {"id": "67e1cbe0-8d97-4797-9458-c00afaccd666", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31567/", "date": "2024-08-01 07:22", "message": "The coffins of Haniyeh and his security guard were carefully wrapped with cling film (like a cut watermelon in the supermarket) for fear of leaking unpleasant odors..."}, {"id": "83f202f5-9f1c-488d-83ac-a135acc5d445", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31566/", "date": "2024-08-01 07:21", "message": "Ismail Haniyeh and the 300th day of the war:\n\nHow it started\nHow it's going"}, {"id": "59888e55-372c-490a-8c85-d817878256d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31565/", "date": "2024-08-01 06:17", "message": "The Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, accuses:\nThe American envoy Amos Hochstein is a full partner in the elimination of Fuad Shukr. He misled Lebanon diplomatically and said there would be no attack in Beirut....\n\n#awkward"}, {"id": "50a1536d-1b02-4097-977b-838ed4b52bc4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31563/", "date": "2024-08-01 06:16", "message": "USA: The case of bias in Google's search results reaches Congress\n\nFollowing allegations of bias in favor of the Democratic Party in Google's search results, American Senator Roger Marshall launches an investigation against the heads of Google to clarify the matter.\n\"Don't hide behind your algorithm anymore\" he says."}, {"id": "aeaa2075-fa5d-4899-9543-62b1c24ea88e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31562/", "date": "2024-08-01 06:13", "message": "Meanwhile, in the Batman district of Turkey: the crowds are venting their anger at one of the branches of the American coffee chain Starbucks - \"due to the chain's support for Israel\"."}, {"id": "e9170233-7de6-481c-a99e-b2bfdc9d808d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31561/", "date": "2024-08-01 06:09", "message": "The US has raised the level of the travel warning to Lebanon for its citizens from level 3 to level 4, the maximum - which says: do not go to Lebanon."}, {"id": "610a0942-8f13-408b-a5d7-d40720795690", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31560/", "date": "2024-08-01 06:08", "message": "Dmitry Medvedev, Deputy Chairman of the Russian Security Council:\nThe only way to achieve peace in the Middle East is through all-out war."}, {"id": "4cddbef9-4500-42c2-92b3-05c096b3538d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31559/", "date": "2024-08-01 06:08", "message": "The Washington Post from a senior Pentagon official: We mobilized 12 warships in the Middle East after the assassination of Ismail Haniyeh and Fuad Shukr."}, {"id": "25640e04-9182-47cd-8ba9-49b080ec83b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31558/", "date": "2024-08-01 06:06", "message": "Meanwhile, supporters of the Iranian opposition say that they will continue to distribute sweets for Haniyeh's death for three days and wish that the supreme leader of Iran will have a fate similar to Haniyeh's...\n\nIt was done quietly and secretly, but it is definitely a nice gesture."}, {"id": "624121b3-72d5-4a6a-a893-51d746069c30", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31557/", "date": "2024-08-01 06:03", "message": "The truck with the bodies of Haniyeh and his bodyguard a tour of the streets of Tehran."}, {"id": "b29d39ab-b248-4d2c-b3b1-830796acfde7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31556/", "date": "2024-08-01 05:46", "message": "University of Tehran: Iran's supreme leader standing over Haniyeh's coffin. Next to him is the president of Iran and behind him a delegation of senior Hamas officials."}, {"id": "09c64509-1204-40ad-b195-8002cb8061ba", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72203/", "date": "2024-08-01 05:45", "message": "Iranian sources report that the Iranian Foreign Minister spoke with his counterparts in Saudi Arabia and Qatar and informed them that Iran intends to launch a military strike on Israel. He warned against using their airspace (against Iran) in case a military conflict develops."}, {"id": "663e0583-2c1d-4ba0-9b81-77565266a838", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31554/", "date": "2024-08-01 05:45", "message": "The website of Iran's supreme leader changed colors from blue to black and red and added a caption: \"Revenge for dear Haniyeh\".\n\n##\nThe supreme leader approved the revenge in Israel."}]