[{"id": "29a7ad33-f9ff-4b33-9afa-5a8e44a7fc1e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28495/", "date": "2024-06-06 08:55", "message": "The evacuation notice was sent to the residents of Wadi Jilo from a number with a Denmark country code."}, {"id": "afdf30dd-ec13-48d4-91bb-a9bd8d87a243", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28494/", "date": "2024-06-06 08:51", "message": "Did the IDF send evacuation notices early in the morning before the attack in Tyre in southern Lebanon?\n\nAccording to reports from Lebanese on social media, before the IDF attack early in the morning in Wadi Jilo - Aaitit in the Tyre governorate, an evacuation notice was received for the building that was attacked.\nAccording to the attached image, a man named \"Ibrahim\" sent a text message at 2:27 a.m. in which he ordered the residents of a two-story building in Wadi Jilo, where there is also a pharmacy, to vacate.\nThe IDF attack came about an hour later."}, {"id": "73b04cc0-6b7a-4fc7-a2f8-05b357ae22af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28493/", "date": "2024-06-06 08:33", "message": "Al Jazeera: Spain joins the lawsuit filed by South Africa against Israel at the International Court of Justice in The Hague."}, {"id": "3fa10f17-a1ff-446c-bfa6-38f07b913cfe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28492/", "date": "2024-06-06 08:32", "message": "Lebanese media: one dead and one injured in the motorcycle attack in Aitaroun in southern Lebanon."}, {"id": "03faac58-6e3b-407c-81a4-7486d89fb3c8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28491/", "date": "2024-06-06 07:55", "message": "The civil war in Sudan: Arab media reports that the Rapid Support Forces in Sudan, fighting against the Sudanese army, carried out a massacre in which 104 residents of the village of Wad a-Nora, south of the capital Khartoum, were killed.\n\n##\nI wonder if President Biden... or the UN... or the EU... or the Hague... will have anything to say about this.\n\nThe Israeli attack in Rafah with 35 dead - an attack on senior terrorists, outside the designated safe zone, who were stashing and hiding weapons among IDP tents - made for an international production on the scale of Eurovision..."}, {"id": "51f79a8e-ac73-4dbb-928e-84edf0beee08", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28490/", "date": "2024-06-06 07:49", "message": "Israeli media reports that Hamas rejected Biden's latest offer.\n\nIt is important to note that these reports originate from the Israeli media.\nHamas has not published an official statement on the matter, and neither have media outlets affiliated with it. The Qatari network Al Jazeera, which is well informed about the details of the negotiations, did not mention anything on the subject."}, {"id": "6ac77ffa-c011-4a22-aa28-b33456632a67", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28489/", "date": "2024-06-06 07:49", "message": "IDF Spokesperson: IDF troops operating in the area of the security fence identified several suspects who approached the border from the Gaza Strip and moved toward Israel in an attempt to cross the security area in the area of Rafah.\n\nThe troops engaged the terrorists who opened fire at them. The troops then returned fire at the terrorists.\n\nAn IAF aircraft that monitored the terrorist cell struck the terrorists and eliminated two of them. Another terrorist was eliminated by means of tank fire shortly afterward.\n\nWe emphasize that the terrorists did not cross the fence built along the Gaza Strip. \nThe incident is under review."}, {"id": "249892fc-9cd8-4417-819e-1d9bdd14eaf0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28488/", "date": "2024-06-06 07:48", "message": "The IDF spokesperson announced the death of a reservist.\n\nHe was killed in a Hezbollah attack yesterday in Hurfeish, northern Israel.\n\nMay his memory be a blessing."}, {"id": "e29d9e27-1e8d-42b0-b586-b32208ec834b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28487/", "date": "2024-06-06 07:46", "message": "A significant attack in Nuseirat in the center of the Gaza Strip\n\nPalestinian channels report about 30 deaths as a result of an IDF attack on UNRWA's al-Sardi Elementary School in Nuseirat in the center of the Gaza Strip.\nIn some reports, the Palestinians connect the incident to an attack in a nearby house and claim that there are a total of 39 dead in the two attacks.\nThe Hamas information office announced 27 deaths officially but noted that the number is expected to rise.\n\nAccording to the reports of the Palestinians, Israel attacked 3 classrooms inside the school on the upper and lower floors.\n\nAccording to the IDF spokesperson and according to the attached diagram, it can indeed be seen that the attacks were aimed at certain classrooms in the school and not at the entire building.\nAccording to the IDF spokesperson, Hamas and Islamic Jihad terrorists who took part in the October 7th massacre lived in these rooms."}, {"id": "1db4437a-a161-41f1-9843-f4ba96aac9a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28486/", "date": "2024-06-06 07:43", "message": "Lebanese media: An Israeli drone attacked a motorcycle in the village of Aitaroun in southern Lebanon a earlier this hour."}, {"id": "c9e49e00-7725-4409-b368-e22024fbe87a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28485/", "date": "2024-06-06 07:29", "message": "The area that the IDF attacked early in the morning in Wadi Jilo - Aaitit in the Tyre governorate in southern Lebanon, as it appears this morning."}, {"id": "03a6da48-5a1a-4eb4-b71a-f58cc1d23a36", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28482/", "date": "2024-06-06 07:28", "message": "Documentation from the area that was attacked in Wadi Jilo - Aaitit in the Tyre governorate, in southern Lebanon."}, {"id": "95a0e7ac-3575-4176-a17d-cf24776134f9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28478/", "date": "2024-06-06 07:27", "message": "The attack in Beit Yahoun - Kounine in South Lebanon: Spectacular secondary explosions were caused - evidence of weapons storage in the place that was attacked.\nResidents of the area were asked to close their windows so as not to inhale \"dangerous substances\"."}, {"id": "aa4f1941-11e5-4bc1-8f9d-fd1f64642c16", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28477/", "date": "2024-06-06 07:25", "message": "A series of attacks by the IDF early in the morning in southern Lebanon\n\nLebanese media reports that IDF warplanes attacked several targets early in the morning in southern Lebanon. Casualties were recorded, but so far no deaths have been reported.\n\nTargets were attacked in the following villages:\n\n1. Beit Yahoun area - Kounine (there were casualties).\n2. Aadchit - Jibchit\n3. Sadiqine\n4. Wadi Jilo - Aaitit in Tyre Governorate\n5. Yarine - Jebbayn\n\nDocumentation from the attacks:"}, {"id": "b89abbd9-371b-42ab-bb1f-4bcc29941aa6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28476/", "date": "2024-06-06 07:18", "message": "Hezbollah published a video early this morning of the damage to the Iron Dome battery in Ramot Naftali, which it claims took place yesterday at 14:00👆.\nThe attack was carried out using the Iranian Almas missile."}]