[{"id": "993da7e9-5121-4ee9-ad52-b8a6f4726e5f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29043/", "date": "2024-06-17 13:42", "message": "The Palestinian Ministry of Health in Gaza:\n\n10 deaths in the last day in the Gaza Strip.\n\n##\nThis is the lowest number of Palestinian deaths per day announced by the Palestinian Ministry of Health in Gaza since the beginning of the war (excluding the hudna days in November)."}, {"id": "40ca7eee-de65-451a-977f-0cce526482e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29043/", "date": "2024-06-17 13:20", "message": "Hamas in an official announcement: the burning of the exit hall at the Rafah crossing by the occupation army is a war crime\n\n##\nIn the pictures: before and after"}, {"id": "a4c59432-eca0-4716-ae03-cf2f541ae164", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68995/", "date": "2024-06-17 13:00", "message": "Hezbollah officially announces the death of:\n\nMuhammad Ayoub - he was killed in the car attack in Selaa in southern Lebanon, earlier today.\n\nNumber 345"}, {"id": "8c72a082-95d7-4ffe-9aff-164eca2a6623", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:21", "message": "Palestinian channels have been reporting on the movement of Israeli tanks and heavy equipment from the Philadelphi axis area towards the center of Rafah city and the area of ​​Al-Awda Square - where, according to these sources, the maneuvering forces are setting residents' houses on fire.\nAlong with the advance of the forces to the north, accompanying artillery fire was reported as well as an attack on a group of people using a UAV in the area of ​​the Khirbat al-Adas neighborhood in the north of Rafah (it also appears on the map)."}, {"id": "509e9551-ff20-4636-b819-8c5452f6cccd", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:10", "message": "Here is a link to the publication of the report itself for those who are interested:\n\nhttps://reliefweb.int/report/occupied-palestinian-territory/famine-review-committee-review-famine-early-warning-systems-network-fews-net-ipc-compatible-analysis-northern-governorates-gaza-strip-conclusions-and-recommendations-may-2024"}, {"id": "a9600c0b-77f6-4e7a-879a-d91d51a58447", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:08", "message": "##\nFor the followers of the channel this is no secret. For months I have been writing here that there is no hunger in Gaza and provided examples of this. There is now an official report.\n\nWhat is even more interesting here is the hypocritical media silence.\n\nThis report is newsworthy.\n\nThanks to follower D who sent me the report."}, {"id": "1674cb84-018d-41c6-bf27-2b7e39d96b09", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:08", "message": "The \"UN Office for the Coordination of Humanitarian Affairs in the Occupied Palestinian Territory\" publishes a report: it cannot be determined that there is a famine in Gaza\n\nThe report published on June 8 on behalf of an official committee appointed to check whether there is hunger in Gaza (following the concern in the international community) stated:\nNo evidence was found that there is a famine in Gaza and therefore it cannot be determined that there is a famine in Gaza.\n\nThe way the conclusions were worded shows that the authors of the report were displeased that these were the conclusions they reached, and they went to the trouble to add that this does not mean that the situation is not difficult in Gaza and even more so. The bottom line is that the authors of the report cannot determine that there is famine.\nAnd this is the official body that is used to determine international standards in the field of hunger."}, {"id": "7b3cce96-940e-4704-b1d7-8f33ec46a390", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:03", "message": "The person killed in the car attack in Selaa in southern Lebanon is Muhammad Ayoub. According to Iranian sources, he was the commander of the artillery division of the Nasser unit in Hezbollah, which is responsible together with the Aziz unit for the entire sector of southern Lebanon.\n\nI will mention that last week Israel killed Taleb Abdullah, the commander of the Nasser unit (\"member of the General Staff\" in Hezbollah)."}, {"id": "621b9678-edd5-44d0-a6a7-ea6e1a8bd820", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:00", "message": "Lebanese sources: the attack on the vehicle in Sela was carried out near the home of one of the occupants of the vehicle."}, {"id": "912538cb-1aa3-4dcd-8936-2777229aa305", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29029/", "date": "2024-06-17 10:59", "message": "Additional photos of the vehicle that was attacked near Sela in southern Lebanon."}, {"id": "c0c88670-9f67-44ef-9614-431f10fe0adf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29026/", "date": "2024-06-17 10:59", "message": "Unofficial Lebanese channels report two deaths in an Israeli drone attack around noon on a vehicle near the village of Sela in southern Lebanon."}, {"id": "b30a8b6d-e637-4580-a851-11a7c291efdf", "channel_id": 1560386984, "url": "", "date": "2024-06-17 10:55", "message": "Lebanese channels report that many residents visit all the villages of southern Lebanon, pray in the local mosques and visit the cemeteries, as is the custom of the holiday (Feast of Sacrifice).\n\n##\nThis is what is behind the relative calm yesterday and today on the part of Hezbollah in the northern sector."}, {"id": "234bf372-113f-49ef-9b88-57e81e1c680b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29020/", "date": "2024-06-17 10:54", "message": "Photos showing the sinking of the Greek ship Tutor that was damaged as a result of a Houthi explosive on June 12.\n\nAlso attached is a video from the moments before the boat was hit, after the threat was identified by the ship's security team, as well as another video after the hit.\n\nAs a result of the impact, a member of the ship's crew went missing. The rest of the crew were rescued that day by US-led coalition forces."}, {"id": "7929e44d-8d1e-44b2-adf8-146313b8b010", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29038/", "date": "2024-06-17 10:52", "message": "The Palestinians report movement of displaced persons from the area of ​​a-Sika and Kashku streets, as well as from the area of ​​Shafut in the neighborhood of Zeytoun (southeast of Gaza City), following the movement of maneuvering forces and tanks (further to the report here👆) since this morning"}, {"id": "4129d040-9fa6-4a50-9f96-a8458f2f4e6a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29017/", "date": "2024-06-17 07:31", "message": "South Lebanon: Also in the villages of Tayrharfa and Ayta ash-Shab, the residents of southern Lebanon (who fled the terror of the war) are taking advantage of the holiday and the relative peace on the border with Israel to reach their homes and assess the damage from the Israeli attacks."}, {"id": "d5ed8008-ed14-49e1-9ed2-18578c134e3a", "channel_id": 1560386984, "url": "", "date": "2024-06-17 07:30", "message": "Lebanese channels report that the IDF is firing machine guns at residents of South Lebanon who came, on the occasion of the holiday, to visit their homes in the village of Chahira, in order to witness the destruction caused by the IDF attacks."}, {"id": "5c2c8424-5383-4d40-848f-29fb44bf80e0", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:31", "message": "Published yesterday on Lebanese channels:\nA \"Lebanese bear\" was observed in the wild in the western part of the Baqaa district."}, {"id": "b78ad2de-14dd-43ed-8f67-f3bd4582a684", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29013/", "date": "2024-06-17 06:30", "message": "Deadly fever on pilgrimage to Mecca\n\nThe Jordanian Ministry of Foreign Affairs: 14 Jordanian pilgrims who came to perform the Hajj, who are not a part of the official Jordanian delegation, died as a result of the intense heat on Mount Arafah.\n17 more Jordanians are identified as missing.\n\nOne of the Jordanian pilgrims who died wished, on his way to the mountain, victory for the Gazans (over Israel in Gaza).\nAttached is the video he shot expressing this wish."}, {"id": "1a987424-d257-4a15-af17-40ed1ffd321e", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:28", "message": "The Palestinians report the movement of maneuvering forces and tanks, accompanied by aircraft, in the area of ​​the Zeytoun neighborhood in the southeast of Gaza City."}, {"id": "5bf94a42-4059-46cf-924e-29d3edcf3265", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:28", "message": "The White House: The American special envoy Amos Hochstein is expected to arrive in Israel today (Monday).\n\n##\nHochstein will try to promote the reduction of tensions between Israel and Hezbollah to further the goal of the Biden administration to reach a diplomatic agreement that will prevent war in the north."}, {"id": "0eb6c18c-3e3c-4032-861c-7ac5327fdfcf", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:25", "message": "Palestinian channels: IDF soldiers set fire to the \"departure hall\" at the Rafah crossing."}, {"id": "134c582d-dcb6-4772-a536-6871ec0dd23f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29008/", "date": "2024-06-17 06:25", "message": "Two events in the last few days in which President Biden froze in place and did not move his gaze for several long seconds, are creating a storm on social networks centered on a discussion about his fitness to run in the presidential elections this coming November.\nThe discussion on the network about the possibility of replacing him with another candidate has become more public in the last day."}, {"id": "7f3dedfb-63ed-49d9-8587-6898108bc902", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:22", "message": "Yesterday, Gaza channels reported the death of Muhammad Abu Kura, known as \"Abu Shahid\", in an attack in Rafah.\nA member of his family claims in a post published on social media that Abu Kura was killed in the explosion of the Israeli APC in Rafah on Saturday.\nAccording to Palestinian sources, he has a long history of military activity in the Gaza Strip and is a well-known figure in Rafah."}]