[{"id": "303aea52-0f91-4edb-a4e8-2f4440853efd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32796/", "date": "2024-08-21 07:27", "message": "The Palestinians report on a flyer that the IDF dropped over Khan Yunis:\nResidents of the Qarara area (block 89) in the north of Khan Yunis (near the Hamad neighborhood) are required to evacuate the area."}, {"id": "d80f459d-281b-4eba-9f77-1b3305a878ad", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 07:10", "message": "Chicago: Clashes between pro-Palestinian protesters and Chicago police officers. Arrests were made."}, {"id": "c6705b48-636e-4985-a96c-5799891e842d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:59", "message": "Chicago, near the Democratic Party convention: an sea of police in front of about 3000-5000 keffiyeh-ed demonstrators."}, {"id": "92710a49-2056-473b-93a4-739dd805fab3", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:56", "message": "Chicago, near the Democratic Party convention: a man tries to prevent the burning of the US flag by demonstrators wrapped in keffiyehs.\n\nHe was pushed back under the cry:\nFuck this country. Burn it down. Burn it down."}, {"id": "3fd11eb4-c176-479e-9061-cbd78f493746", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32791/", "date": "2024-08-21 06:51", "message": "USA: Anti-Israeli protesters set fire to the Israeli flag and the US flag outside the Israeli consulate in Chicago.\nThe Democratic Party convention is being held in Chicago."}, {"id": "6c5ae4e4-4e8d-46e9-934f-b65d8d474946", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32789/", "date": "2024-08-21 06:48", "message": "Chicago: Anti-Israeli protesters near the Democratic Party convention are calling to stop funding to Israel and... to arm Hamas."}, {"id": "09f3fe6b-835a-413f-b69c-2184d5fe51e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73713/", "date": "2024-08-21 06:46", "message": "The Lebanese Ministry of Health reports a death in the Israeli attack this morning on Beit Leif 👆 and also another death, a Syrian citizen, as a result of IDF artillery fire at Sarda in southern Lebanon."}, {"id": "66b82971-ae1d-4e18-9060-a563ae8d8d8d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:45", "message": "Exchange of fire in the north\n\nIDF Spokesperson: Following the sirens that sounded in northern Israel regarding rocket and missile launches in the area of the Golan Heights, approximately 50 projectiles were identified crossing from Lebanon toward Israeli territory. Some were intercepted by the IDF Aerial Defense Array, and a number of fallen projectiles were identified in the area of the town of Katzrin. \n\nIsraeli media reports one lightly wounded by shrapnel in Katzrin.\n\nHezbollah accepts responsibility for firing Katyusha volleys at the Znovar base in the Golan in response to last night's IDF strikes in the Beqaa area."}, {"id": "0c163276-6b30-4926-9fde-dc8006041bee", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:42", "message": "The attack on the \"Nadi al Jazeera\" celebration hall in the west of Gaza City, after an evacuation alert, yesterday."}, {"id": "d396c803-d153-4787-8d97-3f6c61451552", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:40", "message": "While the Ukrainians are expanding their control in the Kursk region in Russian territory, President Putin is touring the new mosque - \"Nabi Allah Issa\", in Grozny, the capital of Chechnya, together with Chechen President Kadyrov."}, {"id": "2d8f0a87-66ce-44f2-b59e-0576f06f8e84", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:39", "message": "The New York Times reveals: In a classified document approved in March, President Biden directed the US military to assess the possibility of a coordinated nuclear conflict with Russia, China and North Korea."}, {"id": "ce0d0877-8110-417e-bfe6-88372a511dfd", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73713/", "date": "2024-08-21 06:38", "message": "South Lebanon: one injured in an attack on a motorcycle by an Israeli drone in Beit Leif in South Lebanon (at 07:20)."}, {"id": "d1f4fbdd-0a8c-4284-99bf-da0929379b44", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:37", "message": "More on the same topic: two days ago an explosive device intended for the IDF exploded in Jenin. It hit a Palestinian taxi."}, {"id": "e4f848ad-323a-45e6-a337-35b5db44c0f6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32780/", "date": "2024-08-21 06:36", "message": "Tammun, east of Nablus: Channels covering the West Bank report seriously injured Palestinians as a result of a bomb explosion - a \"work accident\". According to one of the sources, the lower limbs of one of the terrorists were amputated.\n\nThe terrorists wanted to plant an explosive device to hit IDF soldiers and exploded in the process.\n\nBut their sword will pierce their own hearts..."}, {"id": "ea89ab51-b01b-40ca-bec8-da7185e23fd6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32777/", "date": "2024-08-21 06:33", "message": "Khan Yunis in the southern Gaza Strip: this is not a fire as a result of an Israeli attack\n\nGaza sources report a major clan feud in Khan Yunis between the families of Barabakh (a particularly large clan), al-Katawi and Khindaq. According to these sources, there are three dead and a number of seriously injured as a result of the clan feud that included a lot of shooting and burning of property."}, {"id": "db16c2cf-14af-4bc2-a2d9-bd4ab7a0208b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32773/", "date": "2024-08-21 06:31", "message": "Hezbollah announces four deaths in its ranks:\n\nAli Dakmak\nMuhammad Shahin\nZiyyad Kashmer\nRa'ed Khatteb\n\nThe four were killed together in an IDF attack yesterday👆 in the village of a-Dahyra in southern Lebanon.\n\n421 dead for Hezbollah since the beginning of the war."}, {"id": "6049d07c-4ef3-468e-82d9-f1d3c7053bd2", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:26", "message": "The Shiite militias in Iraq claim: We attacked a target in Eilat last night with a UAV.\n\n##\nThis is their second acceptance in two days after a relatively quiet month."}, {"id": "41b2f4b7-52df-4b30-afa4-0779001f3b35", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73714/", "date": "2024-08-21 06:26", "message": "Al Jazeera from the US Secretary of State Blinken:\n\nI heard directly from Netanyahu that Israel agreed to the (last) mediation proposal and I am hopeful that Hamas will do the same.\nIf Hamas agrees to the mediation proposal, we will need an individual implementation agreement.\n\n##\nThis is an important statement by Blinken from Israel's point of view. It is consistent with his other statements in recent days. The fact that it is quoted in Arabic on the Al Jazeera channel, which is widely distributed among the Palestinians, puts Hamas in a problematic light in the eyes of the Gazan population. It presents Hamas and not Israel as preventing a ceasefire deal."}, {"id": "162b8e87-acdd-4c1f-989d-0fba480c1e80", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73713/", "date": "2024-08-21 06:25", "message": "Hezbollah announced last night:\nOur air defense systems were fired at an Israeli fighter jet in the skies of southern Lebanon and forced it to retreat..."}, {"id": "bcd71fe1-e964-4151-94fc-f5fcd11576f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73713/", "date": "2024-08-21 06:24", "message": "The Lebanese \"civilian\", Ali Almusoui, who was killed in an IDF attack in the Beqqa area."}, {"id": "62b22a3d-bccb-4861-96b6-c38efb7c04c0", "channel_id": 1560386984, "url": "", "date": "2024-08-21 06:23", "message": "Once again the skies of the Beqaa area in Lebanon are illuminated as a result of Israeli attacks\n\nNear midnight, according to Lebanese reports, the Air Force planes carried out 5 attacks on targets in the villages: Nabi Chit, Bodai and Nasrieyh in the Beqaa area, deep in Lebanon.\nThe recordings were impressive, for the second night in a row.\n\nThe tweeters of the Shiite axis move uncomfortably in their seats and fear that Israel is trying to establish a new equation:\nAttacks in the Golan by Hezbollah = Israeli attacks in Beqaa.\nThe commentators of the axis were called to tweet that Hezbollah will not allow this equation.\n\nThey and many others expected a stronger reaction from Hezbollah following the powerful attacks by the IDF on the first night of the attacks in Beqaa.\n\nHezbollah is not providing the goods for the time being as far as they are concerned...\n\nOfficial Lebanese channels reported that a \"civilian\" was killed in the night's attacks in the Beqaa and twenty others were injured."}]