[{"id": "e42e356b-82c4-47d2-9666-624f12598e87", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28087/", "date": "2024-05-29 19:06", "message": "The Syrian Ministry of Defense accuses Israel of carrying out a double air attack tonight at 19:30:\n1. On a post in central Syria\n2. On a residential building in the coastal city of Baniyas.\n\nAccording to the Syrian ministry, a girl was killed in the attack in Baniyas.\n\n##\nDo not rule out the possibility that a missile from the Syrian air defense systems is the one that hit the residential building in Baniyas."}, {"id": "94f0ef33-7dbd-4e16-b9c2-26fc14a8f25b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28086/", "date": "2024-05-29 19:05", "message": "A video published this evening by the IDF spokesperson about the \"surprises\" on the border between Gaza and Egypt.\n\nAnd then the Egyptians will claim that they saw nothing..."}, {"id": "b91de1e6-8065-42c3-9fc3-a8308fc4a011", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28085/", "date": "2024-05-29 19:05", "message": "Two seriously injured in a ramming attack near Nablus."}, {"id": "e0a2b6b1-be6b-4386-b346-e933a380de51", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28084/", "date": "2024-05-29 19:00", "message": "Ben Shapiro, the Jewish-American media personality with one of the ten most listened-to podcasts in the USA, points out in his broadcast yesterday the hypocrisy of the Western media in regards to the Israeli attack in Rafah.\nAlong the way, he also recommends the \"Abu Ali Express\" channel to his followers.\nHere at 01:53 👈\n\nThanks Ben. \n\nHere is a link to the full episode on Spotify: 👇\nhttps://open.spotify.com/episode/4j4IDttzRpkE614UHOp9Vn?si=_yDbYxPxRDOZQ41d4Ru9-g"}, {"id": "678f6ca7-b1cf-40cd-a703-da242b6c3006", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28083/", "date": "2024-05-29 17:56", "message": "Sources associated with the Syrian opposition: Israel attacked a number of trucks parked by the Iranian and Hezbollah militias at the Al Furqlus checkpoint in eastern Homs."}, {"id": "328a365e-5f15-429e-936a-4cdf209af0f6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28082/", "date": "2024-05-29 17:55", "message": "From the channel's archives - the person who re-uploaded this video yesterday is Noor Swerky, known to some of you as \"Oum a-Luz\" who admitted, by mistake, live on Gaza television that she received all the answers to the matriculation exam through the window of the class in which she was tested (June 2022).\n\nA geography graduate, she explained to the camera: \"It was a very easy test. Just like in the books. We studied and submitted properly... not like those in the math exam.\"\nPleasant and nice, but then she felt the need to share with the interviewer that someone came and handed the students answers worth 40 points through the window...\"may God make him happy...\"\n\nThe Hamas police were responsible for the fairness of the exams..."}, {"id": "b608c0e2-539f-4ef4-80b2-2652cb48dc1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28081/", "date": "2024-05-29 17:48", "message": "Unofficial sources identified with the Shia axis: Israel attacked a row of parked cars in the Al Furqlus area in eastern Homs."}, {"id": "38de3cf5-7b8f-4ed7-b42e-826d392efe29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28080/", "date": "2024-05-29 17:47", "message": "An interception with a Yemeni flavor:\nThe Houthis are publishing what they claim is the downing of the American MQ9 today.\nAccording to the relatively complete state the UAV was in when located, I'm not completely convinced that this is the right video, but... the soundtrack of the video is worth it..."}, {"id": "b96910e6-7051-4a25-9278-9612001c785d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb67748/", "date": "2024-05-29 17:42", "message": "Syrian opposition sources report an Israeli attack in Homs."}, {"id": "74d7a992-2315-4856-a661-162289a1cfda", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb67748/", "date": "2024-05-29 17:41", "message": "Reminder: rockets between the tents in Rafah\n\nThis is a video of an Israeli attack between the tents of the displaced people in Rafah that I uploaded here on May 3rd 👆 and is gaining importance in light of the criticism of Israel for the recent attack in Rafah in which dozens of Palestinians were killed.\n\nFollowing this attack, which was carried out with an evacuation warning, a rocket can be seen flying out from among the tents, which proves that Israel attacked a \"hot launcher\" and that Hamas planted it among the tents of the displaced.\n\nIt's not a one-off, it's a method!"}, {"id": "3a660748-7f41-468d-b18c-3739f2308118", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28074/", "date": "2024-05-29 17:32", "message": "Lebanese media: a missile was intercepted in the skies of Baalbek.\n\nReports on the activation of the Syrian air defense systems.\n\nThe official Syrian News Agency: Syrian air defense systems were activated against hostile targets in the skies of Homs."}, {"id": "248c495a-b618-44a5-a463-25f68d2353de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28073/", "date": "2024-05-29 17:30", "message": "The Houthis accept official responsibility for the downing of the American MQ9 today👆."}, {"id": "b3e89d91-a719-47e7-96a8-f70f93792a77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28072/", "date": "2024-05-29 17:30", "message": "Agence France-Presse: President Macron calls on Abu Mazen to carry out reforms in the Palestinian Authority towards the recognition of a Palestinian state (by France -AA)."}, {"id": "38acd34b-4453-45c9-8e9a-cbf2c13df9bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28071/", "date": "2024-05-29 17:29", "message": "Lebanese media: The IDF attacked the eastern neighborhood in the village of Khiam in southern Lebanon.\n\nAn impressive column of smoke!"}, {"id": "e1c8fec0-c698-4b6d-8e5f-0bdfc7638ceb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28070/", "date": "2024-05-29 17:25", "message": "IDF spokesperson in a telephone briefing for military reporters:\n\nThe IDF gained full control of the Philadelphia axis\n\nSo far, 20 tunnels and 82 shafts have been located in Rafah. Some of the tunnels are smuggling tunnels to Egypt - the Egyptians have been updated.\n\nSome of the tunnels were destroyed and some are under investigation.\n\nDozens of rockets ready for launch were located near the border fence with Egypt.\n\n##\nThere are enough legal reasons here that Israel can present to the International Court of Justice in The Hague, to the Americans and to the whole world, reasons that beyond any doubt justify a ground military operation in Rafah.\n\nAbove all - Israel closed the Hamas tap, above ground (Rafah crossing) and below ground - the tunnels.\n\nThis is one of the most important achievements of the Iron Swords War and the highlight of the operation in Rafah."}, {"id": "87457384-0e51-4eba-98a7-4b153d46b8d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28069/", "date": "2024-05-29 16:02", "message": "Palestinian channels: Israeli tanks are on Al-Quds Street in the Tal al-Sultan neighborhood in West Rafah.\n\nAl-Quds Street in Tal al-Sultan (marked in blue) is less than three kilometers from the water line on the beach of Rafah."}, {"id": "c244f58b-7021-4444-907d-28a726ac17a4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28068/", "date": "2024-05-29 15:28", "message": "The investigative committee appointed by the Iranian Chief of Staff to investigate the crash of the helicopter of the Iranian President:\nWe rule out the possibility that an explosion occurred as a result of sabotage of the president's helicopter, before it crashed into the mountainside."}, {"id": "7f9f7064-5bbc-4cab-8f52-15f236a0db29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28067/", "date": "2024-05-29 15:28", "message": "Al Jazeera from a senior Hamas source regarding the American floating dock:\n\nThe American dock in Gaza is to deceive the world public opinion regarding the humanitarian aid to Gaza.\n\nIts purpose is to cover the transfer of American weapons to Israel.\n\nIn practice, the dock does not help alleviate the humanitarian crisis."}, {"id": "b2987544-f11a-46d5-b5f1-523d33bd2ddf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28066/", "date": "2024-05-29 15:06", "message": "Deir al-Balah, central Gaza: An officer in the Hamas national security apparatus was killed during a \"clan fight\" in Deir al-Balah.\nThe officer, who walked around during the war in civilian clothes, was engaged in the task of distributing humanitarian aid - apparently the \"distribution method\" did not suit everyone. He was shot with a firearm.\nThe density of the population in Deir al-Balah, following the movement of displaced persons from Rafah, increases the friction between the citizens and Hamas."}, {"id": "7e47e01a-121e-4d35-8874-a142a0c37939", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28065/", "date": "2024-05-29 14:40", "message": "Mexico: Additional documentation from the Israel Embassy area in Mexico City. The protesters against Israel threw Molotov cocktails."}, {"id": "95d14647-8270-4a3f-988b-c44924d5fa58", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28064/", "date": "2024-05-29 14:15", "message": "Gaza channels: In the last day, for the first time since the beginning of the war, the muezzin was not heard in the city of Rafah."}, {"id": "d98e0e7a-2490-460e-956d-a3c669ea9e9f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28060/", "date": "2024-05-29 13:23", "message": "More photos from the parliament in Brazil.\nThey are also from the account of the deputy ambassador of Israel in Brazil."}, {"id": "d37a8741-5623-4635-81a6-12081571e2ca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28059/", "date": "2024-05-29 13:21", "message": "The move against Israel is led by the Brazilian president, Lula da Silva, known to be pro-Palestinian.\n\nAt the same time, an act of protest by members of the Brazilian parliament who sympathize with Israel and oppose the move by President da Silva.\n\nSource: the Twitter account of the deputy ambassador of Israel in Brazil\n\nhttps://x.com/GonenYonatan/status/1795235595347697836?t=TyvLY66wBMpUiuYulGfnWQ&s=19"}, {"id": "fcf844b7-ff43-4a4a-85f3-565fc6d57a5d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28058/", "date": "2024-05-29 13:09", "message": "Foreign media: Brazil is calling back its ambassador from Israel."}, {"id": "f1cac6a2-daab-4487-bf17-6d065a9897da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28055/", "date": "2024-05-29 13:08", "message": "North Korea's \"explosive balloons\"\n\nAfter we learned in recent years about the explosive balloons of the Gazans on the border fence, who learned how to make good use of the wind blowing from the direction of the sea towards the enclave, media in South Korea are reporting that the citizens of South Korea were \"victorious\" of an attack of excrement and garbage balloons sent to them from North Korea and exploded on the country's territory.\n\nThe North Koreans are \"taking revenge\" on leaflets that were dropped from the air on their territory by South Korea, with messages undermining the North Korean government.\n\n##\nIntelligence sources know how to report information exchanges between North Korea and Hamas in Gaza 😂"}, {"id": "baa6f441-d820-43a1-a843-ef76389e5b42", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28054/", "date": "2024-05-29 13:06", "message": "The new Iranian Foreign Minister, Ali Bagheri Kani (acting in place of the minister who was killed in the helicopter crash) clarifies that the functional sequence in the Foreign Ministry continues despite the minister's death:\n\nThe exchange of messages between the US and Iran continues continuously as before."}, {"id": "77ed4612-6dfa-4d3e-80b4-ee38cab2a0dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28053/", "date": "2024-05-29 13:05", "message": "A video produced by Hamas in Gaza, for comparison."}, {"id": "586b6cb3-00cd-48b5-9a68-4319436b17ab", "channel_id": 1560386984, "url": "", "date": "2024-05-29 13:04", "message": "This is a video that was released this morning by an organization affiliated with Hamas in Tulkarm. It shows shooting at the settlement of Bat Hefer.\n\nThe main and official channel of the military arm of Hamas did not publish the video and the attempt to imitate the Gaza Hamas videos seems relatively amateur (I will share an official Hamas video for comparison).\n\nThis indicates, at the very least, that the relationship between Hamas in Gaza, which produces professional videos, and the same organization in Tulkarm is not strong at this time (it can be estimated that elimination of Hamas officials of the West Bank HQ in Gaza is doing its part). The organization in Tulkarm could have used professionals to get a better product but chose to continue independently...\nThe main shortcomings in the Tulkarm video that I noticed:\n1. General quality - shooting and editing at a low level\n2. Black border too wide\n3. The red triangle is not the same one of the Hamas videos\n4. The date is displayed different by Hamas in Gaza"}, {"id": "116e8805-01c3-48f9-8c9b-07f13d0966e4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28049/", "date": "2024-05-29 11:44", "message": "Sources associated with the Shiite axis claim that the Houthis in Yemen managed to shoot down an advanced American MQ9 UAV in the Marib area.\n\nAccording to its body, which is relatively complete, it can be estimated that it made an emergency landing.\nThe Houthis will soon provide an \"official announcement\".\n\nThis is the third MQ9 type UAV that the US has been lost in recent weeks in Yemen.\nThe cost of each unit is about 30 million dollars."}, {"id": "d9b231b7-2e12-4339-b940-530880157580", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28048/", "date": "2024-05-29 11:37", "message": "The Spanish Foreign Minister: What the Palestinian prisoners are going through in Israeli prisons is unacceptable!\n\n##\nAnd what do you say about what the abductees are going through in Gaza, Mr. Minister? And they were not convicted of terrorism."}, {"id": "ff70fdbc-b868-48af-9f17-79a4a443386e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28047/", "date": "2024-05-29 11:36", "message": "Gazan journalists:\nCommunication services (internet and phone) are not active all over Rafah."}, {"id": "e6aa459b-d8e7-48df-8dd7-0cde1b9cc0c8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28046/", "date": "2024-05-29 11:36", "message": "Reuters from the head of the National Assembly, Tzachi Hanegbi:\nIsrael controls 75% of the Philadelphia axis."}, {"id": "9dce232f-9d28-41f6-8a3c-49fa07f0e040", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28045/", "date": "2024-05-29 11:34", "message": "Anti-Israel demonstration at the University of Manchester in England.\nThe signs read: Palestine will be free from the river to the sea."}, {"id": "896c7704-fdb0-442c-a51a-f5337f93cef1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28044/", "date": "2024-05-29 11:33", "message": "Follower D. photographed and shared the new status of the floating American pier: in Ashdod, on wheels."}, {"id": "1feb62b4-8006-4ee9-8ade-e6b9222e2ef0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28043/", "date": "2024-05-29 09:46", "message": "The nature of IDF activity in Rafah - according to Palestinian reports\n\nGazan sources report that IDF tanks are seen regularly in the neighborhoods of A-Salam, Barazil and Yabneh (these are the southern neighborhoods of Rafah that are adjacent to the blue line below parallel to the border with Egypt - the Philadelphia axis).\n\nFrom the staging points of the tanks in these neighborhoods, the tanks go on raids to the north, as indicated by the arrows, along the entire length of the line from the Salah al-Din crossing area (the former goods crossing), in the east, to the Tal al-Sultan neighborhood, in the west - (which is the main neighborhood where Hamas is located in west Rafah) ."}, {"id": "48615aff-b7ca-47fc-a056-c0e41e2bbcc2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28042/", "date": "2024-05-29 09:41", "message": "The IDF spokesperson announced the death of three soldiers of the 50th Battalion of the Nahal Brigade in a battle in the southern Gaza Strip.\n\nMay their memories be a blessing."}, {"id": "1e9a0e90-244e-4a8f-9d4b-6de225fb4262", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28040/", "date": "2024-05-29 07:35", "message": "You can do an interesting anthropological study on the population in Britain using the attached video.\nPolite British police officers are trying to deal with an anti-Israel demonstration in London, and in the background, alongside the Arabs participating in the demonstration, there are also British citizens who convince themselves using mantras:\nI believe that we will win."}, {"id": "fe0ac9ec-7bb0-4f46-a2ff-2bcb9f281a24", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28037/", "date": "2024-05-29 07:09", "message": "Rafah: The movement of Gazans, yesterday and today from the west of Rafah (Tal a-Sultan area), north towards Khan Yunis, following the expansion of the IDF's operation to the west of Rafah."}, {"id": "aea9fa3e-363c-4825-b6d3-b5c29b7fa0d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28036/", "date": "2024-05-29 07:09", "message": "The Palestinians report that Israel killed amid (brigadier general) Salameh Barakeh, who was in charge of supplies and training in the Hamas police.\nHe was killed in an attack on the house of the Abu Jazer family in the Ma'an area in eastern Khan Yunis in the southern Gaza Strip."}, {"id": "52eee40d-20c1-4205-9822-a26730465e1c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28035/", "date": "2024-05-29 06:34", "message": "A popular video on Palestinian channels - documentation of the extensive destruction left in the Faluja area in the Jabaliya refugee camp in the north of the Gaza Strip, after the IDF's operation there."}, {"id": "da5444cf-a172-412f-bf51-9820b401c946", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28034/", "date": "2024-05-29 06:33", "message": "Sources affiliated with Fatah: Hamas is eliminating anyone who dares to go against it in the Gaza Strip and publicly claims that it eliminated those people on the charge of \"theft\".\n\nAttacking thieves is met with tolerance (and even encouragement) by large sections of the Gazan public. This is also the case with the videos that are distributed from time to time in which alleged thieves are seen after being shot by Hamas masked men and left to wallow in their blood."}, {"id": "42f1696d-fdb0-4b0e-8825-dbb6964ff3ee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28033/", "date": "2024-05-29 06:30", "message": "The US Central Command announced that the Houthis, loyal to Iran in Yemen, launched 5 missiles at a Greek-owned merchant ship yesterday.\nAccording to the report, 3 of the 5 missiles hit the ship, but it continued on its way.\nThere were no casualties in this attack."}, {"id": "577d93d8-a138-4c10-820f-56b942c3093b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28032/", "date": "2024-05-29 06:27", "message": "More on the same issue: Algeria will today submit an outline for a proposed resolution in the UN Security Council that will call for the cessation of Israeli military action in Rafah.\n\n##\nThe ball regarding the UN Security Council is now in the Americans' hands.\n\nThe absurdity of the Israeli operation in Rafah is that it is the ground operation with the lowest number of casualties so far in the war."}, {"id": "d1f2f72a-8db4-4bd0-a39d-8e45aface460", "channel_id": 1560386984, "url": "", "date": "2024-05-29 06:25", "message": "\"Rafah effect\" - anti-Israeli protests in Europe and Mexico\n\nPerhaps following the (late) official Israeli response and perhaps following Israel's initial admission that this was a \"tragic mistake\" (a statement attributed to Prime Minister Netanyahu in Haaretz) and certainly because of the well-oiled propaganda and lying machine of Hamas - crowds took to the streets in several European countries to demonstrate against Israel.\n\nAttached:\n1. Republic Square in Paris (France)\n2. Attempt to reach the Israeli Embassy in Paris\n3 London\n4. Bologna, Italy\n5. Attempt to break into the Israeli embassy in Mexico City\n\nThere were more.\n\nThis is an excellent example of how Israel has not yet learned to find the right way to deal with the Palestinian lies about \"massacre events\" on a large scale.\nTime after time the Palestinians immediately accuse Israel of terrible acts. Israel quickly apologizes, wasting valuable time until it issues an official response - and is forced to absorb the fire.\n\n\"Muhammed al-Durrah\" effect."}]