[{"id": "4a4e0098-8552-45b8-84c9-f3de93224a4a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27505/", "date": "2024-05-19 20:36", "message": "The search in the forest continues.\nThe afikoman has not yet been found.\nIranian sources indicate that due to the drop in temperatures, the rain is slowly turning into snow.\n\nWhere is the Iranian president?"}, {"id": "a76f6af2-c0d1-4678-8295-95b3c9269b56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27504/", "date": "2024-05-19 20:23", "message": "Iran: The storm has reached the area where the search for the helicopter of the Iranian president is currently underway."}, {"id": "91a18e7f-6924-423e-b88c-f062d1e2a312", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27503/", "date": "2024-05-19 20:17", "message": "The Saudi royal family: (88-year-old - AA) King Salman has pneumonia."}, {"id": "53e51659-2b08-4eac-adb3-e8a1d582b7ae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27502/", "date": "2024-05-19 19:29", "message": "The Commander of the Iranian Revolutionary Guards in East Azerbaijan Province:\n\nWe received a signal from the president's helicopter and the mobile phone of one of the helicopter crew members, we are sending forces to the location."}, {"id": "c2fb73f7-ca49-4aac-afaa-b7eb73bada2b", "channel_id": 1560386984, "url": "", "date": "2024-05-19 19:22", "message": "IDF spokesperson: Israeli soldiers operating in Gaza recovered footage that was taken by Hamas terrorists of Israeli children it had taken hostage\n\nThe attached video was presented today to the family of 8-year-old Ela Elyakim and 15-year-old Dafna Elyakim, who were taken hostage by Hamas terrorists to the Gaza Strip on October 7, and were since released as part of the ceasefire deal of November 2023. \n\nThe video, published today for the first time, was originally prepared by Hamas to be used as part of their psychological warfare campaign. Despite this, Ela's family asked us to share the video with the world, to expose the terror, cruelty and barbarism of Hamas terrorists.\n\n8-year-old Ela Elyakim said that Hamas terrorists changed her clothes and forced her to read the script repeatedly.\n\nOur hearts go out to Ela, her family and all the families of the abductees. Help us honor Ela's family's request by sharing this video.\n\nWe will continue to do everything in our power to bring all the hostages home."}, {"id": "fbbc736e-a2e1-45b3-984e-35d38e5fd11b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27498/", "date": "2024-05-19 19:13", "message": "An American military vehicle was spotted today on the floating pier in the Gaza Strip.\n\nGazan on social media were immediately alarmed by the sight. One person wrote: \n\n\"We told you that it would eventually be an American military base despite the promises that there would be no American soldiers on Gazan soil.\""}, {"id": "4c7af95e-0a6d-4257-9ee7-c23e5cf8a487", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27494/", "date": "2024-05-19 19:11", "message": "Syrian rebels from the town of Marea in northern Syria celebrate the news of the disappearance of the Iranian president's helicopter."}, {"id": "39ad589d-ddb4-4d34-8051-c17cff455a2f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27493/", "date": "2024-05-19 18:47", "message": "The Iranian Red Crescent: The reports of finding the fragments of the Iranian president's helicopter are not true. Nothing was found."}, {"id": "aa517e72-2a3c-4a60-9e61-f234053415f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27492/", "date": "2024-05-19 17:58", "message": "The Iranian news agency \"Tasnim\" claims a short time ago:\n\nContact was made with two of the president's companions.\n\nIt does not appear to be a serious accident."}, {"id": "59dbdb26-aa53-4415-83ff-29f7987b5c68", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27491/", "date": "2024-05-19 17:40", "message": "Hezbollah announces another death in its ranks: \n\nAli Salameh\n\nHe too was likely killed in today's attack in Maroun A-Ras.\n\nNumber 305."}, {"id": "e9ff665b-78f7-4e23-bf76-7aee34a519af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27490/", "date": "2024-05-19 17:25", "message": "Fireworks and celebrations in Iran following the news of the disappearance of the Iranian president's helicopter."}, {"id": "9cfdafcf-1500-40b7-a273-a389177ed79b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27489/", "date": "2024-05-19 17:24", "message": "Article 131 of the Iranian Constitution states that in the event of the death of a sitting president, or resignation, or absence due to illness for a period exceeding two months, the vice president, after approval by the supreme leader, will assume the role of president.\n\nA special council that will include the first deputy, the Speaker of the Parliament and the Speaker of the Judiciary will work to hold elections for the President within a period not exceeding 50 days.\n\nAccording to Article 132 of the Iranian Constitution, during this 50-day period, the government cannot be overthrown, ministers can't be fired, and laws can't be changed."}, {"id": "c5109893-c6c1-4294-beec-09bc70000ea6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27487/", "date": "2024-05-19 17:10", "message": "Iranians opposing the Ayatollahs' regime noticed that the helicopter's crash site is near the town of Gurdalar (literally: \"village of wolves\") and are wondering - \n\nWho's going to reach the Iranian president first? Search and rescue or the wolves?"}, {"id": "1b4d7b88-8605-4c11-8f0b-52d61994daad", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27486/", "date": "2024-05-19 16:45", "message": "The President of Azerbaijan Ilham Aliyev who met the Iranian President this morning:\n\nWe are very concerned about the reports and are ready to help.\n\n##\nMy God, that smile..."}, {"id": "76ddd612-170a-43df-83e0-f16884fc5f19", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27485/", "date": "2024-05-19 16:06", "message": "Very low temperatures are expected throughout the night in the area where Iranian search and rescue teams are looking for the Iranian president's helicopter.\n\nHeavy storm clouds (on the left) are forecasted to reach the search area (the smaller circle to the right) in the coming hours."}, {"id": "6ea3296b-0457-42c3-bdcc-814fdaf2853f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27484/", "date": "2024-05-19 15:50", "message": "US President Biden cut his vacation short and returned to the White House for updates following the incident with the Iranian president's helicopter."}, {"id": "bc87c0b7-59fb-4a12-aab2-74c30c025521", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27483/", "date": "2024-05-19 15:42", "message": "The IDF announces the death of major Gal Shabbat from Katzir, who succumbed today to wounds sustained on the 15th in a battle against terrorists in the northern Gaza Strip.\n\nMay his memory be a blessing."}, {"id": "8c33a54f-7c64-4628-842d-bac67ef7b7ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27482/", "date": "2024-05-19 15:18", "message": "More memes from social media..."}, {"id": "edb793b6-3a73-4ccb-85bc-b6c699252db6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27481/", "date": "2024-05-19 15:14", "message": "Reuters, citing a senior Iranian source:\n\nWe are still hopeful, but the news coming from the crash site is extremely worrying."}, {"id": "673d364f-96f4-44cf-a122-c8fefc88fba6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27480/", "date": "2024-05-19 15:14", "message": "Meanwhile... to pass the time, Hezbollah announces a death in its ranks:\n\n33-year-old Hassan Na'ameh\n\nApparently killed in the Israeli attack today in Maroun A-Ras in southern Lebanon.\n\nNumber 304."}, {"id": "989447b4-c6f5-460e-8a83-261bf0431580", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27479/", "date": "2024-05-19 15:12", "message": "The Iran correspondent for the pro-Iranian Lebanese news channel \"Al-Mayadeen\":\n\nVery alarming reports regarding the fate of the passengers on the President's flight, due to the fact that the search teams have not yet reached the aircraft."}, {"id": "7e356bbd-76c0-4f77-ab96-4b21af81a01a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27478/", "date": "2024-05-19 15:04", "message": "Meanwhile, Iranian opposition channels are celebrating (sound on)."}, {"id": "aa7a662e-5040-4b60-8ab8-3c579395c70c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27477/", "date": "2024-05-19 14:58", "message": "Iranian channels: Weather conditions in the area of the assumed crash/landing site are only getting worse by the hour..."}, {"id": "49bd6dff-303a-4a27-a759-b3ab07ae91bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27476/", "date": "2024-05-19 14:56", "message": "The helicopter of the Iranian President taking off (for the last time?), near the Azerbaijani-Iranian border, earlier today."}, {"id": "aa8ed814-9ca5-4db4-908d-dd7f61701f74", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27475/", "date": "2024-05-19 14:53", "message": "On board the helicopter were:\n\n1. The President of Iran, Raisi\n2. The Iranian Minister of Foreign Affairs, Amir-Abdollahian\n3. The Supreme Leader's representative in the province of East Azerbaijan\n4. The Governor of East Azerbaijan"}, {"id": "c0981abe-1dd3-4de6-bc1b-fbec2b9357c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27474/", "date": "2024-05-19 14:51", "message": "Iranian sources: The geographic location of the site where the helicopter of the Iranian president crashed was determined, based on the last GPS signals transmitted by the helicopter - between the villages of Uzi, Kalibar and Vanestan.\n\nDue to difficult topography (as can be seen on the attached map) and weather conditions, aerial search and rescue is not possible.\n\n40 rescue teams were sent to the area."}, {"id": "9e080d3d-0190-4c9b-8c5b-bb7f923eb3ac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27473/", "date": "2024-05-19 14:13", "message": "It is now 5:40 PM in Iran. The sun sets there at 7:30 PM. \n\nSearch and rescue teams are worried that if the helicopter is not found in the next couple of hours, conditions will become even more difficult."}, {"id": "ea658b53-f3d9-495e-8a15-3f63e0fe7b30", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27472/", "date": "2024-05-19 14:09", "message": "The Iranian Mehr news agency posted that the Iranian president is alive and well... and then deleted the post."}, {"id": "261d39df-d906-406c-b88e-635dd851d098", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27471/", "date": "2024-05-19 14:06", "message": "The Israeli \"Zaka\" voluntary community emergency response organization, following the news regarding the Iranian president's helicopter:\n\n\"Don't worry, we're on our way\""}, {"id": "00f7f40f-7a9a-41ee-b404-aa9fc73d2036", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27470/", "date": "2024-05-19 14:03", "message": "And this is how it looks like today..."}, {"id": "3c10e0a5-d2c3-453b-9e6f-46f1a04f2110", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27469/", "date": "2024-05-19 14:03", "message": "This is how the forested and mountainous area where the Iranian search and rescue teams are looking for the Iranian president's helicopter looks like on a good day..."}, {"id": "ffa626c8-f9d3-4151-b713-0fed18eddc48", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27468/", "date": "2024-05-19 13:55", "message": "The Iranian rescue teams are using dogs and drones, but the forested area and the heavy fog are making search efforts difficult.\n\nAccording to Iranian media, due to the heavy fog, search crew members can only see five meters in front of them."}, {"id": "2a684593-7f8a-4259-adc6-b7c858778569", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27467/", "date": "2024-05-19 13:46", "message": "Iranian sources estimate that the president's helicopter crashed/landed in the Dismar forest near the Iranian-Azerbaijani border.\n\n16 search and rescue teams have been dispatched to the area, so far without finding the landing site.\n\nIranian channels are calling on the public to pray for the president's well-being."}, {"id": "3aa6d875-fd1d-4c04-bebe-1460011bccd6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27466/", "date": "2024-05-19 13:31", "message": "Iranian channels have been posting this photo in light of the news of the emergency landing that the helicopter carrying Iranian president Raisi had to make. \n\nDon't be fooled - it's an old photo of the Iranian president from several years ago."}, {"id": "e4e884a3-586d-4a6f-ab6b-012bff957f84", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27465/", "date": "2024-05-19 13:27", "message": "Iranian media outlets: Weather conditions are making search and rescue efforts difficult. The site of the emergency landing has yet to be found."}, {"id": "fc27eb45-3c0f-4483-b8da-b08513390de3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27464/", "date": "2024-05-19 13:24", "message": "Iranian sources: The helicopter carrying Iranian President Raisi made an emergency landing in the Iranian province of Azerbaijan. A search is underway for the helicopter.\n\nThe helicopter was supposed to bring Raisi back from his meeting with the president of Azerbaijan at the border between the countries. The Iranian foreign minister was also on board the aircraft.\n\nIranian rescue forces continue to search for the Iranian president's helicopter. According to Iranian sources, the emergency landing was due to severe weather conditions in the Iranian province of Azerbaijan.\n\nAccording to several Iranian sources, contact was established with one of the helicopter's passengers, which was later cut off, with the phone now being unavailable.\n\nThese are all initial reports, details are still unclear about the incident."}, {"id": "d4eda3f6-c3bf-4bc9-98aa-fac319e5dced", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27463/", "date": "2024-05-19 13:20", "message": "Lebanese channels report casualties in the IDF attack on Maroun A-Ras in southern Lebanon about an hour ago."}, {"id": "25048d21-3e70-48c0-89e6-c5eff3a4f629", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27463/", "date": "2024-05-19 13:20", "message": "Aid that entered through the American floating pier near Gaza City, which was then loaded onto trucks, was looted before reaching its destination."}, {"id": "3f6caca9-fdf1-4a54-9bbd-62be446e2207", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27461/", "date": "2024-05-19 13:18", "message": "Following the report here👆 yesterday\n\nIDF spokesperson:\n\nIsraeli aircraft, with the guidance of the IDF's Intelligence Wing and the Southern Command, attacked and killed yesterday (Saturday) the terrorist Azami Abu-Daqa, a militant in the terrorist organization Hamas who served as a leading figure in the supply department of the terrorist organization, and was responsible for transferring weapons and funds intended for terrorism in the Gaza Strip.\n\nDuring the last day, the Israeli Air Force attacked dozens of terrorist targets, in one of the attacks an Air Force aircraft, directed by the 215th Fire Brigade, eliminated two Hamas military commanders who were preparing to attack our forces in the Rafah area."}, {"id": "de9e619c-2423-4f3d-9ce2-46d4784581f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27460/", "date": "2024-05-19 10:52", "message": "What remains of the Hassan family home in the Nuseirat refugee camp in the center of the Gaza Strip, where according to the Palestinians 31 people were killed."}, {"id": "3838aef0-53b7-4fb3-942b-eeeba4e3aaf1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27459/", "date": "2024-05-19 10:51", "message": "The funeral procession of Sharhabil al-Seid in Lebanon:\nSo many Hamas operatives, far from uninvolved and well marked so that it is impossible to get confused."}, {"id": "1fbc1eea-f957-4ebd-ae1f-7047861487e4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27455/", "date": "2024-05-19 10:50", "message": "The words of the President of Azerbaijan this morning following his meeting with the Iranian President:\n\nToday the whole world is looking at the friendship between the two countries (Iran and Azerbaijan -AA) which is at its peak.\n\nFor the first time the presidents of the two countries meet at the zero point of the border between them.\nIn the field of international issues, our positions are very close and there is mutual support between the countries within the various international organizations."}, {"id": "a192d74a-1f7f-4ea0-a428-5014d7694d9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27454/", "date": "2024-05-19 09:00", "message": "The Palestinians report that the death toll in the attack on the house of the Hassan family last night in Nuseirat (central Gaza) has risen to 31."}, {"id": "5bc15f20-11be-49ab-8af8-536f98cb5bfa", "channel_id": 1560386984, "url": "", "date": "2024-05-19 09:00", "message": "Lebanon: The funeral procession of Sharhabil al-Seid, the senior in the military wing of Hamas who was killed in an Israeli attack, is on its way.\n\nMany participants. Not everyone is innocent."}, {"id": "c0ccde7b-9ed8-4714-bb76-69518e8c5e1b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27451/", "date": "2024-05-19 08:32", "message": "Unofficial sources identified with the Shiite axis claim that the UAV that Hezbollah launched in the last hour towards Arab al-Aramshe (Israeli territory) attacked from the air before hitting the target."}, {"id": "8ca0aaa0-7c61-4c32-81b1-ba70000a5b93", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27448/", "date": "2024-05-19 08:09", "message": "A disturbing meeting this morning from Israel's point of view:\nThe President of Azerbaijan, Ilham Aliyev, met this morning with the President of Iran, Raisi, at the border point between the countries close to Kiz Kalasi.\nThe two met on the occasion of the establishment of a dam there.\n\nAliyev is considered a friend of Israel and Azerbaijan carries out security procurement of the most significant dimensions from Israel. It holds advanced Israeli weapons and some even saw it as a pontential Israeli base against the Iranian enemy.\nSuch a public and well-documented meeting certainly does not help Israel.\nI will also note that Aliyev is close to Turkish President Erdogan.\nMore than once, the Israeli flag has been seen raised in demonstrations in the territories of Azerbaijan in recent years (for example, after the successful takeover of territory from neighboring Armenia).\n\nRaises questions..."}, {"id": "b34adb76-b2b1-4a23-974d-f3a2675e8404", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27447/", "date": "2024-05-19 07:37", "message": "The Palestinians report the assassination of Zahar al-Khouli, the commander of the Hamas investigation department in the central Gaza camps, along with his right-hand man Jahad al-Hamidi in a drone attack (apparently this morning) near Barj Palestine in Deir al-Balah (central Gaza)."}, {"id": "ee762ad5-186d-4e82-b77e-b612dfc0f81d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27446/", "date": "2024-05-19 07:35", "message": "Insight for the morning:\nThe price of normalization with Saudi Arabia after the US elections will be much cheaper for Israel, even if the next president is Biden."}, {"id": "4b67cf67-5ecf-4da9-aeda-4e603aa9823b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27445/", "date": "2024-05-19 07:34", "message": "Gaza Strip: Gazans learn first hand that chasing aid trucks and trying to unload goods from them while driving can be a dangerous business...\nThe truck driver doesn't even stop..."}, {"id": "ecdaa115-734e-4b7d-8c64-08440edd6ff5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27444/", "date": "2024-05-19 07:33", "message": "Geert Wilders, the leader of the party for freedom in the Dutch parliament who announced this week that he succeeded in forming a government in the Netherlands (an ardent supporter of Israel) tweets on Twitter in the Turkish context:\n\nAtatürk ✔️\nErdogan ❌\n\n###\nKemal Atatürk was the founder of the Republic of Turkey and its first president who advocated secularism and worked to weaken the power of the religious establishment in Turkey.\nThis is compared to President Erdogan who is taking Turkey in the religious - Islamist direction."}, {"id": "fa8d2e53-ff2e-4063-b192-edb08cff4f16", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27443/", "date": "2024-05-19 07:30", "message": "The Shiite militias in Iraq claim that they attacked a target in Eilat early in the morning using a UAV."}, {"id": "1e316797-90b4-4c8a-a45e-b344acc43f74", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27443/", "date": "2024-05-19 07:30", "message": "USA: In New York the police were a little more determined in dealing with the \"celebrators\" of the anniversary of the Palestinian Nakba."}, {"id": "1751225f-fa47-4f98-b211-9ed3aa86fc36", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27441/", "date": "2024-05-19 07:29", "message": "Berlin: German police officers deal with the \"Nakba celebrants\" who demonstrated in the city."}, {"id": "7d0df570-11a4-46dc-879d-46a951b9c663", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27440/", "date": "2024-05-19 07:28", "message": "The Palestinians are reporting tonight that 21 people were killed in the attack on the house of the Hassan family in the new camp in Nuseirat in the center of the Gaza Strip.\nThe dead are members of the families: Hassan, Akel, Hamid, Harara and Nazar.\n\nIn another attack, the Palestinians report 6 dead at the Shahin family home on Jaffa Street in the Tapah neighborhood of Gaza City.\n\n##\nThe volume of Gazan deaths in the events reported in the Gazan media in the past day is relatively high compared to the last few weeks."}, {"id": "70413e96-b1cd-46cb-8fad-f72ae55cbc48", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27438/", "date": "2024-05-19 07:27", "message": "The Palestinians report air force attacks tonight and early morning in the north of the Gaza Strip in the Jabaliya refugee camp and near the Kamal Adwan hospital, along with continuous artillery fire in these areas."}]