[{"id": "e974c370-bf1d-47a4-99fc-8757829a075e", "channel_id": 1560386984, "url": "", "date": "2024-06-13 10:20", "message": "Al Jazeera presents: the Swedish village in the southwest of Rafah - before and after"}, {"id": "24cdd343-5df1-4ee5-89c7-5291da8f7708", "channel_id": 1560386984, "url": "", "date": "2024-06-13 10:18", "message": "Sources associated with the Assad regime on the video of the IDF soldiers shooting the catapults 👆:\n\"The occupation army acts like its allies, the Syrian rebels, in the first years of the civil war in Syria.\""}, {"id": "27882c73-1aab-46bb-9d2b-8fa27c846a66", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68735/", "date": "2024-06-13 10:17", "message": "Iraq: Oil refinery facilities in Erbil (Kurdistan Region) have been on fire since yesterday.\n\nSources associated with the Iranian axis claim that Kurdish oil from this region will find its way to Israel in the coming days."}, {"id": "96dc6230-18d6-433b-9e39-5901326f5347", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68735/", "date": "2024-06-13 10:16", "message": "Los Angeles USA:\nPro-Palestinian protesters/terrorists took over a floor of a building at California State University in LA while holding lecturers from the university's academic staff, including the president of the university, hostage in the building.\n\n##\nThat's how it is when your role model is a terrorist organization that kidnaps people... Maybe this will wake up some Americans who still don't understand what's going on around them."}, {"id": "29f94b22-daf5-4d2d-82d7-72c46a8b3e54", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68735/", "date": "2024-06-13 10:15", "message": "This is undoubtedly one of the most popular videos this morning on the Lebanese and Palestinian channels.\nAccording to the Lebanese channels, this is how the IDF causes fires in southern Lebanon.\n\nOnly missing swords and armor... and the Game of Thrones crew🔥"}, {"id": "a850ea6e-2863-4777-b081-13901ee27ce8", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68735/", "date": "2024-06-13 08:16", "message": "An example from this morning of the detonation of several explosives planted in one of the roads in Jenin - the IDF continues to strip the roads in the area."}, {"id": "b5d04d9f-3a12-4a81-abee-b9dd1858bc41", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68727/", "date": "2024-06-13 07:43", "message": "The Palestinians report that the IDF has been operating in the Jenin area and the Jenin refugee camp for about five hours.\nThey complain about the fact that the IDF destroys the road infrastructure in the area just days before Eid al Adha."}, {"id": "8deee980-9f2a-4a9c-acee-9b307cd58304", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68727/", "date": "2024-06-13 07:42", "message": "A video sent to me by the follower R. from the beach near the place where the settlement of Pe'at Sade in the south of the Gaza Strip was located before the disengagement.\nTaken in the last few days."}, {"id": "3bf748d5-a103-429b-a88e-9febd0fb7f76", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28833/", "date": "2024-06-13 06:14", "message": "Are the Christians in Lebanon preparing for war?\n\nAn unknown organization calling itself \"Rebellion\" posted recruitment ads targeting young Christians in Lebanon.\nThe ads were hung near the church in the Ashrafia neighborhood in Beirut, the capital of Lebanon, and with the approval of the church.\n\n##\nIn this context, I will point out that many Christians in Lebanon (and not only) wish for Israel's victory over Hezbollah and are counting on Israel to rescue Lebanon from the suffocating grip of Hezbollah.\nThis is part of recent Lebanese discourse.\nIsrael has important allies in Lebanon."}, {"id": "16b7ed1e-99c9-480a-9a4c-356c84907360", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28832/", "date": "2024-06-13 06:13", "message": "IDF advance in Rafah:\n\nGaza sources report a ground advance from south to north of maneuvering forces and tanks in the urban area of ​​Rafah's Mawasi - near the seashore and the Flag Square area.\n\nThe IDF denied morning reports of attacks in the humanitarian area in Mawasi (located north of there in the Khan Yunis district)."}, {"id": "66e47108-0804-4541-9347-aca30d01b606", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28831/", "date": "2024-06-13 06:12", "message": "Saudi Arabia: Arab channels report an unprecedented military deployment in the city of Mecca that includes the introduction of troops and military equipment seen there for the first time.\nAccording to the Saudis, the purpose of the extensive deployment is to maintain public order in the holy city of Islam, during the days of the pilgrimage."}, {"id": "7c4dccd0-f5b3-4a9e-9590-502cea68e9e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28830/", "date": "2024-06-13 06:11", "message": "The destruction in the eastern part of the Bureij refugee camp in the center of the Gaza Strip after the departure of IDF forces from there last week."}, {"id": "3cddbc0b-fb30-4c95-8fbd-2a6967836843", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28828/", "date": "2024-06-13 06:10", "message": "Before and after: the Yabneh refugee camp in Rafah in the south of the Gaza Strip (located near the Philadelphi axis, roughly in the middle of it)."}, {"id": "b3e86504-da50-409d-8bd9-8bdbd650f977", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28827/", "date": "2024-06-13 06:07", "message": "Al Jazeera: The US Congress has approved the introduction of changes in the budget of the US Department of Defense in a way that will prevent the transfer of funds for the reconstruction of the Gaza Strip."}, {"id": "05689cfe-7584-4373-a109-ee31c51621cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28826/", "date": "2024-06-13 06:06", "message": "Following the personal attack by senior Hamas official Osama Hamdan on the US Secretary of State Blinken, last night Hamas issued an official proclamation in which it stated:\n\nThe positions expressed by the American Secretary of State Blinken, through which he tries to clear Israel of guilt and accuse Hamas of responsibility for not reaching an agreement, are a continuation of the US policy that allows the continuation of the crimes of the occupation under American military-political cover.\nWe call on Blinken and the Biden administration to put pressure on the fascist occupation government that insists on completing the genocide.\n\n##\nHamas made a decision to address Blinken personally."}]