[{"id": "1be379f0-ad56-4ac5-9861-51feddad8b3f", "channel_id": 1560386984, "url": "", "date": "2024-08-12 19:42", "message": "This is what remains of the house of Jamil Mezher, Deputy Secretary General of the Popular Front, in the Nuseirat refugee camp in the center of the Gaza Strip, which was bombed 👆 last night (after an evacuation alert).\nMezher actually serves as the Secretary General in practice since the Secretary General himself, Ahmed Sa'adat, is imprisoned in Israel for his involvement in the murder of Minister Rehavam Ze'evi."}, {"id": "8a068075-6a59-4edb-a639-73319ad3cccd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32319/", "date": "2024-08-12 19:30", "message": "Tehran: The view from the \"Tutshal 2\" tourist station  - looking at the guest house of the Iranian Revolutionary Guards where Ismail Haniyeh was killed (the black cloth covers the area since the killing).\n\nYou can comfortably settle in to sleep. There's a great breeze at night."}, {"id": "c7faa05f-2840-43b0-a2be-fd3ea49a04b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32318/", "date": "2024-08-12 19:25", "message": "Joint statement by the leaders of the USA, UK, France, Germany and Italy:\nThey call on Iran to stand down its threats to attack Israel.\nWe express our support for the defense of Israel against aggression by Iran and its proxies."}, {"id": "6dbbaaa1-b9f5-4138-b001-0b9a114cccb7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32316/", "date": "2024-08-12 19:24", "message": "Attached is his interview with Palestinian channels immediately upon his release in a deal with Hamas last November - he was 17 at the time."}, {"id": "e4c646bb-133e-43b5-887f-93e9e3680532", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32315/", "date": "2024-08-12 19:23", "message": "In the picture here 👆 Tarek Daoud who was killed this evening is standing next to Ashraf Nafe - \"Ezkiham\" (the blind) the commander of the Izz ad-Din al-Qassam Brigades in Tulkarm who was killed in an airstrike recently."}, {"id": "17a215e6-5d99-4957-b5a7-c7957a2209c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32314/", "date": "2024-08-12 19:21", "message": "Palestinian channels report that the terrorist who was killed this evening in Qalqilya is Tarek Daoud, an operative of the Izz ad-Din al-Qassam Brigades, who was released from Israeli prison as part of the hostage release deal with Hamas last November.\n\nAccording to these sources, he has carried out several shooting attacks in recent months, became a wanted man and this evening was eliminated."}, {"id": "377b491d-d540-4901-9654-5b978194f27c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32313/", "date": "2024-08-12 18:39", "message": "IDF Spokesperson: A short while ago, a shooting attack occurred in the city of Qalqilya during which a terrorist fired at an Israeli civilian who was in the city, injuring him and two Palestinians. The Israeli civilian was evacuated to a hospital to receive medical treatment.\n\nIDF forces conducted a pursuit after the terrorist and neutralized him adjacent to Qalqilya.\n\nThe IDF emphasizes that the entrance of Israeli civilians into Area A is dangerous and prohibited by law."}, {"id": "6905e6d9-37f6-4ab8-b70a-bdae8f27828d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32312/", "date": "2024-08-12 17:27", "message": "A picture taken by soldiers and circulating on Palestinian channels:\n\nالدمار في شارع فاطمة الخطيب خلف برج المصري وسط رفح.\n\nThe destruction on Fatima Al-Khatib Street behind Al-Masri Tower in the center of Rafah.\n\nGazans identified with Fatah pointed out the fact that the IDF drives around this area with open, unprotected jeeps, which indicates the low level of risk that Hamas poses for them in this area."}, {"id": "3e5be671-74da-407c-a287-70083500ea07", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32308/", "date": "2024-08-12 17:19", "message": "Kursk: the green buses\n\nSyrian opposition supporters delight in photos reportedly from Kursk in which Russian citizens are allegedly seen evacuating in green buses.\n\nThe reason: the infamous green buses of the Assad regime (an ally of the Russians) evacuated the rebels who surrendered in Damascus and southern Syria during the Syrian civil war and exiled them to other areas.\n\nFor opponents of the Assad regime, this is sweet, poetic justice."}, {"id": "1b82a28f-080d-43c9-ac07-4201be581531", "channel_id": 1560386984, "url": "", "date": "2024-08-12 17:02", "message": "Senior Hamas official Izzat al-Risheq:\n\n\"The admission of Gallant, the \"minister of war of the occupation\" that Israel is the reason for the delay in the deal for the return of the abductees and that the talk of total victory is complete nonsense, confirms what we have always said that Netanyahu is lying to the world and to the families of the abductees and that he does not care about the lives of the prisoners and that he is not interested in the deal and that all that matters is the continuation of the war and its expansion.\n\nThe flexibility and positive approach offered by Hamas in agreeing to Biden's proposal and the Security Council's decision to facilitate reaching an agreement, clashed with Netanyahu's requests and his evasion of the need to reach a ceasefire and a prisoner exchange deal.\n\nThe world must put pressure on Netanyahu and his government to stop the aggression and the war of extermination, and reach a deal, since the victory that Netanyahu is looking for is an illusion and a mirage.\""}, {"id": "66d72718-9b5a-4225-92d2-430b9169e22b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32305/", "date": "2024-08-12 16:15", "message": "Kursk: Ukrainian soldiers take down the Russian flag.\nChechen soldiers (of Kadyrov) were captured by the Ukrainians."}, {"id": "f3d73052-bfc9-4ac3-8762-46f72de2a13b", "channel_id": 1560386984, "url": "", "date": "2024-08-12 16:12", "message": "Russia-Ukraine war: the invaded has become an invader\n\nUkrainian forces managed to occupy territories in the Kursk region of Russia.\n\nThe Russian governor of the Kursk region admitted today that 28 settlements in the Kursk region are under Ukranian control.\nThe map shows that the Ukrainians succeeded in occupying land 12 km deep in Russia and about 40 km long (note everything is changing in realtime - AA).\n\nThis is a serious blow to the prestige that Russia is trying maintain.\nIf the numbers of their dead and destroyed tools are covered up, the occupation of territory is indisputable.\nThe Arab world is watching.\nRussia usually radiates strength and power, mobilizing sympathy and alliances among Arab countries (and African countries) and now it itself is being trampled under the feet of Ukrainian soldiers in Kursk.\nThis does not add to her reputation and honor especially in areas where reputation and honor mean a lot.\n\nMap legend:\nUkraine - yellow\nRussia - pink\nBlue - territory occupied by the Ukrainians"}, {"id": "3d660599-c593-4d7f-978a-a6a27e711864", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32303/", "date": "2024-08-12 15:16", "message": "Channels identified with the Shiite axis are waiting for the start of the game..."}, {"id": "edfad513-f3ac-45da-b39d-c5eddfd46c29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32299/", "date": "2024-08-12 15:07", "message": "Do you remember that senior Hamas official Izzat al-Risheq and the Hamas movement officially claimed 👆 that there were no armed men at all at the \"al-Taba'een\" school?\n\nLets reveal their lies.\n\nToday, the IDF spokesman announced that Yousef Shoidh was among the dead and is an officer in the Hamas police.\nAttached are posts from three members of his immediate family: his sister, uncle and brother-in-law - they testify that he was killed in an attack at a-Taba'een school, that he is an officer in the rank equivalent to a colonel and that he is a \"mujahid\" - a fighter.\n\nHamas is lying."}, {"id": "63689ba6-293b-499e-81f3-184fada5ff13", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32297/", "date": "2024-08-12 14:36", "message": "Joint IDF and ISA announcement:\n\nIdentities of 31 Hamas and Islamic Jihad Terrorists Confirmed Eliminated So Far in the Strike on the Military Facility at the Al-Taba’een School\n\nFollowing intelligence research by the IDF and ISA, the names of 12 more terrorists who were eliminated in the strike last Saturday (10.8.24) on the military facility at the Al-Taba’een School, are revealed."}, {"id": "68b7d451-69f0-4c03-90ce-9b66a6dfc6d1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32295/", "date": "2024-08-12 13:06", "message": "Lebanese channels: Israel attacks with phosphorus in the Kounine area in southern Lebanon."}, {"id": "dc6accd2-edcd-4167-9d1c-450439366e8d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32291/", "date": "2024-08-12 11:44", "message": "The evacuation of the displaced Gazans from the Hamad neighborhood in Khan Yunis, processed with a filter that has a \"Nakba\" feeling to it."}, {"id": "38ba3c0c-d4e1-451e-a776-cb2bc67c57c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32289/", "date": "2024-08-12 11:34", "message": "Lebanese sources: an IDF drone fell between the houses of the village of Debaal in southern Lebanon."}, {"id": "4fafdfcc-878e-4dda-a704-667a1137b151", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32288/", "date": "2024-08-12 11:27", "message": "The reaction of Abu Khader from Deir al-Balakh to the cigarette announcements 👆 that the IDF dropped yesterday in Mawasi in Khan Yunis:\n\n\"The IDF dropped flyers in Mawasi and said:\nWhat do you prefer, ototin (nicotine) or leaders (of Hamas)?\nI choose the Hamas leaders... we no longer want ototin... from the day you stopped (bringing) the ototin to Gaza... you gave us health... breathing became better... we stopped the ototin...\nWe want peace... oh my god is\nimma (Hebrew for mother, a nickname for Israel -AA) .... we want peace... we are tired... we don't want ototin.... we want peace... mother... mother...\"\n\n##\nAbu Khader weaned himself off nicotine.... but the crisis is still here (:"}, {"id": "725fb2f3-232d-43cf-bad0-73b121acba81", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32287/", "date": "2024-08-12 09:59", "message": "The Palestinian Ministry of Health in Gaza in a special and exceptional statement regarding the daily casualty report:\nIn the last 48 hours, 142 people were killed and 107 of them arrived at the hospitals (and were identified).\n\n##\nFor the first time since the beginning of the war, the Ministry of Health has added two days to its report.\n\nUntil today, only bodies that physically arrived at the hospital were counted and there was no situation where the Palestinian Ministry of Health in Gaza, at least according to their claim, counted bodies that did not arrive at the hospital (after all, this is the basis for the claim that there are ten thousand missing Palestinians under the rubble).\n\nThe Palestinian Ministry of Health says in fact that during the last two days (Saturday + Sunday - including those killed in the attack on the \"A-Taba'een\" school in Gaza City) there have been 107 deaths.\n\nYesterday, according to Palestinian channels, at least 30 Palestinians were killed (which is slightly less than the daily average) and I will also note that on Saturday there were more Palestinian deaths beyond the actual attack on the school, as every day. That is, it can be roughly estimated that al-Mimadani al-Ahli Hospital in Gaza City recieved 40-50 dead from the attack on the school (of which the names of about 30 dead were published on several channels).\n\nThe Palestinian Ministry of Health in Gaza is trying to juggle two weddings here - on the one hand to try and continue to maintain credibility and on the other hand to help Hamas establish the lie that there were 100 dead in the school without \"dirtying its hands\" with a \"miscount\".\n\nOtherwise there is really no explanation as to why the ministry chose to consolidate a report of two days and declare the number of dead who did not arrive at the hospitals, which is contrary to the practice followed until now."}, {"id": "24dae34f-0996-459b-bc80-dd8ca85fb533", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32286/", "date": "2024-08-12 09:55", "message": "There is a very simple way to solve this problem:)"}, {"id": "fdf0a649-d316-47c3-91c6-b01ec5bd605f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32285/", "date": "2024-08-12 09:53", "message": "Further to the billboard 👆 that was hung yesterday in Palestine Square in Tehran and further to the Hamas statement regarding the lack of interest in further negotiations that was published last night, the Iranians (and Hamas) are trying to promote a narrative that Israel made a mistake in the assassination of Ismail Haniyeh because, according to them, he was a \"moderating factor\" in the leadership of Hamas and now Israel needs to face the \"militant Sinwar\"."}, {"id": "df00bfab-7fc6-424d-b4ed-d87817cee431", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32284/", "date": "2024-08-12 08:57", "message": "Residents of the Issawiya neighborhood in East Jerusalem report that \"captain Kadosh\" (nickname for who writes these notices -AA) from the Israeli Shin Bet left them flyers in which he warns against the increasing terrorism and incitement in the neighborhood. He calls on parents to keep their children safe as the matter will be dealt with \"with an iron hand.\"\n\nCaptain Kadosh, according to the announcement, is also taking note of the Beit Hanina and Shuafat neighborhoods in northeast Jerusalem."}, {"id": "f6098bad-d15b-47e8-9476-eaed82ab7271", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32283/", "date": "2024-08-12 08:52", "message": "The German airline Lufthansa is suspending its flights to and from Tel Aviv, Beirut, Tehran, Amman (the capital of Jordan) and Erbil (the Iraqi Kurdistan region) until August 21."}, {"id": "db844b6e-caac-4d19-8fcb-ac092e4f8c13", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32282/", "date": "2024-08-12 08:40", "message": "Britain, France and Germany, in a joint statement, call on Iran to refrain from attacks that would cause escalation and endanger the cease-fire deal in Gaza.\nThe announcement also called for the release of all the abductees held by Hamas and for the introduction of aid to the Gaza population."}, {"id": "8b0d729d-bca6-4930-bd07-96301f8ce65c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32281/", "date": "2024-08-12 08:38", "message": "Yemen: The Lebanese Al Mayadeen channel reports an American-British attack against targets on the island of Kamaran, in the province of Hodeidah, which is under the control of the Houthis."}, {"id": "837f2e21-9730-4264-9c83-fcd2b70967ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32280/", "date": "2024-08-12 08:35", "message": "Lebanon: Al-Sharq al Awsat newspaper claims that billboards with the inscription:\n\"Enough... we are tired..\nLebanon does not want war\"\nWere put up in different areas of Beirut, areas identified with the opposition.\nAccording to the article, no party accepted public responsibility for the sponsored message.\n\n##\nI will point out that apart from the attached photo, I have not come across any other photos indicating the scope of the billboards in question."}, {"id": "fbf55ec2-ff5d-4165-9a20-6d3ab1f287d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32279/", "date": "2024-08-12 06:42", "message": "Palestinian and Arab accounts publish a photo they took from Yinon Magal's page showing a huge Israeli flag being flown in the center of Rafah.\n\nIt did not cause the Palestinians any moments of happiness...\nGazans had a lively discussion about how this indicates the weakness of the \"resistance\" in the city of Rafah - which has been nicknamed the \"black box\" of the Gaza Strip (\"full of surprises against the Zionist occupation\"). Some also saw this as Israeli defiance towards Egypt because the flag was clearly visible from the Egyptian side as well (Egyptian President al-Sisi recieved a few curses online for this)."}, {"id": "87bb6091-b88f-498e-b092-0405316d070c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32277/", "date": "2024-08-12 06:39", "message": "Documenting the moments of the attack on the home of the Abu Ramdan family and the results of the attack, yesterday in the Sheikh Radwan neighborhood in Gaza City."}, {"id": "b69e08a8-3003-4599-afb0-9e999d09ad54", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32276/", "date": "2024-08-12 06:39", "message": "The Minister of Foreign Affairs of the European Union, Josep Borrell, calls for sanctions to be imposed on Minister Itamar Ben Gvir following the latter's call to withhold food and fuel from the population of Gaza and encourage its deportation.\n\nBorrell calls for sanctions to also be imposed on Minister Smotrich for his statement against the residents of Gaza a few days ago."}, {"id": "f0056fbb-4793-46d8-b992-f7a9b606dc64", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32275/", "date": "2024-08-12 06:37", "message": "The American Defense Minister, following a conversation with Defense Minister Gallant, instructed to accelerate the arrival of the American aircraft carrier Abraham Lincoln, equipped with F-35c aircraft, to the area under the control of the American Central Command, where it will join the American aircraft carrier Theodore Roosevelt.\nThe Minister of Defense also instructed that the submarine USS Georgia of the Ohio model, which is powered by nuclear energy and capable of launching guided missiles, will also arrive in the area."}, {"id": "2d19d356-5404-4632-bd0a-00909b24d503", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32273/", "date": "2024-08-12 06:36", "message": "Shortly before two o'clock in the morning, Hezbollah launched about 30 rockets towards Israel.\n\nHezbollah claimed in an announcement on its behalf that it fired Katyushas at the headquarters of the 146th Division in Ga'aton in response to the attack carried out by the IDF in Maaroub yesterday.\n\nAccording to the IDF spokesman, 30 launches crossed into Israeli territory. Some fell in open areas - no casualties."}, {"id": "152913e3-62eb-4b3b-9a30-63abc5984b09", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32272/", "date": "2024-08-12 05:16", "message": "The IDF announces the death of Omer Ginzburg, a paratrooper in the 101st Battalion, who was killed yesterday in combat in the southern Gaza Strip.\n\nMay his memory be a blessing."}]