[{"id": "3d11525b-895d-4061-b153-d75b9642beae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31700/", "date": "2024-08-03 09:47", "message": "At first glance this is reminiscent of Gaza...\n\nIn reality this is the Palestinian refugee camp al Yarmouk in Damascus (Syria) after the Shiite militias of Iran destroyed it in 2015...\n\nThe world has forgotten."}, {"id": "79910b7a-424a-4f16-8c63-27c52e438cd5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31699/", "date": "2024-08-03 09:45", "message": "The operative who was killed in the Israeli attack in Wadi Jilo in southern Lebanon:\nAli Abd Elali.\n\nReally does look like his brother👆"}, {"id": "7ad65b43-4182-404a-a22d-6e7b2894d24d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31698/", "date": "2024-08-03 09:38", "message": "Following Haniyeh's assassination, the Hamas movement opened an official home for mourners in... Baghdad, the capital of Iraq.\n\n##\nThis is another indication of the development of Hamas in Iraq after it opened an official office in the country for the first time in recent months."}, {"id": "c1c6cdca-4918-4483-b65c-b8b83f56a812", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31697/", "date": "2024-08-03 09:38", "message": "Documentation from Milad's funeral in Tehran, complete with a military band and professional mourners."}, {"id": "e5261ef5-dfa0-47d8-bc26-f2eebcf9518c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31694/", "date": "2024-08-03 09:27", "message": "This morning, the funeral of Milad Bedi, the Iranian adviser who was killed in the Israeli attack on the Dahiya in Beirut, was held in Tehran - the attack in which Hezbollah Chief of Staff Fuad Shukr was killed.\n\nHis body was transported from Lebanon on a horse to the Sayyidah Zaynab Temple in southern Damascus, where religious Shiite ceremonies were held and from there his body was flown to Tehran."}, {"id": "b277ab67-96fb-419f-92c6-d2aa99fa7da6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31693/", "date": "2024-08-03 09:18", "message": "South Lebanon: the UAV attack 👆 in Wadi Jilo - one of the Hezbollah rescue team members who rushed to help the victims of the attack discovered that the person killed in the attack was his brother...\n\nThe Lebanese Ministry of Health confirms that there is one dead and two wounded in this attack."}, {"id": "826ae4f1-b1a7-4cd5-afd0-6f980840e16f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31690/", "date": "2024-08-03 09:16", "message": "South Lebanon: Casualties in an Israeli drone attack in the Wadi Jilo area in the Tyre governorate about an hour ago."}, {"id": "bdee280a-ef2a-4528-b42c-7e3ff807bfa7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31685/", "date": "2024-08-03 09:15", "message": "The bulldozers at work in the Tulkarm refugee camp."}, {"id": "cb355134-c902-45ae-8674-65e2d1e2772f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31682/", "date": "2024-08-03 08:26", "message": "Tulkarm is receiving special treatment today - bulldozers are on their way to the Tulkarm refugee camp."}, {"id": "c713a2da-a06b-4759-9ed9-b7aa15d9c796", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31681/", "date": "2024-08-03 08:20", "message": "Trump: I agreed to debate Kamala Harris on September 4 on the Fox News channel in Pennsylvania."}, {"id": "34d6c5a3-cc0a-4061-a9e8-bed09e6e3e1a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31680/", "date": "2024-08-03 08:20", "message": "Nasrallah is expected to give a speech on Tuesday at 17:00 at a ceremony marking the one-week anniversary of the assassination of Fuad Shukr.\n\n##\nHe must have felt that his last speech was weak and needed fixing."}, {"id": "7eaee4a0-2516-4943-9b82-6d1a016d8a67", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31679/", "date": "2024-08-03 08:19", "message": "Yesterday a cargo flight of the Russian company Gelix was observed: an Ilyushin 76 cargo plane landed in Tehran, on its way from Moscow.\n\nThis is the first time that this Russian airline, which is used for the transfer of military cargo, has landed in Tehran."}, {"id": "11598665-22b6-41b5-ae42-b63fd7d33d97", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31678/", "date": "2024-08-03 07:37", "message": "This is what a Hezbollah-affiliated channel wrote this morning, explaining why Hezbollah must respond to the assassination of Fuad Shukr:\n\nFuad Shukr, Sayyid Mohsen, was de facto the most senior military commander in Hezbollah. Its Chief-of-Staff. He was one of the organization's founding members, and made Hezbollah what it is today.\n\nHe is Emad Mughniyeh (Hezbollah's Chief-of-Staff who was killed in Syria in 2008) and Mustafa Bader a-Din (head of Hezbollah's Foreign Affairs Division who was killed in Syria in 2015) in one man. He was the heart of Hezbollah."}, {"id": "789e76a0-7429-4536-8fc9-23ead1ca41f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31677/", "date": "2024-08-03 07:30", "message": "This is what the Fatah-affiliated channel wrote this morning:\n\nإيران لم تستطع إيجاد رئيسها المفقود «رئيسي»، ولا حماية «هنية» من الموت، ومع ذلك تجيد استخدام الشعارات الكبيرة، وهي تعلم أنها أضعف من أن تخوض حربًا مع إسرائيل، فتصنع حروبًا بالوكالة، لكن مع سقوط أدوات محورها المزعوم بانت سوءاتها، ولم يعد أمامها سوى الهجوم أو الانحسار.\n\nIran was unable to find its missing president, Raisi, (for two days -AA) nor protect Haniyeh from death. However, it is adept at using big slogans (talks and threatens a lot -AA), and it knows that it is too weak to wage war with Israel, so it creates proxy wars. However, with the fall of the tools of its alleged axis (the proxies -AA), its shortcomings became apparent, and it has no choice but to attack or retreat."}, {"id": "107ad5c5-5d50-40dc-af60-c573c944a624", "channel_id": 1560386984, "url": "", "date": "2024-08-03 07:28", "message": "Increasing US presence in the Middle East and Persian Gulf\n\nLast night, the American Navy officially announced that the aircraft carrier Theodore Roosevelt (attached photos) arrived in the area of ​​activity of the Fifth Fleet, which includes the Persian Gulf, the Red Sea, the Gulf of Amman and part of the Indian Ocean.\n\nIn addition, the US Secretary of Defense reportedly instructed the aircraft carrier Abraham Lincoln to move towards the Middle East, this in addition to a squadron of US fighter jets that was ordered to arrive in the area along with the additional deployment and deployment of air defense systems.\n\nThe Americans seek to deter Iran and its proxies from wide-scale escalation, with the aim of stopping the region from sliding into an all-out war.\nMessages were sent to Iran that the US would not hesitate to attack if its forces were attacked.\n\nThe US is throwing its military weight into the Middle East following the assassination of Haniyeh and the assassination of Hezbollah's Chief of Staff."}, {"id": "da21f8dd-5bf2-48c3-bb36-4778704d2480", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31672/", "date": "2024-08-03 07:24", "message": "The New York Times: Iran makes arrests among members of the Revolutionary Guards following the assassination of Haniyeh\n\nThe American newspaper The New York Times reports that the Iranian security forces arrested over 20 members of the security unit of the Iranian Revolutionary Guards due to suspicion of their involvement in the assassination of Haniyeh.\n\nAccording to the report, there is documentation on security cameras of those involved in the assassination, and some of them managed to escape from Iranian territory.\n\nIt was also reported that his assassination was originally planned to happen when Haniyeh arrived for the funeral of the President of Iran about two months ago but was postponed."}, {"id": "bf0a8307-3e22-4202-ae3d-c59e6f27d152", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31671/", "date": "2024-08-03 07:23", "message": "Lebanese sources: another wave of Israeli attacks (Tuesday) early in the morning in the Syria-Lebanon border area\n\nLebanese sources report that around two in the morning, Israeli warplanes carried out a third wave of attacks (after last night's attacks at 21:00 and 23:30) in the Lebanon-Syria border area in northeastern Lebanon (Salhiya area).\n\n##\nIt is evident that Israel tried to thwart a significant shipment of weapons from Iran to Hezbollah and attacked both the airport, the trucks carrying the weapons and ammunition, and their pirate crossing point on the border between the countries."}, {"id": "4cd4fef7-e335-4b1f-8c4b-1fea959598e3", "channel_id": 1560386984, "url": "", "date": "2024-08-03 07:22", "message": "5 Palestinians killed in an aerial attack in Tulkarm\n\nThe Palestinians report 5 dead as a result of an attack by an Israeli aircraft on a vehicle in the area of ​​the village of Atil in Tulkarm around 06:30.\n\nThe bodies of the five were charred and as of this time (three hours after the attack) only two of the dead have been identified:\nHaitham Blaidi - a commander of the military wing of Hamas in Tulkarm.\nAhmed Dabaa, known as \"A-Dakhrouki\" - also a military operative.\n\nIn one of the photos, the two are seen (circled in red) next to the commander of the military wing of Hamas in Tulkarm who was killed in a drone attack in the last two weeks.\n\nIn one of the attached videos, IDF forces can be seen arriving at the scene of the attack immediately after the attack. This is a refreshing and interesting innovation with a mental effect of a strong grip on the ground - checking the results of the attack with a close eye.\n\nBefore the attack, Israeli bulldozers were operating in Tulkarm and arrests were made."}]