[{"id": "dd5ec1ce-f6fa-47ea-a189-80b7e077bb81", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28150/", "date": "2024-05-31 07:16", "message": "Nikki Haley at the Western Wall.\n\nPhoto credit: The Western Wall Heritage Foundation."}, {"id": "33cbe019-1817-49a3-ae4c-6f9e25f1a336", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28149/", "date": "2024-05-31 07:14", "message": "Members of Al-Aqsa Martyrs' Battalions (AMB) in Tulkarm se to be upset that people doubt their claims 👆 regarding the infiltration of the Israeli town of Bat Hefer and published a video of an M-16 (with a close-up on its serial number) claiming it to be the rifle which they allegedly took from an \"officer's house\" during their supposed infiltration.\n\nIt's worth noting that several days ago the AMB militants claimed to have taken an M-4 rifle, now they're presenting an M-16. They also claimed that they took a Glock pistol, which for some reason wasn't featured in the video. There seem to be quite a few inconsistencies in the Palestinian claims."}, {"id": "daed1830-58be-4bba-b877-310aed8b65b6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28148/", "date": "2024-05-31 07:03", "message": "Hamas-affiliated sources claim: The explosions that rocked Gaza City last night and made the residents think it was an earthquake were a controlled explosion carried out by the Israeli forces in a residential complex in the north of the Gaza Strip."}, {"id": "04803e3a-4c44-4aed-a303-63a28db605b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28147/", "date": "2024-05-31 07:02", "message": "Yemeni media reports 14 dead and 30 wounded (including civilians) in an American-British attack tonight in the port city of Hodeidah and the a-Salif area, in western Yemen.\n\nAccording to the report, the government building and the Broadcasting Authority building in Hodeidah were targeted.\n\n###\nLet's hope no innocent civilians were killed... I'm sure an investigation will be conducted and everything will be presented transparently if so."}, {"id": "4266405c-6b7d-416f-8c38-0e9a8674a3a8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28146/", "date": "2024-05-31 07:00", "message": "Al-Jazeera: The IDF withdrew from the Jabaliya \"refugee camp\" in the northern Gaza Strip after a military operation there that lasted 20 days.\n\nIn addition, al-Jazeera reports that the IDF has also withdrawn from Beit Lahia, Beit Hanoun, and the rest of the places where it operated in the north of the Gaza Strip.\n\n##\nThe IDF spokesman has not yet issued an official statement on the matter."}, {"id": "d9a2ab7e-049d-4200-867d-2fd7ec29ec7a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28145/", "date": "2024-05-31 06:59", "message": "The Palestinians report three casualties this morning, all members of the Darwish family, in an attack on a vehicle in the Nuseirat \"refugee camp\" in the center of the Gaza Strip.\n\nAccording to the Palestinians, the three were responsible for managing humanitarian aid that entered the Strip.\n\nThe Palestinians additionally also report nine casualties in the attack on the home of the Abu Zahadi al-Sous family in block 9 of the Al-Buriej \"refugee camp\" in the center of the Gaza Strip, last night."}, {"id": "2c4ccbf9-a3c1-4264-aec9-7f9093d0984a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28144/", "date": "2024-05-31 06:54", "message": "The IDF spokesman announced this morning the death of Adar Gavriel from the Bislah brigade (828), and a soldier in the Givati Brigade in battles in the north of the Gaza Strip and in the south.\n\nMay their memory be a blessing."}, {"id": "2c30301b-13ce-4225-86b2-38d724d591c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28143/", "date": "2024-05-31 06:52", "message": "Gaza City residents reported shortly after midnight last night that they experienced an \"earthquake\" - now they claim that it was Israeli bunker-penetrating missiles."}, {"id": "0cfbbd27-fcb3-410f-8b51-d236f7ab5582", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28142/", "date": "2024-05-31 06:51", "message": "Trump's \"hush money\" trial:\nTrump was found guilty of all 34 counts for which he was indicted.\n\nTrump reacted to the verdict: it was an rigged trial, a disgrace... The real verdict will be given on November 5th, by the people.\n\n###\nIn terms of his new legal situation - Trump's conviction does not prevent him from running in the upcoming elections, but it might hurt his public image and thus lower his chances of winning.\n\nTrump accuses the Democrats of this being a political trial. According to some commentators, the conviction can actually help him in the eyes of his voters, who might see the outcome of the trial as political persecution and a witch hunt."}]