[{"id": "f3a3dd4c-ed11-4f67-9182-e2b8d2293c63", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28822/", "date": "2024-06-12 21:42", "message": "From the funeral of senior Hezbollah military commander Taleb Abdullah, this evening in Aadchit in southern Lebanon.\n\nThe funeral took place without any particular disturbances..."}, {"id": "cb1374af-969f-4e2b-9b63-a3d64f1c3949", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28821/", "date": "2024-06-12 21:40", "message": "UNRWA's media advisor complains:\n\nHunger is spreading unprecedentedly in the southern Gaza Strip. Famine in both the north and south of the Gaza Strip has become a reality. The humanitarian aid mechanism in the Gaza Strip is facing collapse due to the prevention of necessary aid from entering the area."}, {"id": "074978d7-a971-4288-a891-4ee9b16dfb17", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28820/", "date": "2024-06-12 21:39", "message": "The subway in New York: a man wearing a Hezbollah shirt and a headband of the PFLP, a Palestinian terrorist organization, makes a threatening gun-shaped gesture with his hand."}, {"id": "bf5c2fc9-43b5-4857-acb7-c1e6777b94ef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28818/", "date": "2024-06-12 20:47", "message": "Al-Jazeera caught altering video of Gazan criticizing Hamas amid ongoing bloodshed\n\nThe largest news network in the Arab world edited and altered Dr. Muhammad Ahmed Jodeh’s harsh criticism against Hamas. Despite their efforts, the full version was posted on social media, revealing the truth.\n\nDr. Jodeh, covered in blood, arrived at Deir al-Balah's hospital after the rescue operation in Nuseirat. From the hospital, he condemned Hamas and labeled Palestinians \"a nation of cowards\" for not opposing them. Al-Jazeera edited out every single time Jodeh criticized Hamas, making it look like his criticism was toward Israel.\n\nAl-Jazeera also removed the unflattering ending of the original clip, showing a group of people trying to silence Dr. Jodeh once they realize he is speaking against Hamas at the presence of journalists. \n\nHere are the two videos: the full powerful version, and the edited and altered version Al-Jazeera presented to the Arab World (See cuts at 00:04, 00:13, 00:22)."}, {"id": "acce3182-2286-4491-9271-5ffc0d6efcad", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28814/", "date": "2024-06-12 19:57", "message": "From the funeral of senior Hezbollah Taleb Abdullah this evening in southern Lebanon.\nThere were no particular disturbances..."}, {"id": "0b87045d-1ba7-4497-8be5-abad20fcedb8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28813/", "date": "2024-06-12 19:56", "message": "UNRWA's media advisor complains:\nHunger is spreading in an unprecedented manner in the southern Gaza Strip.\nFamine in the north of the Gaza Strip and in the south has become a reality.\nThe humanitarian aid mechanism in the Gaza Strip is facing collapse due to the prevention of the introduction of the necessary aid to the Gaza Strip."}, {"id": "f552681a-dd6a-460a-91e7-70b57a13c8e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28812/", "date": "2024-06-12 19:55", "message": "The subway in New York: a man wearing a Hezbollah shirt and a headband of the Palestinian terrorist organization, the Popular Front, \"shooting\" the camera"}, {"id": "204ca831-a598-4be7-b0de-e7c7356cdeb1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28811/", "date": "2024-06-12 18:40", "message": "Hezbollah reveals details about Taleb Abdullah, the senior official who was killed last night in an IDF attack in Juya in southern Lebanon:\n\nBorn in 1969.\n\nJoined Hezbollah in 1984.\n\nFought in Bosnia \"in defense of the Muslims\" in 1992-1994.\n\nFought in Syria in the civil war \"against the terrorist organizations\" in the Syria-Lebanon border area.\n\nIn the current war, he led the operations against Israel in the eastern part of southern Lebanon, near the Syria-Lebanon border.\n\nWon Nasrallah's award of recognition several times."}, {"id": "4d789c09-080f-4e04-930c-f1822059cd7c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28810/", "date": "2024-06-12 17:03", "message": "Gazans criticize Hamas for hiding the hostages in the heart of a civilian area\n\nA Gazan resident, not afraid to show his face, criticizes the leadership of Hamas for hiding the Israeli hostages in a densely populated area in Nuseirat - thereby causing the death of hundreds of civilians.\n\nAccording to him, hiding in such a way among civilians is un-Islamic, and un-patriotic.\n\nHe adds: \"This is not the way of the resistance... get us out of this nightmare... we are tired\""}, {"id": "1a3eab6d-4572-4315-93a2-204009b3adc0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28809/", "date": "2024-06-12 16:33", "message": "Gaza sources: Muhammad Nazmi Nassar, one of the founders of the military wing of Hamas in the West Bank, was killed in an Israeli attack in the Gaza Strip.\n\nNassar played a central role in the kidnapping and murder of the two soldiers Avi Sasportas and Ilan Saadon in 1989 and was an associate of Mahmoud al-Mabhouh, the senior in the military wing of Hamas who was killed in an operation attributed to a \"group of tennis players\" in Dubai in 2010.\n(Al-Mabhouh was also involved in the kidnapping and was killed in Dubai on the grounds of being Hamas's \"military procurement man\" abroad)."}, {"id": "679c8202-01e3-4577-a1a7-bda0453ff419", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28808/", "date": "2024-06-12 15:29", "message": "East Jerusalem Channels: An Israeli shot a Palestinian in the Old City of Jerusalem."}, {"id": "4faf7838-19b5-47de-ab62-f6f84bda73b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28806/", "date": "2024-06-12 15:28", "message": "US Secretary of State Blinken: \n\n\"Hamas could have responded to Biden's proposal with one word - yes.\nHamas demands changes to the proposal. Some of them can be accepted and some not.\" \n\nSenior Hamas official, Osama Hamdan, in response:\n\n\"The US Secretary of State Blinken is part of the problem and not part of the solution.\""}, {"id": "bedc1088-1489-4c16-b368-9ed1116977ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28804/", "date": "2024-06-12 14:23", "message": "The IDF accepts responsibility for the strike that killed Hezbollah senior operative Taleb Abdullah (this doesn't always happen-AA):\n\nIDF: The IDF struck a Hezbollah command and control center used to direct attacks from southeastern Lebanon and eliminated its commander, Sami Taleb Abdullah\n\nLast night (Tuesday), a Hezbollah command and control center in the area of Jouaiyya in southern Lebanon, which was used to direct terror attacks against Israeli territory from southeastern Lebanon in recent months, was struck by the IAF. As part of the strike, Sami Taleb Abdullah, the commander of the Nasr Unit in the Hezbollah terrorist organization, was eliminated. Sami Taleb Abdullah was one of Hezbollah's most senior commanders in southern Lebanon.\n\nFor many years, the terrorist planned, advanced, and carried out a large number of terror attacks against Israeli civilians. Three additional Hezbollah terrorist operatives were also eliminated in the strike."}, {"id": "170a7244-15c5-48ce-a8b3-09d5c98fecc8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28804/", "date": "2024-06-12 14:20", "message": "I wonder if they found his ring👆..."}, {"id": "e917e6d4-bc0e-414c-9efa-3f13adc6eb88", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28800/", "date": "2024-06-12 14:20", "message": "Hezbollah presents \"snapshots in the life\" of Taleb Abdullah, who was killed by the IDF last night:\nWith Qassem Soleimani (commander of the Quds force in the Iranian Revolutionary Guards who was eliminated in 2020)\nWith Esmail Qaani, who replaced Qassem Soleimani and... \nwatching over the territory of Israel (looking over Kiryat Shmona)."}, {"id": "29669b2a-1ae4-4afe-a1af-c3268a504a3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28799/", "date": "2024-06-12 14:17", "message": "The Shahab news agency (affiliated with Hamas) is advertising how desperate the residents of the northern Gaza Strip: all they have to eat is hummus and beans from cans, which they heat on a barbeque..."}, {"id": "b203f248-f812-4565-9de6-0e965608f193", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28798/", "date": "2024-06-12 14:16", "message": "Hashim Safi al-Din, number 2 in Hezbollah, at a ceremony in honor of the Hezbollah leader Taleb Abdullah, who was killed last night.\nThe ceremony was held in the Dahiyeh neighborhood of Beirut."}, {"id": "f7014642-a86e-44d0-93f0-0b83ca3b7b74", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28797/", "date": "2024-06-12 14:14", "message": "Hamas sends its condolences to Hezbollah, in an official announcement, following the assassination of senior leader Taleb Abdullah last night."}, {"id": "aa728148-de5e-4393-a26b-77804e5b9299", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28796/", "date": "2024-06-12 10:10", "message": "Hezbollah announces another death in its ranks:\n\nBehij Hegazi from the village of Hariss in southern Lebanon.\n\nHe was injured a few days ago in an IDF attack and died of his wounds today.\n\nNumber 344"}, {"id": "12cc1c1e-7ba9-4cd3-bfd2-542670796e19", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28795/", "date": "2024-06-12 10:09", "message": "IDF Spokesperson: Following the sirens that sounded in the area of Zar'it in northern Israel a short while ago, approximately 10 projectiles were identified crossing from Lebanon, a number of which were intercepted. No injuries were reported. IDF artillery struck the sources of the fire. \n\nFollowing the projectiles that were fired toward northern Israel earlier today, Israel Fire and Rescue Services are currently operating to extinguish the fires that broke out as a result of the launches. \nNo injuries were reported in the incidents.\n\nFollowing the sirens that sounded regarding a hostile aircraft infiltration in northern Israel, the details are under review. \n\nA short while ago, IAF fighter jets struck a launcher used to fire projectiles from the area of Hanine in southern Lebanon into northern Israel earlier today (Wednesday). Simultaneously, four terrorist infrastructure sites in the area of Yater, from which projectiles were fired at northern Israel, were also struck."}, {"id": "b8f960e0-5e9d-4278-8614-9535cfbfa0a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28794/", "date": "2024-06-12 10:07", "message": "Beirut: Preparations are being made for a ceremony in honor of Taleb Abdullah, the senior commander of Hezbollah that Israel killed last night."}, {"id": "04b789d8-37ac-47de-a417-3d61fb40c316", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28793/", "date": "2024-06-12 10:07", "message": "Since this morning, Hezbollah has accepted responsibility for 9 attacks against Israel, including 4 for the elimination of the senior officer yesterday in Jouaiyya. So far, according to Hezbollah's statement, they are:\n\n1. Attacking the Pelsan Lighting factory in Kibbutz Sasa with guided missiles\n2. Attacking a base of the Galilee Division in Ami'ad with dozens of Katyushas\n3. Attacking the air control unit base in Miron with dozens of Katyushas\n4. Attacking the Ein Zikim base with dozens of Katyushas"}, {"id": "226cfdff-75aa-4d85-8c9d-53a7f8a7bfd9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28792/", "date": "2024-06-12 10:04", "message": "Plan for \"the day after\" in Gaza:\nIsrael will give control of the Gaza Strip to the only supplier it will authorize to bring in cigarettes... he will have full control of the Gaza Strip!\n\nCigarettes are power and money in the Strip."}, {"id": "e311c39f-45f9-44f4-a504-f4e4d8394660", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28791/", "date": "2024-06-12 10:03", "message": "Meanwhile in Gaza... the price of a single cigarette reached 100 dollars!\n\nAccording to the sign in the picture, they started selling Karelia cigarettes by centimeters. You can buy less than a cigarette - the seller cuts them for you!"}, {"id": "0e4d8af6-ed8c-4829-bb2d-7f3390ce6863", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28789/", "date": "2024-06-12 10:02", "message": "Today at 6:00 PM, the funeral ceremony of the senior Hezbollah leader Taleb Abdullah, who was killed last night, will be held in Adachit, which is about 30 km from the Israeli border.\n\nI think Israel can afford a barrage of 100-200 stupid rockets to the funeral in his honor..."}, {"id": "ba846a18-502c-4e7c-abd8-f3ea441a7ff3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28788/", "date": "2024-06-12 07:23", "message": "Al Jazeera: 30 rockets were launched at the start of the hour from Lebanon towards the Upper Galilee."}, {"id": "269ef3b7-9b98-494e-888e-a5cc21d7a53f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28787/", "date": "2024-06-12 07:22", "message": "IDF: Following the sirens that sounded in northern Israel a short while ago, approximately 90 projectiles were identified crossing from Lebanon. A number of the projectiles were intercepted and others fell in several locations in northern Israel. As a result, fires broke out in a number of areas. The details are under review."}, {"id": "dee0b94d-6095-4ccf-a58e-9c7a2245d783", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28786/", "date": "2024-06-12 07:21", "message": "Palestinian channels publish a document in which they claim to of the arrest of about 200 of the men who sheltered at a school in the Jabaliya refugee camp in the north of the Gaza Strip, during the last activity of the IDF forces there on May 24 (about three weeks ago)."}, {"id": "eb1e238e-d915-44a1-b39f-384f00ac7737", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28785/", "date": "2024-06-12 07:20", "message": "According to the IDF radio, 100 rockets were launched from Lebanon towards the north, including towards Tiberias, where a red alert was sounded, about an hour ago.\n\nThe Lebanese Al Mayadeen envoy claims: more than 100 rockets were launched towards Israel.\n\nThis is the opening chord of Hezbollah's revenge for yesterday's assassination of the senior official in Jouaiyya."}, {"id": "c2f81325-3955-480a-9478-76c48958452b", "channel_id": 1560386984, "url": "", "date": "2024-06-12 07:17", "message": "Taleb Abdullah was the commander of one of the two units responsible for the management of the war in ​​southern Lebanon, from the Litani river to the border with Israel. It is considered to be the most significant arena for Hezbollah because it is where most of the attacks against Israel originate and this is the arena that will first meet any IDF ground troops if Israeli forces enter Lebanon. This is the area from which Israel aims to remove Hezbollah. Saying that he is the most senior person killed so far by Hezbollah in the war is certainly not mistaken.\n\nIn the attached photos we see Abdullah with Wissam al-Tawil (both in military uniforms and winter coats), the senior officer in the Radwan force who was eliminated a few months ago and the only one other than Abdullah who was named \"commander\" in Hezbollah's official statements. In the other photo, Abdullah is seen with Qassem Soleimani, commander of the Quds force in the Iranian Revolutionary Guards who was eliminated in 2020 by the Trump administration"}, {"id": "72749014-25a0-4c41-b6ce-8be5aa5dcf57", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28782/", "date": "2024-06-12 07:11", "message": "Hezbollah announced a short time ago in an official announcement about the death of\nالمجاهد القائد -\nThe Mujahid leader, or \"commanding fighter\" Taleb Abdullah - (Alhaj Abu Taleb).\n\"Commanding fighter\" is a unique title in Hezbollah. Hezbollah has used it so far in the war only when it mentioned the death of Wissam al-Tawil, the senior officer in the Radwan force whom the IDF eliminated a few months ago.\n\nIn other words, last night one of the two most senior officers killed by the IDF against Hezbollah in the war was eliminated, and some claim that the most senior.\n\nNumber 340"}]