[{"id": "47a80dc4-f500-4460-b8d3-08bad1c401f6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28065/", "date": "2024-05-29 14:40", "message": "Mexico: Additional documentation from the Israel Embassy area in Mexico City. The protesters against Israel threw Molotov cocktails."}, {"id": "62110c0d-2642-43e7-852e-b236e3c658c5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28064/", "date": "2024-05-29 14:15", "message": "Gaza channels: In the last day, for the first time since the beginning of the war, the muezzin was not heard in the city of Rafah."}, {"id": "e67f5f3e-7115-43c2-80ab-67cddb17cb67", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28060/", "date": "2024-05-29 13:23", "message": "More photos from the parliament in Brazil.\nThey are also from the account of the deputy ambassador of Israel in Brazil."}, {"id": "043f86b2-9c21-4761-aeb1-3ad4c7dd1d06", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28059/", "date": "2024-05-29 13:21", "message": "The move against Israel is led by the Brazilian president, Lula da Silva, known to be pro-Palestinian.\n\nAt the same time, an act of protest by members of the Brazilian parliament who sympathize with Israel and oppose the move by President da Silva.\n\nSource: the Twitter account of the deputy ambassador of Israel in Brazil\n\nhttps://x.com/GonenYonatan/status/1795235595347697836?t=TyvLY66wBMpUiuYulGfnWQ&s=19"}, {"id": "e14de0b1-ccdc-4561-ad27-ea06157b2d67", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28058/", "date": "2024-05-29 13:09", "message": "Foreign media: Brazil is calling back its ambassador from Israel."}, {"id": "4e8ebd86-8db3-4797-9fab-cf9197e7ff32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28055/", "date": "2024-05-29 13:08", "message": "North Korea's \"explosive balloons\"\n\nAfter we learned in recent years about the explosive balloons of the Gazans on the border fence, who learned how to make good use of the wind blowing from the direction of the sea towards the enclave, media in South Korea are reporting that the citizens of South Korea were \"victorious\" of an attack of excrement and garbage balloons sent to them from North Korea and exploded on the country's territory.\n\nThe North Koreans are \"taking revenge\" on leaflets that were dropped from the air on their territory by South Korea, with messages undermining the North Korean government.\n\n##\nIntelligence sources know how to report information exchanges between North Korea and Hamas in Gaza 😂"}, {"id": "1023df39-9b8d-46f7-8d2a-e2528caa39c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28054/", "date": "2024-05-29 13:06", "message": "The new Iranian Foreign Minister, Ali Bagheri Kani (acting in place of the minister who was killed in the helicopter crash) clarifies that the functional sequence in the Foreign Ministry continues despite the minister's death:\n\nThe exchange of messages between the US and Iran continues continuously as before."}, {"id": "f766ec4d-ce85-4a1f-a77c-e9f0018ad894", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28053/", "date": "2024-05-29 13:05", "message": "A video produced by Hamas in Gaza, for comparison."}, {"id": "f14060c5-af0d-4026-9f19-9970f370b0a9", "channel_id": 1560386984, "url": "", "date": "2024-05-29 13:04", "message": "This is a video that was released this morning by an organization affiliated with Hamas in Tulkarm. It shows shooting at the settlement of Bat Hefer.\n\nThe main and official channel of the military arm of Hamas did not publish the video and the attempt to imitate the Gaza Hamas videos seems relatively amateur (I will share an official Hamas video for comparison).\n\nThis indicates, at the very least, that the relationship between Hamas in Gaza, which produces professional videos, and the same organization in Tulkarm is not strong at this time (it can be estimated that elimination of Hamas officials of the West Bank HQ in Gaza is doing its part). The organization in Tulkarm could have used professionals to get a better product but chose to continue independently...\nThe main shortcomings in the Tulkarm video that I noticed:\n1. General quality - shooting and editing at a low level\n2. Black border too wide\n3. The red triangle is not the same one of the Hamas videos\n4. The date is displayed different by Hamas in Gaza"}, {"id": "7430f5c7-cd3f-4705-ac40-bd4b524746f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28049/", "date": "2024-05-29 11:44", "message": "Sources associated with the Shiite axis claim that the Houthis in Yemen managed to shoot down an advanced American MQ9 UAV in the Marib area.\n\nAccording to its body, which is relatively complete, it can be estimated that it made an emergency landing.\nThe Houthis will soon provide an \"official announcement\".\n\nThis is the third MQ9 type UAV that the US has been lost in recent weeks in Yemen.\nThe cost of each unit is about 30 million dollars."}, {"id": "562da1c1-eed9-44df-9cca-a102dcfed5d4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28048/", "date": "2024-05-29 11:37", "message": "The Spanish Foreign Minister: What the Palestinian prisoners are going through in Israeli prisons is unacceptable!\n\n##\nAnd what do you say about what the abductees are going through in Gaza, Mr. Minister? And they were not convicted of terrorism."}, {"id": "7d30dd31-4fe0-4859-993a-56f639bba679", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28047/", "date": "2024-05-29 11:36", "message": "Gazan journalists:\nCommunication services (internet and phone) are not active all over Rafah."}, {"id": "55b63dbc-9c96-4c70-8e22-962766071a0c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28046/", "date": "2024-05-29 11:36", "message": "Reuters from the head of the National Assembly, Tzachi Hanegbi:\nIsrael controls 75% of the Philadelphia axis."}, {"id": "d53e9a07-d688-4534-a66b-9fca68105552", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28045/", "date": "2024-05-29 11:34", "message": "Anti-Israel demonstration at the University of Manchester in England.\nThe signs read: Palestine will be free from the river to the sea."}, {"id": "74ea525e-f3a5-4bdf-89ea-2144eb4f73df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28044/", "date": "2024-05-29 11:33", "message": "Follower D. photographed and shared the new status of the floating American pier: in Ashdod, on wheels."}, {"id": "ba090129-5c71-41da-b86d-bd712e4cf8cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28043/", "date": "2024-05-29 09:46", "message": "The nature of IDF activity in Rafah - according to Palestinian reports\n\nGazan sources report that IDF tanks are seen regularly in the neighborhoods of A-Salam, Barazil and Yabneh (these are the southern neighborhoods of Rafah that are adjacent to the blue line below parallel to the border with Egypt - the Philadelphia axis).\n\nFrom the staging points of the tanks in these neighborhoods, the tanks go on raids to the north, as indicated by the arrows, along the entire length of the line from the Salah al-Din crossing area (the former goods crossing), in the east, to the Tal al-Sultan neighborhood, in the west - (which is the main neighborhood where Hamas is located in west Rafah) ."}, {"id": "178adce8-62b7-4658-9e01-df52cd22b154", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28042/", "date": "2024-05-29 09:41", "message": "The IDF spokesperson announced the death of three soldiers of the 50th Battalion of the Nahal Brigade in a battle in the southern Gaza Strip.\n\nMay their memories be a blessing."}, {"id": "b4580049-151c-426b-a48e-7ad443f92d69", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28040/", "date": "2024-05-29 07:35", "message": "You can do an interesting anthropological study on the population in Britain using the attached video.\nPolite British police officers are trying to deal with an anti-Israel demonstration in London, and in the background, alongside the Arabs participating in the demonstration, there are also British citizens who convince themselves using mantras:\nI believe that we will win."}, {"id": "128592a6-e9cb-4c66-a021-41ae6876fafd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28037/", "date": "2024-05-29 07:09", "message": "Rafah: The movement of Gazans, yesterday and today from the west of Rafah (Tal a-Sultan area), north towards Khan Yunis, following the expansion of the IDF's operation to the west of Rafah."}, {"id": "25fb6e27-6927-457d-bd56-285f902045d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28036/", "date": "2024-05-29 07:09", "message": "The Palestinians report that Israel killed amid (brigadier general) Salameh Barakeh, who was in charge of supplies and training in the Hamas police.\nHe was killed in an attack on the house of the Abu Jazer family in the Ma'an area in eastern Khan Yunis in the southern Gaza Strip."}, {"id": "121d6678-8b1d-4df6-a753-6761997d0990", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28035/", "date": "2024-05-29 06:34", "message": "A popular video on Palestinian channels - documentation of the extensive destruction left in the Faluja area in the Jabaliya refugee camp in the north of the Gaza Strip, after the IDF's operation there."}, {"id": "ec6fa059-532b-4b43-aafc-8d2c3055be1d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28034/", "date": "2024-05-29 06:33", "message": "Sources affiliated with Fatah: Hamas is eliminating anyone who dares to go against it in the Gaza Strip and publicly claims that it eliminated those people on the charge of \"theft\".\n\nAttacking thieves is met with tolerance (and even encouragement) by large sections of the Gazan public. This is also the case with the videos that are distributed from time to time in which alleged thieves are seen after being shot by Hamas masked men and left to wallow in their blood."}, {"id": "ca791167-93b4-4868-a888-469a163f4da1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28033/", "date": "2024-05-29 06:30", "message": "The US Central Command announced that the Houthis, loyal to Iran in Yemen, launched 5 missiles at a Greek-owned merchant ship yesterday.\nAccording to the report, 3 of the 5 missiles hit the ship, but it continued on its way.\nThere were no casualties in this attack."}, {"id": "f1f85f0f-40c8-4ecf-a0ae-34bd954e8011", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28032/", "date": "2024-05-29 06:27", "message": "More on the same issue: Algeria will today submit an outline for a proposed resolution in the UN Security Council that will call for the cessation of Israeli military action in Rafah.\n\n##\nThe ball regarding the UN Security Council is now in the Americans' hands.\n\nThe absurdity of the Israeli operation in Rafah is that it is the ground operation with the lowest number of casualties so far in the war."}, {"id": "355bd616-6228-44f8-a499-3f4510ac4101", "channel_id": 1560386984, "url": "", "date": "2024-05-29 06:25", "message": "\"Rafah effect\" - anti-Israeli protests in Europe and Mexico\n\nPerhaps following the (late) official Israeli response and perhaps following Israel's initial admission that this was a \"tragic mistake\" (a statement attributed to Prime Minister Netanyahu in Haaretz) and certainly because of the well-oiled propaganda and lying machine of Hamas - crowds took to the streets in several European countries to demonstrate against Israel.\n\nAttached:\n1. Republic Square in Paris (France)\n2. Attempt to reach the Israeli Embassy in Paris\n3 London\n4. Bologna, Italy\n5. Attempt to break into the Israeli embassy in Mexico City\n\nThere were more.\n\nThis is an excellent example of how Israel has not yet learned to find the right way to deal with the Palestinian lies about \"massacre events\" on a large scale.\nTime after time the Palestinians immediately accuse Israel of terrible acts. Israel quickly apologizes, wasting valuable time until it issues an official response - and is forced to absorb the fire.\n\n\"Muhammed al-Durrah\" effect."}]