[{"id": "988e0c27-a1cb-4772-81a0-aa23fba42cc1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26933/", "date": "2024-05-08 19:12", "message": "Hezbollah announced another death in its ranks:\n\nMustafa Issa from the Beqqa area in eastern Lebanon\n\nNumber 293"}, {"id": "afad6e96-1071-4ecf-8923-048cdfe34880", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26932/", "date": "2024-05-08 19:11", "message": "Sources associated with the Shiite axis claim that today Israel dropped a unique bomb in an attack on a Kafrkela in southern Lebanon that has not yet been used in that arena and aims to penetrate deep and hit a protected underground target (e.g. a bunker).\nAccording to these sources, Israel used a GBU 10 bomb or a Spice 2000 bomb.\nAccording to these sources, the effect of the bomb was different and unique from other bombs."}, {"id": "3f5df747-3e1c-4b8c-bc97-e255a97e7699", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26929/", "date": "2024-05-08 19:09", "message": "Following the report on the 3 deaths from the IDF attack in Khiam in southern Lebanon 👆 the military wing of the Islamic Jihad announces that 3 of its men, from the Syrian branch, were killed in southern Lebanon.\n\nThe three are:\nMahmoud Blaoni\nAhmed Halawa\nMuhammad Jud\n\n##\nAlmost two weeks since Hezbollah announced the death of any of its people."}, {"id": "9ade3182-e7a8-436d-8f4e-70231b80218a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26928/", "date": "2024-05-08 18:17", "message": "Egypt: The Egyptian organization that had accepted responsibility for the murder of an Israeli tourist in Alexandria yesterday publishes the video of the attack in which the shooting itself is seen from close range.\n\nThe video is difficult to watch and I will not post it."}, {"id": "6e95e429-f2fe-4a44-99f5-93494a499d50", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26927/", "date": "2024-05-08 18:16", "message": "Hezbollah announces a death in its ranks:\n\nHasan Ismail, from Kfarkela in southern Lebanon.\n\nThis is the first Hezbollah casualties in a few weeks now (the previous one was announced on May 1st but was injured in an attack carried out at least 4 days earlier).\n\nIn the last couple of weeks, Israel suffered more deaths than Hezbollah in the northern sector.\n\nNumber 292."}, {"id": "c12bbe7a-4c2f-4104-a7ba-1f5797eb1f30", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26926/", "date": "2024-05-08 18:15", "message": "Footage that has been posted on Palestinian channels, which they claim shows a missile being launched from an Israeli combat helicopter at a target in the Tel Al-Sultan area in West Rafah."}, {"id": "5b2daf15-f096-47e9-99d9-6bf66091f5af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26925/", "date": "2024-05-08 17:20", "message": "Palestinian sources: For the first time since the beginning of the ground operation in East Rafah, IDF shells landed in Tal al-Sultan in West Rafah."}, {"id": "393772b1-db7c-462a-8853-b8c31739b3c8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26924/", "date": "2024-05-08 16:58", "message": "Sources associated with the Shia axis claim that this may be the type of attack drone reported by Hezbollah."}, {"id": "658892a1-bf6b-4075-b339-c444aca5763c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26923/", "date": "2024-05-08 16:57", "message": "Hezbollah announces its 11th attack for today:\nWe attacked an IDF technical facility that was recently stationed at the Al 'Azi outpost using an attack drone (probably FPV - AA)."}, {"id": "44c8e76b-5946-43a3-a864-d82438d8fa24", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb66329/", "date": "2024-05-08 16:51", "message": "Joint statement by the IDF and the Shin Bet: The IDF and ISA eliminated the Commander of Hamas' Naval Unit in Gaza City\n\nIn a joint IDF and ISA activity based on Israeli Navy and ISA intelligence, an IAF aircraft eliminated the terrorist Ahmed Ali, the Commander of Hamas' Naval Unit in Gaza City, in the past day. Over the last few years, Ali has been involved in managing projects of Hamas' Naval Unit in the Gaza Strip. \n\nDuring the war, Ali was responsible for attacks on Israeli territory and against IDF ground troops operating in the Gaza Strip. Over the past week, Ahmed advanced terrorist activities against IDF troops operating in central Gaza."}, {"id": "c2139925-6413-4441-b7fc-b46c356e9376", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26921/", "date": "2024-05-08 16:49", "message": "Lebanese channels: an extremely quiet Israeli drone was spotted over the Port of Tyre."}, {"id": "a1934828-23bd-4a94-8e14-fce1c99daf2d", "channel_id": 1560386984, "url": "", "date": "2024-05-08 16:49", "message": "Rafah: The Palestinians report that the IDF fired shells at the buildings near A-Najma Square in the center of Rafah (a central square in the city)."}, {"id": "87d07a20-1ba6-44c9-b0c7-b505bc098a2b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26918/", "date": "2024-05-08 15:45", "message": "After the American statements and actions, the close adviser of the chairman of the political bureau of Hamas, Taher Nuno, hardens his positions:\n\nHamas is ready to discuss only the proposal it agreed to accept and not any other proposal.\n\nHamas is ready to continue the conflict as long as necessary.\n\nAs far as the \"resistance\" is concerned, the chance that the occupation will remain in the Gaza Strip is zero.\n\n##\nThe US, maliciously or out of a misunderstanding of the Middle East, strengthens Hamas, weakens Israel and with its own hands removes the possibility of ending the war."}, {"id": "19c2c56c-2d3d-41d1-ace3-e403f9b067b5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26917/", "date": "2024-05-08 15:43", "message": "Correction: This👆 is an announcement by the US Secretary of Defense and not the US Secretary of State as written before."}, {"id": "b328d54c-f395-4618-989a-6115026f68b5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26916/", "date": "2024-05-08 15:43", "message": "The Palestinians report 10 dead in an Israeli attack on a-Shweiki dental clinic in a-Shawa Square in Gaza City."}, {"id": "f2df21f1-086f-4758-ab62-3cefd9407101", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26915/", "date": "2024-05-08 15:18", "message": "The US Secretary of State publicly announces:\n\nWe froze one arms shipment to Israel in light of the operation in Rafah.\nWe are currently looking at additional deliveries against the backgdrop of the current operation in Rafah.\nIsrael must not carry out an operation in Rafah without a plan that takes into account the safety of the citizens in Rafah.\n\n##\nThe damage the American administration is doing to Israeli deterrence and the power it is giving to Hamas and Israel's other enemies is unfathomable.\nIsrael has been left to her fate."}, {"id": "b27dcfa4-1849-4280-ac31-51355e54f79b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26914/", "date": "2024-05-08 14:50", "message": "Channels associated with the Iranian Revolutionary Guards: The Syrian army received from Iran a shipment of Iranian-made \"Toophan\" anti-tank missiles whose development is based on an American anti-tank missile."}, {"id": "f663aa94-7cb6-48bc-a3ca-2b4f0725846f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26913/", "date": "2024-05-08 14:39", "message": "Washington police arrested 33 people while dispersing an anti-Israel demonstration at George Washington University. Tear gas was used."}, {"id": "06157bd0-9c4b-4828-9c21-d9ebddb3d40a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26912/", "date": "2024-05-08 14:30", "message": "Since noon until now, Hezbollah has claimed responsibility for 9 attacks on Israeli territory, the latest of which was the launch of Barkhan rockets at the headquarters of the 91st Division in Biranit. Hezbollah also accepted responsibility for launching suicide drones, guided missiles and rockets."}, {"id": "d235d8f3-f44a-471e-827e-5e3f163d6eaf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26912/", "date": "2024-05-08 14:29", "message": "Unofficial Lebanese channels: Casualties in the IDF attack on a building in the village of Adissah in southern Lebanon about an hour ago."}, {"id": "0236db71-edf3-4687-97d6-ad701d8d6266", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26910/", "date": "2024-05-08 14:28", "message": "Unofficial Lebanese sources: 3 killed in an IDF attack in Khiam in southern Lebanon."}, {"id": "3de34b49-a3f2-4e23-a2ac-cb26419471b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26909/", "date": "2024-05-08 14:28", "message": "Palestinian channels: IDF soldiers blew up the Abu Jarad gas station in East Rafah in the southern Gaza Strip."}, {"id": "b8a14bbe-def5-4e60-8570-d4e1a3939d42", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26908/", "date": "2024-05-08 14:11", "message": "Al Istiqamah Mosque Street in the Jeninah neighborhood in East Rafah - one of the busiest areas in Rafah until three days ago, now looks like a ghost town following the IDF-ordered evacuation."}, {"id": "e0f38446-cc8a-48f3-be8d-b2cbfb6967b0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26907/", "date": "2024-05-08 13:48", "message": "Video documentation of the firing of phosphorus bombs (according to the Lebanese) towards Belida in southern Lebanon."}, {"id": "e9f3ed07-78ce-419e-a6ea-1828a9d50bc9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26906/", "date": "2024-05-08 13:04", "message": "Reuters from an Israeli source: There is no breakthrough in the talks for a hudna in Cairo."}, {"id": "630ca9c8-8fa1-4028-a539-10164a3e87ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26905/", "date": "2024-05-08 12:47", "message": "On the occasion of the reopening under American pressure this morning:\nThe military arm of Hamas accepted responsibility a short time ago for launching 114 mm \"Rajum\" rockets towards the Kerem Shalom crossing."}, {"id": "6184f0ec-dc94-4ebc-8165-2d71effbfeaf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26904/", "date": "2024-05-08 12:47", "message": "The Lebanese Al Mayadeen a short time ago:\nHezbollah carried out a combined attack of rockets (and/or missiles) and UAVs against targets in the Upper Galilee and the Western Galilee."}, {"id": "039755a1-ebfc-41cf-9db6-898336dd75f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26903/", "date": "2024-05-08 12:46", "message": "Police spokesperson:\n\nCleared for publication: The Israel Police and the Border Guard announce with great sorrow and grief the death of Commander Yitav Lev Halevi, late commander and fighter in the Israeli Defense Forces, who was mortally wounded in an operational activity in Tulkarm.\n\nThe late Yitav Lev was critically evacuated to the Beilinson Hospital, where he fought for his life the last few days.\n\nMay his memory be a blessing."}, {"id": "5a4eecbc-065c-4878-a6df-4cf59983b158", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb66306/", "date": "2024-05-08 12:39", "message": "Reporter of the Lebanese Almanar channel: Israel fires phosphorus bombs at the village of Belida in southern Lebanon."}, {"id": "104aecdb-1106-4bbc-b8b8-2851a52b9a26", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26899/", "date": "2024-05-08 12:12", "message": "Unofficial media in Lebanon are reporting casualties in an IDF attack in thr Khiam region of southern Lebanon in the last hour."}, {"id": "0c5befee-ad52-4503-92ae-f7418fd40fb4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26898/", "date": "2024-05-08 12:12", "message": "The IDF spokesperson published documentation of the activities of the 401st Brigade fighters in East Rafah.\n\nAccording to the IDF spokesman 100 terrorist targets were attacked throughout the Gaza Strip in the past day.\n\nThe Palestinians report 35 dead who arrived at Rafah hospitals in the past day."}, {"id": "dd18ca6e-160c-4ca7-b30d-bbb7542dccef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26894/", "date": "2024-05-08 12:11", "message": "The emergency committee of the Beit Lahia municipality in the north of the Gaza Strip has begun to assemble solar-powered street lights."}, {"id": "5fd7a335-773e-4a58-a256-624c84cc3393", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26893/", "date": "2024-05-08 12:02", "message": "CNN network:\n50,000 Palestinians left Rafah for Khan Yunis and Moasi in the last 48 hours."}, {"id": "cbeea820-0dea-4bb7-8192-5d83645465e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26892/", "date": "2024-05-08 11:59", "message": "New York police officers have to deal with this as well:\nScreaming young women, supporters of Hamas, with kaffiyehs teasing the American police while \"armed with American freedom of speech\" and using their phone cameras as a \"shield\".\n\n##\nThe American cops are starting to find out what they're dealing with... Maybe they should come for training with the police in the Old City of Jerusalem?"}, {"id": "42bdc87c-9511-4b24-bf72-a9e32704a6aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26891/", "date": "2024-05-08 11:52", "message": "Also from the streets of New York - a red smoke grenade waved by an man wearing a headband of the terrorist organization the Popular Front for the Liberation of Palestine (which is behind the assassination of Minister Ze'evi and behind the hijacking of planes around the world in the 1960s and 70s)."}, {"id": "43dcc204-8115-49a3-970c-9521be47bd2a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26890/", "date": "2024-05-08 11:50", "message": "New York: Hamas supporters wearing kefiyyehs vandalize a New York police vehicle."}, {"id": "f75542c2-85ef-4be6-9207-6eb771b5d9d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26887/", "date": "2024-05-08 11:49", "message": "A reporter for the Lebanese Almanar channel reports on 10 attacks by the IDF in the area of ​​Ayta ash Shaab and Ramiyeh in southern Lebanon earlier today."}, {"id": "2ccdaf4e-3afe-43b9-8f9f-4627e7f61a0a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26886/", "date": "2024-05-08 11:48", "message": "To comment, follow this link"}, {"id": "c7597dc4-7d04-4b18-9b85-fa77b9890159", "channel_id": 1560386984, "url": "", "date": "2024-05-08 11:48", "message": "Istanbul, Turkey: A FedEx Boeing 767 cargo plane lands on its nose... after a malfunction in opening the wheels."}, {"id": "f3b1881a-5cfd-44c1-a145-54720d63de9c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26881/", "date": "2024-05-08 11:41", "message": "The evacuation of the Gazans from Rafah towards Khan Yunis continues."}, {"id": "cb41e262-56d9-44bd-989e-efc8591315c6", "channel_id": 1560386984, "url": "", "date": "2024-05-08 11:41", "message": "Some of the Gazans who were evacuated from Rafah chose to flee beyond Khan Yunis and settled in the camp area of ​​the center of the Gaza Strip.\nWhat will happen to them when Israel wants to complete the operation in Nuseirat and Deir al-Balah?"}, {"id": "238d8bb1-0622-47d8-801f-4a356fc34668", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26875/", "date": "2024-05-08 07:14", "message": "The spokesperson for the Israeli Coordinator of Government Activities in the Territories:\n\nIn accordance with the directive of the Israeli government, the Kerem Shalom crossing was opened this morning for the entry of humanitarian aid into the Gaza Strip.\n\nWe emphasize that all humanitarian aid comes in after a careful security check by Land Crossings Authority security guards at the Ministry of Defense.\n\n\n###\nThe Biden administration is tying Israel's hands and preventing it from defeating Hamas.\n\nStrong American pressure on all fronts."}, {"id": "ca218bd0-bd5b-4cab-989f-09beb5d0ad87", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26874/", "date": "2024-05-08 06:10", "message": "The Palestinian Authority this morning:\n\nThe Kerem Shalom crossing is still closed.\nThe Rafah crossing is closed to Palestinian passengers for the second day in a row."}, {"id": "3d6f291a-760d-4c15-a5a8-8ab8c87e8a7f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26874/", "date": "2024-05-08 06:10", "message": "IDF activity in the Gaza Strip\n\nDuring last night night and in the early hours of the morning, the IDF continued with airstrikes in Rafah, which resulted in almost no casualties.\n\nThe most \"significant\" attack in terms of casualties last night was in the Zaytoun neighborhood in Gaza City, where seven members of the A-Loh family were killed.\n\nIn the Rafah sector, two casualties were reported last night from an Israeli attack.\n\nThere are no Palestinian reports of ground movement of the maneuvering forces in Rafah.\n\n##\nAmerica's influence is evident... Currently, according to the Palestinian reports on the IDF's activity in the Rafah sector, there does not seem to be any significant movement of forces operating in this area."}, {"id": "b3e82593-18f8-4f8c-abd8-a76c75420060", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26871/", "date": "2024-05-08 06:06", "message": "Egypt: The newly-formed organization named after the Egyptian policeman Muhammad Salah, which accepted responsibility for the murder of the Israeli tourist yesterday in Egypt, published a photo, which looks like a frame taken from a video, allegedly showing the moment of the murder of the Israeli tourist (I blurred out the photo - AA).\n\nThe caption on the picture reads \"Hello from the children of Gaza\"."}]