[{"id": "d9d53503-b333-49ba-b75f-c43cae3a39a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32597/", "date": "2024-08-17 18:05", "message": "Lebanese sources report three people wounded in the IDF attack on the village of Markaba and four people wounded in the IDF attack on the village of a-Dhayra this evening, near the border with Israel in southern Lebanon."}, {"id": "8ac877a1-f181-447a-a275-74a317154a4a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32592/", "date": "2024-08-17 17:55", "message": "The IDF attacked the al-Nasira building in Nuseirat in the center of the Gaza Strip, after issuing an evacuation warning to its residents."}, {"id": "ee733a4b-9e60-483e-9386-960a028aa386", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32591/", "date": "2024-08-17 17:52", "message": "The IDF announces the death of one of its soldiers, Major Yotam Itzhak Peled, 34, from Rosh Ha'ayin, a company commander, who fell during combat in the center of the Gaza Strip.\n\nMay his memory be a blessing."}, {"id": "4647054a-591b-4f74-8c95-9f8400e7bf99", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32586", "date": "2024-08-17 17:49", "message": "Displaced Gazans leaving the al-Maghazi \"refugee camp\" in the center of the Gaza Strip (following instructions from in Arabic by the IDF spokesman to evacuate) are doing \"V signs\" with their hands for the camera.\n\nA UN vehicle is being used for transport.\n\nFrom victory to victory.... :)"}, {"id": "813b163c-bd73-4d4d-82f3-a605add78b31", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73452/", "date": "2024-08-17 17:45", "message": "Palestinian channels are reporting a short time ago that the IDF is again attacking buildings in the Hamad neighborhood in the northwest of Khan Yunis."}, {"id": "68825e76-425d-4b0c-b580-e6c7eff00c66", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32584/", "date": "2024-08-17 15:49", "message": "Hezbollah announces a death in its ranks:\n\nHussein Kasseb.\n\nHe was killed in a drone attack on his motorcycle in Kadmous 👆\n\nAccording to the IDF spokesman, he is a commander in Hezbollah's Rachwan force.\n\nA Hezbollah's opponents wrote on social media that the IDF changed his status from Hassin Kasseb to Hussein Kebab..."}, {"id": "df897e35-0b55-4fac-bccb-fd7ac3d6a1d6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32583/", "date": "2024-08-17 15:46", "message": "Palestinian channels report that the IDF continued attacking residential buildings in the Hamad neighborhood in the northwest of Khan Yunis (south of the Gaza Strip) this afternoon."}, {"id": "3755a274-5261-47bd-9603-04e11871f554", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32582/", "date": "2024-08-17 13:27", "message": "The Lebanese Electricity Company: The supply of electricity to the national grid was stopped all over Lebanon, including to the airport, the port of Beirut, the water pumps, etc.\nThe reason: the last production unit at the Zahrani power plant stopped operating due to a lack of fuel.\n\n##\nI will point out that these days there are only about four hours of electricity a day in the national grid in Lebanon and many in Lebanon rely on private generators and solar panels."}, {"id": "cc8a36a0-a097-4ebf-93de-45140835e940", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32581/", "date": "2024-08-17 13:05", "message": "IDF: Earlier today, the IAF struck and eliminated the terrorist Hussein Ibrahim Kasseb, a commander in Hezbollah's Radwan Force, in the area of Tyre.\n\n##\nIt can be assumed that this is the attack in Kadmous earlier today"}, {"id": "6fe16f9a-828f-43a5-8cdc-cfc12a2cfb49", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32573/", "date": "2024-08-17 11:25", "message": "Al Maghazi exodus"}, {"id": "fa9cecd8-8445-4404-b411-d966d6b43f5c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32571/", "date": "2024-08-17 11:24", "message": "Gazans are evacuating from the Maghazi refugee camp in the center of the Gaza Strip following the instructions of the IDF spokesman.\n\nGaza sources are reporting in the last hour that gangs of thieves were caught breaking into the apartments of residents who were evacuating for the first time from their homes in the Maghazi refugee camp.\nThe apartments are still \"full of good things\" because this is the first evacuation of this area, where the IDF has yet to maneuver - a paradise for thieves in the Strip."}, {"id": "68939086-0ccc-4397-9dc0-bac25d7a2dd8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32570/", "date": "2024-08-17 11:23", "message": "Senior Hamas official, Sami Abu Zahari, in a statement to the French news agency:\nBiden's words that we are close to a ceasefire agreement are an illusion."}, {"id": "ec377930-da29-48fd-a46b-6f7e926792c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32569/", "date": "2024-08-17 11:23", "message": "IDF: Following the sirens that sounded a short while ago in the area of Ayelet HaShahar in northern Israel, approximately 55 projectiles were identified crossing from Lebanon, some of which fell in open areas. No injuries were reported. As a result of the projectiles fired into Israel, multiple fires were ignited in the area and Israel Fire and Rescue Services are currently operating at the scene to extinguish them. \n\nEarlier today (Saturday), an IDF soldier was severely injured and another soldier was lightly injured this morning as a result of a projectile that crossed from Lebanon and fell in the area of Misgav Am. The soldiers were evacuated to a hospital for medical treatment and their families have been notified."}, {"id": "bf348af3-2fd8-4b71-ad70-8d7de0abac44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32568/", "date": "2024-08-17 11:23", "message": "Lebanese channels report one dead in an Israeli UAV attack on a motorcycle in the Kadmous area in North Tyre, in South Lebanon."}, {"id": "791ff009-93d0-4bcb-9505-dc6aa2b01973", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32567/", "date": "2024-08-17 11:21", "message": "Around noon the Lebanese Al Mayadeen: More than 40 rockets were launched from Lebanon towards the Galilee in two volleys.\n\nHezbollah in an official announcement:\nToday, for the first time, we launched rockets at Kibbutz Ayelet HaShachar in response to last night's attack on Wadi el Kfour (in Nabatieh)."}, {"id": "e57e5d11-7e59-491f-8db2-f5e24bb6c853", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32566/", "date": "2024-08-17 11:19", "message": "North of the Gaza Strip, one of the Gazans wrote sarcastically:\n\nThe bodies of the Gazan martyrs do not rot as is the case with ordinary people because of the high amount of preservatives in their bodies - as a result of the diet based on cans from the humanitarian aid."}, {"id": "fa53be48-71d7-4a02-bbdb-ae91f7007e6e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32565/", "date": "2024-08-17 11:17", "message": "China has decided to ban the export of the chemical element metallic antimony outside of China for reasons of national security.\n\nThe antimony, which causes the hardening of metal alloys, is an essential element in the military industries and is used for a wide variety of military applications: night vision equipment, explosive compounds, lights, infrared sensors and... nuclear weapons.\n\nAlthough China holds \"only\" 32% of the world's antimony reserves, 80% of all global antimony processing takes place in China.\nThis is a blow to the American military industry."}, {"id": "ac9eb254-2cf7-432e-8663-8e60a25270ce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32564/", "date": "2024-08-17 11:17", "message": "Chinese military spokesman:\nThe US is the biggest nuclear threat to the world.\n\nHis words are said against the background of the statement of the American Secretary of Defense regarding the need to deepen the deterrence against the Chinese nuclear weapons arsenal."}, {"id": "b30e5108-4a68-4278-acb0-d23102673325", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32563/", "date": "2024-08-17 11:16", "message": "The President of Iran: The US is at the forefront of threats to our country. We can deal with it."}, {"id": "00bf3966-8220-4e88-b33e-d422449b4265", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32562/", "date": "2024-08-17 06:30", "message": "Muhammad bin Zayed, the ruler of the United Arab Emirates came to demand the safety of the prime minister of the Taliban (Afghanistan) who is hospitalized in one of the hospitals in Abu Dhabi (United Arab Emirates)."}, {"id": "e22b3458-5c1f-453f-929f-231f3285fe5c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32558/", "date": "2024-08-17 06:29", "message": "The Palestinians report 15 deaths tonight in an attack on a shed belonging to the al-Ajala family in the a-Zuwayda area in the center of the Gaza Strip.\n\nAmong the dead, the father of the family, Sami al-Ajala."}, {"id": "c8489c61-eb9e-4c77-812d-c3d7bddbf547", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32557/", "date": "2024-08-17 06:27", "message": "The area that was attacked in Nabatieh in southern Lebanon as it appears this morning."}, {"id": "7c0af756-6ec4-4a7e-854e-f86e3bf592cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32556/", "date": "2024-08-17 06:26", "message": "The Lebanese Almanar channel (affiliated with Hezbollah):\n10 dead, including children and 3 seriously injured in an Israeli attack in the Wadi al Kfour area in Nabatieh in southern Lebanon.\n\n##\nAccording to other Lebanese sources, a \"factory\" was attacked and Syrian refugees are among the dead.\n\n##\nAccording to the IDF spokesman, a Hezbollah ammunition depot was attacked in Nabatieh."}, {"id": "cc79c03b-425a-4a75-a268-58f25a2da541", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32555/", "date": "2024-08-17 06:24", "message": "A short time ago, the IDF spokesman in Arabic published another evacuation notice, this time for the residents of the Maghazi refugee camp in the center of the Gaza Strip, as marked on the map.\nThis is an area that has not been cleared before.\n\nThe pressure is increasing on the residents of the center of the Gaza Strip - in areas that the IDF has not yet maneuvered in since the beginning of the war."}, {"id": "cb8493ef-effe-4489-b504-fdc904992592", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32554/", "date": "2024-08-17 06:23", "message": "The Palestinian Ministry of Health in Gaza: The first confirmed case of polio has been located in the Gaza Strip.\n\n##\nHow convenient for them this publication, at this time, a day after the UN called for a one-week ceasefire to vaccinate 640,000 Gazan children and after Hamas joined the call. Coincidence?"}, {"id": "9195f5bc-9c25-45f2-be9c-51a5dd5fbfdd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32553/", "date": "2024-08-17 06:23", "message": "President Biden: I spoke with the ruler of Qatar and the Egyptian president about the great progress made in the Doha talks over the past two days.\n\nI am optimistic about reaching a ceasefire agreement in Gaza. We have an opportunity."}]