[{"id": "250ed145-4f60-4009-a7df-52ec484c4508", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32976/", "date": "2024-08-23 18:55", "message": "South Iceland: The Sundhnúkur volcano, near the town of Grindavik, erupted in recent days."}, {"id": "4bdee889-ed03-414a-8d28-d4e60ed91799", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32975/", "date": "2024-08-23 18:54", "message": "Bangladesh - Floods have caused damage to three million people. \n\nIn Bangladesh, they blamed neighboring India for the floods. According to them, India opened a dam that caused the floods.\n\nIndia denies the allegations and states that the floods are a result of heavy rains."}, {"id": "93e660aa-1a3b-430d-879a-6de2cdd56c4a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32974/", "date": "2024-08-23 18:52", "message": "The IDF spokesperson reports that Saeed Diab, a terrorist in Hezbollah’s rocket and missile array, was the one eliminated in the vehicle attack in Tyre.\n\nThis is the terrorist 👆 who was traveling in the car with the sunroof and leather seats."}, {"id": "f68fc64d-b6b5-429c-937a-3d13b4507c14", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32973/", "date": "2024-08-23 18:30", "message": "Syria: the first moments of the attack on the Center for Scientific Research in the Maarin area in southern Hama."}, {"id": "a2b89ff9-a6a4-46e5-8e50-e0d14f866e8e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32972/", "date": "2024-08-23 18:23", "message": "Syrian sources associated with the Assad regime:\nThe attack was carried out by Israeli warplanes from the airspace of Lebanon.\n\nIn the video, according to these sources, you can see one of the planes that carried out the attack."}, {"id": "2207f845-a2a0-41c0-944e-c9b899a0e61f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32972/", "date": "2024-08-23 18:19", "message": "The attack in Syria\n\nSyrian opposition sources claim that the IDF attacked positions of pro-Iranian militias at the Scientific Studies and Research Center in the Maarin area in southern Hama.\nAdditionally, warehouses of the 47th Brigade of the 11th Division in the Syrian army and the Al-Bitra College west of the village of Khatab in northern Hama were also attacked."}, {"id": "c8741743-7a1d-4897-bd0f-5bce776f297a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32965/", "date": "2024-08-23 17:14", "message": "Syria: Unofficial media reports an Israeli strike in the Hama area and that Syrian air defense systems in Homs were activated at this time."}, {"id": "6dc51df5-655a-4fa1-8c38-d1bc6d853a9e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32962/", "date": "2024-08-23 16:20", "message": "Hezbollah announces three more deaths in its ranks (six since this morning):\n\nHussein Shakir (killed in an IDF strike in Meiss al-Jabal)\nMohammad Najem (killed in an IDF strike in Aita al-Jabal)\nSaeed Diab\n\nAccording to the IDF spokesperson, Mohammad Najem, who was eliminated in Aita al-Jabal, was a key militant in Hezbollah’s rocket and missile unit in southern Lebanon.\n\n428 Hezbollah operatives have been killed since the start of the war."}, {"id": "6d2f9921-7525-4b3a-af7d-21232e92713e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32961/", "date": "2024-08-23 16:18", "message": "The IDF spokesperson in Arabic recently issued a new evacuation warning for residents of the Atatra area in the northern Gaza Strip - they are required to move south following rocket fire towards Israel from the area earlier today."}, {"id": "78d96e79-b5f4-44fd-ba87-d9bc8823d711", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32959/", "date": "2024-08-23 16:17", "message": "IDF artillery shells hit fuel depots in al-Hiyam village in southern Lebanon and caused a fire."}, {"id": "e5220135-a895-484d-ab13-bc641f835762", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32958/", "date": "2024-08-23 16:13", "message": "The IDF announces the death of a soldier in combat in the central Gaza Strip."}, {"id": "e91ae5ee-7fdb-4245-9bbe-c98a3639f4dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32957/", "date": "2024-08-23 16:12", "message": "IDF about an hour ago: Following the sirens that sounded a short while ago in the area of Safed, approximately 20 projectiles were identified crossing from Lebanon into northern Israel. Some of the projectiles were intercepted and the rest fell in open areas. No injuries were reported."}, {"id": "bd0a3709-e244-4226-9b97-c52d2d65492f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32956/", "date": "2024-08-23 16:11", "message": "Lebanese channels report that Israeli fighter jets broke the sound barrier over southern Lebanon earlier today. According to Lebanese sources, Hezbollah launched an anti-aircraft missile at them."}, {"id": "3489a1a0-e36b-450f-a21b-335fe60bf696", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32953/", "date": "2024-08-23 16:10", "message": "Lebanese media reported an Israeli UAV strike on a vehicle in al-Hamadiyah, in the outskirts of Tyre, Lebanon earlier today. Unofficial sources claim there is one fatality.\n\n## \nThe attacked car had a sunroof and leather seats... style."}, {"id": "ed3a2e4f-2a73-4238-b2a4-b66d7e56cece", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32952/", "date": "2024-08-23 13:58", "message": "Unofficial Lebanese sources: The number of casualties in the attack on Meiss al-Jabal has risen to 3.\nThe number of casualties today in the IDF attacks in southern Lebanon has risen to 9. \nThe one killed in the motorcycle attack in Aitaroun was Palestinian."}, {"id": "935c83eb-371f-4124-b0b5-dfb47e0a6789", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32951/", "date": "2024-08-23 13:56", "message": "Great video. well edited. It's fun to see it on Palestinian channels.\nWell done 👏👏🫡\n\nVideo Credit: Division 162\n\nhttps://www.instagram.com/amit_maymoni?igsh=ZjFvNzFmd2JhNnV5"}, {"id": "5d2b15b7-e07d-45f3-8222-ee290ac9f92f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32950/", "date": "2024-08-23 13:52", "message": "Lebanese Ministry of Health:\nOne dead and one injured in a UAV attack on a motorcycle in Aitaroun in southern Lebanon.\n\nIn addition, one dead and two injured in the strike (fighter jet) in the village of Meiss al-Jabal in southern Lebanon.\n\n##\nThis is in addition to the two dead in Aita al-Jabal and three Hezbollah operatives officially announced eliminated this morning in Tayr Harfa.\nA productive day."}, {"id": "401ee1a4-6720-4551-bdd0-4d15e7695d79", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32949/", "date": "2024-08-23 11:30", "message": "Lebanese sources report two fatalities in the Israeli drone strike in Ayta al-Jabal, southern Lebanon 👆."}, {"id": "98557f24-805d-4e7b-a18e-61e085fba60e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32946/", "date": "2024-08-23 11:26", "message": "Hezbollah announces three casualties in its ranks:\n\n Aqil Gharib\n Qassem Hurqus\n Hassan Hurqus\n\nAll three were killed in an IDF attack in Tayr Harfa this morning 👆.\n\nHezbollah has reported 425 casualties since the beginning of the war, with more expected."}, {"id": "6b13adcd-3d2a-46f1-b500-c75a0197c7cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32942/", "date": "2024-08-23 10:19", "message": "Lebanese sources report that the Israeli drone launched two missiles in Ayta al-Jabal: one targeting a structure and another targeting a vehicle."}, {"id": "fb0d902d-7b5b-4009-89c3-8603d31b3f7b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32941/", "date": "2024-08-23 10:17", "message": "Lebanese sources report of casualties in an Israeli drone strike on a structure in Ayta al-Jabal in southern Lebanon."}, {"id": "a8dd0f5d-e72a-44d2-8c87-ac3cfee7dbf9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32939/", "date": "2024-08-23 10:04", "message": "Palestinians report that Israel decided unilaterally to release 40 prisoners from Ofer Camp yesterday.\n\nPalestinian channels are now lamenting that some of the prisoners, particularly those who were overweight, have dramatically lost weight during their imprisonment. The family of Anan Bashkar from Nablus (first image), one of the released prisoners, issued a public statement last night apologizing for not being able to host his well-wishers until Anan \"recovers at home from his time in prison.\"\n\nAlso attached are photos of Ata Jabali, another prisoner released yesterday (second image), showing him before and after his imprisonment."}, {"id": "c6492cc0-fe8e-4478-bd83-2026e1292fed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32941/", "date": "2024-08-23 09:44", "message": "Palestinian channels report that an IDF drone entered an apartment belonging to Nasser and Khaled Siam in the promenade area of Nuseirat in the central Gaza Strip (north Nuseirat). \n\nThese sources claim that the drone dropped several grenades inside the apartment, causing the deaths of four members of the Siam family. \n\nIt was also reported that another drone prevented Gazans from approaching the apartment until the “completion of the elimination.”"}, {"id": "19aeee6c-e7c2-43c1-8ff8-a6225f032055", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73878/", "date": "2024-08-23 09:43", "message": "Sources in central Gaza report that armed men robbed the warehouse at Al-Nakhil Hall yesterday, where tons of meat donated by Saudi Arabia for Gaza residents were stored.\n\nGazan social media users reported heavy gunfire last night in Deir al-Balah during the robbery and later mentioned that the meat “returned to its rightful owners” - the residents of Gaza.\n\nSome Gazan users noted that the market in Deir al-Balah will soon be flooded with meat as a result, and that barbecues have already been lit…"}, {"id": "459dc81e-2223-43ba-af5c-742179df6520", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73878/", "date": "2024-08-23 09:42", "message": "Hezbollah has claimed responsibility for this morning’s attack on the IDF’s Aerial Control Unit in Meron."}, {"id": "f81724df-4920-4aa5-aa55-f95b0f9cc199", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73878/", "date": "2024-08-23 09:41", "message": "Lebanese Ministry of Health: Two killed and one injured in the IDF attack in Tayr Harfa. Later reports claim the number of killed has risen to three."}, {"id": "a80d6679-b193-4073-942f-f024df83b6b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73878/", "date": "2024-08-23 09:27", "message": "UNRWA: 250,000 Gazans have been displaced from their homes in the Gaza Strip following 12 evacuation orders issued by the IDF during the month of August."}, {"id": "d348d0d5-2639-41f3-9631-2c55aea04ded", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73878/", "date": "2024-08-23 09:26", "message": "The Pentagon: We are well-deployed militarily to defend Israel, should we be required."}, {"id": "4aa336ff-5ed8-41f1-94df-b3b2be553407", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73877/", "date": "2024-08-23 09:26", "message": "Attack on the Zakut building👆 in Nuseirat in the central Gaza Strip yesterday, from another angle."}, {"id": "8cc227a9-5495-4683-af7d-9e58666321c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32930/", "date": "2024-08-23 09:25", "message": "“The sea is before us and death is behind us.”\n\nA Palestinian lament cartoon… \nSoon they will claim that its the Jews that want to throw the Arabs into the sea (: \nOnce, the claims were the opposite…"}, {"id": "893d056f-48f3-4952-aabc-edff7ce24098", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32929/", "date": "2024-08-23 09:19", "message": "Due to the evacuation warning, Gazans left their tents near the “al-Qudsia” outpost in Khan Yunis. After the strike, they returned to their tents."}, {"id": "b9892cd2-513a-4557-80ec-0cdc4d276c3f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32927/", "date": "2024-08-23 09:19", "message": "Last night, following an evacuation warning, the IDF targeted the “Al-Qudsia” outpost of Hamas in the western part of Khan Yunis (al-Mawasi area) in southern Gaza."}, {"id": "4b1f5736-9a4e-41ee-8582-0392ee5a9efa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32926/", "date": "2024-08-23 09:11", "message": "IDF: A short while ago, a terrorist cell that was planning to fire projectiles from the area of Tayr Harfa in southern Lebanon toward Israeli territory was identified by IDF soldiers and eliminated by the IAF.\n\nFollowing the elimination, a projectile launch was identified from the area, indicating the presence of weapons and rockets.\n\nAdditionally, IDF artillery struck to remove threats in the area of Chebaa in southern Lebanon.\n\nAttached is a video of the strike."}, {"id": "c32e156a-f2d6-4c2e-9fb9-be693b7cec49", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32925/", "date": "2024-08-23 09:10", "message": "Chicago, near the DNC: Pro-Palestinian protestors are blocking the road. One of the protestors smashed the windshield of a blocked vehicle."}, {"id": "fa2e19cf-46a9-4e32-bd52-088917af83c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32924/", "date": "2024-08-23 07:28", "message": "And… calls praising the “Intifada” - which is the “only solution”, according the protestors outside the DNC. \n\nChicago, USA."}, {"id": "180a3f1c-b246-4cf7-bb8a-dba56d61f8f9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32923/", "date": "2024-08-23 06:51", "message": "This also happened outside the DNC:\n\nPro-Palestinitans are chanting:\nFree Palestine\nF*ck America \n\nWhilst setting the American flag on fire.\n\n###\nThese two chants have become interconnected."}, {"id": "aa26d32d-0f20-4697-b50b-dd06bbb710de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32919/", "date": "2024-08-23 06:45", "message": "In the meantime, outside the Democratic National Convention pro-Palestinians are chanting:\n\nF*ck The DNC, Free Palestine\n\nAnd:\n\nKiller Kamala\nDo\nNot\nCome\nFor our votes"}, {"id": "9a4d395a-4f15-42f6-8023-d9496f66b3ea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32918/", "date": "2024-08-23 06:22", "message": "Trump, who covered Harris’s speech live in a video and responded to everything she said (and didn’t say), addressed Harris’s remarks on Israel and Gaza:"}, {"id": "8a98ea0e-51a3-4a13-be0a-41af898f4f64", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32917/", "date": "2024-08-23 06:15", "message": "In a minute and a half, Harris said everything that both sides want to hear:\n\n1. Emphasized her support for Israel.\n2. Called Hamas a terrorist organization.\n3. Acknowledged the sexual violence committed by Hamas.\n4. \"Balanced\" her support for Israel with the suffering of Gazans.\n5. Announced her efforts to end the war.\n6. Highlighted the Palestinian right to self-determination."}]