[{"id": "ba6227f0-c2fc-4631-b4c9-a305c7285cf9", "channel_id": 1560386984, "url": "https://abualiexpress.com/%d7%9e%d7%a7%d7%95%d7%a8%d7%95%d7%aa-%d7%a4%d7%9c%d7%a1%d7%98%d7%99%d7%a0%d7%99%d7%9d-%d7%93%d7%a8-%d7%90%d7%99%d7%90%d7%93-%d7%90%d7%9c%d7%9e%d7%a2%d7%90%d7%a8%d7%99-%d7%a8%d7%90%d7%a9-%d7%a2/", "date": "2024-06-06 21:21", "message": "Palestinian sources: Dr. Iyad Al-Ma'ari, mayor of the municipality of Nuseirat, was killed in an IDF attack a short time ago in the market area of ​​Nuseirat, near a warehouse of the municipality (central Gaza)."}, {"id": "0b40cca5-3920-4312-8353-0d3d1a946b6e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28526/", "date": "2024-06-06 19:44", "message": "Palestinian documentation of the attack on Deloul tower today in Deir al-Balah. The attack followed an evacuation notice."}, {"id": "33a5485f-d1c6-4e4b-9c4c-0a664b921f96", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28526/", "date": "2024-06-06 19:43", "message": "Lebanese media are reporting a large fire raging at this time in Jarjoua in southern Lebanon.\nNo IDF attacks are known in this area today."}, {"id": "4153fbce-3afd-448f-8008-6cac9404c6cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28526/", "date": "2024-06-06 19:43", "message": "The Palestinians claim: Israelis started a fire in the village of Kasara south of Nablus."}, {"id": "89f8c8b9-97bf-46c7-a38c-ad4fa7670b43", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28526/", "date": "2024-06-06 19:41", "message": "The IDF spokesperson publishes documentation of the elimination of Hamas terrorists who tried to enter Israel from the Rafah sector early this morning."}, {"id": "57ea3595-3d44-4a1a-af32-cb357f60f2ac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28526/", "date": "2024-06-06 19:39", "message": "The IDF spokesperson announces that the target of the attack in the UNRWA school classrooms in Nuseirat 👆 early this morning were 9 terrorists from Hamas and Islamic Jihad."}, {"id": "c0d4b6e2-520c-466f-ba5e-6d0140ca7d6a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28525/", "date": "2024-06-06 19:36", "message": "The American Wall Street Journal: Yahya Sinwar informed the mediators that Hamas will not disarm.\n\n##\nHamas seeks to ensure its survival through the deal. A hostage deal and the release of prisoners are merely the means. Not the goal. Yahya Sinwar wants to end the war with Hamas still in control of the Strip."}, {"id": "1fad73e8-52bb-4710-b157-66c267a06e37", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28524/", "date": "2024-06-06 19:33", "message": "Saudi Arabia: We will observe the new moon of the month of Al-Hajja, so the first day of the Feast of the Sacrifice will be on June 16"}, {"id": "41b7fd34-e1ae-44df-9680-70fb5608498e", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68319/", "date": "2024-06-06 16:42", "message": "Removal of the bodies of the two terrorists in Jenin 👆👆"}, {"id": "7618d080-217c-4387-b748-74c65daff672", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28521/", "date": "2024-06-06 16:42", "message": "In slow motion: the launch of SpaceX's Starship spacecraft (owned by Elon Musk) into space a little over an hour ago (test flight)."}, {"id": "886730ca-54bc-47da-b36f-50f508fbd587", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28521/", "date": "2024-06-06 16:41", "message": "Hezbollah in an official announcement a short time ago:\nWe launched anti-aircraft missiles at the Israeli Air Force planes that tried to create a panic by breaking the sound barrier in the skies of Lebanon. This forced the planes to withdraw from the area."}, {"id": "f9df3662-f201-418d-a831-5ec63d18ca38", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28519/", "date": "2024-06-06 16:41", "message": "Jenin, the eastern neighborhood, Albiadar area: soldiers in the jeep manage to eliminate two terrorists on the motorcycle - Issa Aljalad and Ibrahim al-Saadi, while driving, and continue to the next target."}, {"id": "ac7f8172-b4a0-4157-a839-47514a7c3f7f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28519/", "date": "2024-06-06 16:40", "message": "Here is Zakut the celeb, receiving an award for being able to reach the IDF sniper position.\nTo the left of Zakut is the Deputy Secretary General of the Islamic Jihad, Muhammad al Hindi.\nTo his right (after the one holding the microphone) stands Yahya Sinwar and next to Sinwar stands Talal Abu Tarifa, a member of the political bureau of the Democratic Front, who was killed in an attack a few weeks ago.\nEveryone joined together to give strength to the treasured \"March of Return\" - Zakut was one of the first to cross the fence to Israel."}, {"id": "9f4b0f5a-a458-4284-9c69-e55828d1d440", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28518/", "date": "2024-06-06 16:37", "message": "Today at around 14:00 an Israeli drone attacked a group of people near the Eban Cafe in the Shatti refugee camp in the west of Gaza City.\n\nAs a result of the attack, 5 Gazans were killed, including Izz al-Din Zakut (Abu Bara' Zakut).\n\nZakut became a \"celeb\" in the Gaza Strip in September 2018 when he managed to cross the border fence with Israel and reach the top of an Israeli sniper post and take souvenir equipment from there.\nHe was then honored by kings as you will see in the attached photo that was published on the Hebrew channel in September 2018👇👇👇"}, {"id": "11c349d1-5dd6-403b-b5e8-89279a23af8e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28515/", "date": "2024-06-06 14:52", "message": "IDF activity in the Jenin refugee camp: The Palestinians report that Apache helicopters are firing at the houses surrounded by IDF forces. The houses belong to Osama Abu el Suis and Suhaib al Marei.\n\nAs of now there are 8 wounded among the Palestinians in the Jenin refugee camp."}, {"id": "a0febaf3-c18c-4f07-83cd-2951bd159546", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28513/", "date": "2024-06-06 13:54", "message": "Jenin refugee camp: The Palestinians report that the IDF forces are occupying two houses in the camp.\n\nThe Palestinians also report that IDF forces fired shoulder-fired missiles at one of the houses and that an IDF Apache helicopter is patrolling the camp's skies."}, {"id": "566af448-1802-47d4-89bc-e47af3b2be07", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28510/", "date": "2024-06-06 13:53", "message": "The Palestinians report that they discovered two vehicles of undercover forces in the Jenin refugee camp - the sirens were activated because of this."}, {"id": "b3fb9412-b0dc-4e6f-8807-8f49f8a2c9aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28509/", "date": "2024-06-06 13:52", "message": "Lebanese channels report that an Israeli drone attacked a vehicle in southern Lebanon, and thanks to \"divine providence\" only one civilian was slightly injured."}, {"id": "444a4f53-8e70-4063-9d24-a01c07c4fb57", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28508/", "date": "2024-06-06 13:52", "message": "Pay attention to the clean execution of the attack on the classrooms with the terrorists in the UNRWA school early in the morning in Nuseirat in the center of the Gaza Strip.\nHardly any work left for the cleaning staff. The structure looks sound enough to add a floor."}, {"id": "9d8ee867-b632-4134-9743-c4da72427a3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28507/", "date": "2024-06-06 13:49", "message": "Senior Hamas official Sami Abu Zahari:\n\nWe informed the mediators that the Israeli document is not acceptable to us.\n\nThe American proposal (to the UN Security Council) is based on the Israeli document and contains no indication of the end of the fighting or the withdrawal of Israeli forces from the Strip.\n\nHamas is committed to its previous proposal that it submitted on May 5 and includes the cessation of hostilities, the withdrawal of forces, the lifting of the blockade over the Strip and a prisoner exchange deal.\n\n##\nHamas says: \"No\" to Biden."}, {"id": "b479bd6b-e4e7-45ef-b3b8-a575ec32ec4e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28506/", "date": "2024-06-06 13:48", "message": "A Gazan journalist films from inside the UNRWA school that was attacked last night in Nuseirat in the center of the Gaza Strip (according to Hamas 40 people were killed).\nIt can be seen that the photographer is recording from the top floor, some of whose columns remain intact (the ceiling did not fall).\nThis means that the Air Force used precision bombs that hardly hit beyond what was necessary. The other part of the school (opposite) was not damaged at all."}, {"id": "c779a02d-e48b-4572-8614-4697dcebad5a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28505/", "date": "2024-06-06 11:07", "message": "Hamas in an official announcement: congratulations to Spain 👆 for joining South Africa's lawsuit against Israel at the International Court of Justice in The Hague.\n\n##\nSpain and Hamas have become a perfect pair..."}, {"id": "f4575ac6-a535-40e3-ac0c-78ad26b87993", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28504/", "date": "2024-06-06 10:42", "message": "The IDF spokesperson announced the fall of soldier in the Southern Brigade in battle in the southern Gaza Strip.\n\nMay his memory be a blessing."}, {"id": "64b2a8d6-851e-4970-a92d-f4ac5f007275", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28503/", "date": "2024-06-06 10:41", "message": "Senior Hamas official Osama Hamdan in an interview with Arab media regarding Hamas's position regarding the negotiations:\n\nWe are not interested in dealing with the Israeli proposal, but with the Israeli side's response to the mediators' proposal.\n\nThe movement is not ready to discuss new ideas that do not include the end of aggression, the withdrawal of the occupying forces and the restoration of the Strip.\n\nWe have received assurances from the mediators to continue efforts to advance our demands.\n\nThe contradictory Israeli positions on which Israeli officials are divided among themselves cannot be trusted.\n\nThe Americans are complicit in the aggression and the massacres and are not mediators that can be trusted.\n\nThe ball is in the court of the mediators and the Israelis.\n\nIsrael does not want to stop the aggression, and there is no guarantee that it will respond to the mediators' efforts.\n\nWe will not discuss ideas before the Israeli side approves the mediators' proposal.\n\nHamas used extensive flexibility during the negotiations, on the other hand, the Israeli side continues to be stubborn."}, {"id": "00ef888b-a26a-4e7e-9d11-bd464704b610", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28502/", "date": "2024-06-06 10:39", "message": "The Information Office of Hamas in an official announcement about the IDF's attack tonight on the UNRWA school in Nuseirat:\n\n40 people were killed, including 14 children and 9 women.\n\n##\nThat is, even in the biased report of Hamas, there are 17 adult men who were killed.\n\nSo far, Palestinian channels have only published the names of 9 dead.\nIt can be assumed that, as always, Hamas will not reveal the dead from among its military operatives. And it can be assumed that among the 15 \"children\" there may also be those who are no strangers to weapons..."}, {"id": "639efa69-6952-4e8b-83f6-da0e75af2c8e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28501/", "date": "2024-06-06 10:38", "message": "The IDF Spokesperson on the attacks in Lebanon:\n\nOvernight, IAF fighter jets struck Hezbollah military sites, including a weapons storage facility located in the area of Wadi Jilou, and two additional military sites located adjacent to the area of Hadchit deep in Lebanon.\n\nIn addition, the IDF struck Hezbollah military structures in the areas of Beit Yahoun and Seddiqin, as well as Hezbollah terror infrastructure in the area of Odaisseh in southern Lebanon."}, {"id": "dafa3069-8717-44b1-a197-8bf93f09b1ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28500/", "date": "2024-06-06 10:36", "message": "Lebanese channels report a fire in the village of al-Abbasieh in southern Lebanon as a result of Israeli phosphorus bombs."}, {"id": "09fcb8f5-7809-4ebc-b620-551cf3287586", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28499/", "date": "2024-06-06 10:36", "message": "The military wing of Hamas accepts responsibility for this morning's infiltration attempt in the Kerem Shalom area in the Rafah sector and claims that its operatives attacked the headquarters of the division that manages the fighting in Rafah in an operation \"beyond enemy lines\"."}, {"id": "666aa1e9-1432-4fd0-9167-bb14ac702745", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28499/", "date": "2024-06-06 10:35", "message": "Sources identified with the Shiite axis: The \"Palestine\" ballistic missile that the Houthis launched 👆 towards Eilat on 3.6 is the Houthi version of the Iranian ballistic missile \"Khyber 2\" which reaches a declared range of 1800 km."}, {"id": "b18aed5f-894a-46e6-a67d-f6f27364744f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28496/", "date": "2024-06-06 10:35", "message": "Hezbollah announces a death in its ranks:\n\nHossein Alhourani, a resident of Bint Jabil.\n\nHe was killed in the motorcycle attack this morning in Aitaroun 👆\n\nNumber 333"}, {"id": "3fb45433-9250-4216-b526-aa54b3193a87", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28495/", "date": "2024-06-06 08:55", "message": "The evacuation notice was sent to the residents of Wadi Jilo from a number with a Denmark country code."}, {"id": "c60e1191-dfe1-4ab6-b15b-a54ed23ad3c4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28494/", "date": "2024-06-06 08:51", "message": "Did the IDF send evacuation notices early in the morning before the attack in Tyre in southern Lebanon?\n\nAccording to reports from Lebanese on social media, before the IDF attack early in the morning in Wadi Jilo - Aaitit in the Tyre governorate, an evacuation notice was received for the building that was attacked.\nAccording to the attached image, a man named \"Ibrahim\" sent a text message at 2:27 a.m. in which he ordered the residents of a two-story building in Wadi Jilo, where there is also a pharmacy, to vacate.\nThe IDF attack came about an hour later."}, {"id": "b2a77f4b-4a53-4faa-a829-6c07995ff7f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28493/", "date": "2024-06-06 08:33", "message": "Al Jazeera: Spain joins the lawsuit filed by South Africa against Israel at the International Court of Justice in The Hague."}, {"id": "37a65fcc-3a62-4a60-9753-aefbb3598a55", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28492/", "date": "2024-06-06 08:32", "message": "Lebanese media: one dead and one injured in the motorcycle attack in Aitaroun in southern Lebanon."}, {"id": "3f300a7c-8322-425a-af43-9e2f26a1f961", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28491/", "date": "2024-06-06 07:55", "message": "The civil war in Sudan: Arab media reports that the Rapid Support Forces in Sudan, fighting against the Sudanese army, carried out a massacre in which 104 residents of the village of Wad a-Nora, south of the capital Khartoum, were killed.\n\n##\nI wonder if President Biden... or the UN... or the EU... or the Hague... will have anything to say about this.\n\nThe Israeli attack in Rafah with 35 dead - an attack on senior terrorists, outside the designated safe zone, who were stashing and hiding weapons among IDP tents - made for an international production on the scale of Eurovision..."}, {"id": "7007b95b-e7c2-4452-9881-b65106e7a32f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28490/", "date": "2024-06-06 07:49", "message": "Israeli media reports that Hamas rejected Biden's latest offer.\n\nIt is important to note that these reports originate from the Israeli media.\nHamas has not published an official statement on the matter, and neither have media outlets affiliated with it. The Qatari network Al Jazeera, which is well informed about the details of the negotiations, did not mention anything on the subject."}, {"id": "36dff6f1-3c6d-406d-bc04-465301b01982", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28489/", "date": "2024-06-06 07:49", "message": "IDF Spokesperson: IDF troops operating in the area of the security fence identified several suspects who approached the border from the Gaza Strip and moved toward Israel in an attempt to cross the security area in the area of Rafah.\n\nThe troops engaged the terrorists who opened fire at them. The troops then returned fire at the terrorists.\n\nAn IAF aircraft that monitored the terrorist cell struck the terrorists and eliminated two of them. Another terrorist was eliminated by means of tank fire shortly afterward.\n\nWe emphasize that the terrorists did not cross the fence built along the Gaza Strip. \nThe incident is under review."}, {"id": "f4b35600-55be-4db5-ac5f-cbfe524a597d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28488/", "date": "2024-06-06 07:48", "message": "The IDF spokesperson announced the death of a reservist.\n\nHe was killed in a Hezbollah attack yesterday in Hurfeish, northern Israel.\n\nMay his memory be a blessing."}, {"id": "67fb18e3-b87c-4622-944f-e81e083ca899", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28487/", "date": "2024-06-06 07:46", "message": "A significant attack in Nuseirat in the center of the Gaza Strip\n\nPalestinian channels report about 30 deaths as a result of an IDF attack on UNRWA's al-Sardi Elementary School in Nuseirat in the center of the Gaza Strip.\nIn some reports, the Palestinians connect the incident to an attack in a nearby house and claim that there are a total of 39 dead in the two attacks.\nThe Hamas information office announced 27 deaths officially but noted that the number is expected to rise.\n\nAccording to the reports of the Palestinians, Israel attacked 3 classrooms inside the school on the upper and lower floors.\n\nAccording to the IDF spokesperson and according to the attached diagram, it can indeed be seen that the attacks were aimed at certain classrooms in the school and not at the entire building.\nAccording to the IDF spokesperson, Hamas and Islamic Jihad terrorists who took part in the October 7th massacre lived in these rooms."}, {"id": "2db69be1-1bb3-48b3-b5af-4b26f5f5bf7c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28486/", "date": "2024-06-06 07:43", "message": "Lebanese media: An Israeli drone attacked a motorcycle in the village of Aitaroun in southern Lebanon a earlier this hour."}, {"id": "1f670a11-2fa7-46a6-a066-dc7f84821f02", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28485/", "date": "2024-06-06 07:29", "message": "The area that the IDF attacked early in the morning in Wadi Jilo - Aaitit in the Tyre governorate in southern Lebanon, as it appears this morning."}, {"id": "ef06a569-d8a4-4272-88e3-073afb58aa53", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28482/", "date": "2024-06-06 07:28", "message": "Documentation from the area that was attacked in Wadi Jilo - Aaitit in the Tyre governorate, in southern Lebanon."}, {"id": "c9917ac5-ac1b-4452-95f5-b837b7a40262", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28478/", "date": "2024-06-06 07:27", "message": "The attack in Beit Yahoun - Kounine in South Lebanon: Spectacular secondary explosions were caused - evidence of weapons storage in the place that was attacked.\nResidents of the area were asked to close their windows so as not to inhale \"dangerous substances\"."}, {"id": "24f2351e-1a48-4d1e-8014-f85b4081a4b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28477/", "date": "2024-06-06 07:25", "message": "A series of attacks by the IDF early in the morning in southern Lebanon\n\nLebanese media reports that IDF warplanes attacked several targets early in the morning in southern Lebanon. Casualties were recorded, but so far no deaths have been reported.\n\nTargets were attacked in the following villages:\n\n1. Beit Yahoun area - Kounine (there were casualties).\n2. Aadchit - Jibchit\n3. Sadiqine\n4. Wadi Jilo - Aaitit in Tyre Governorate\n5. Yarine - Jebbayn\n\nDocumentation from the attacks:"}]