[{"id": "e5ec49ce-cd86-4edc-bdac-373820e6c534", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26868/", "date": "2024-05-07 19:16", "message": "Al-Jazeera, from the US State Department:\n\nThe closure of the Kerem Shalom and Rafah crossings is unacceptable. They must be opened. We will follow up on the matter tomorrow.\n\n##\nAccording to another report, the entry of fuel into the Gaza Strip through the Rafah crossing will be resumed tomorrow."}, {"id": "3c3eb747-b0b4-4c20-a672-ce27e6a01f43", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26867/", "date": "2024-05-07 19:15", "message": "Egypt: A newly-formed Egyptian organization called \"Pioneers of Liberation, the squad named after the martyr Muhammad Salah\" accepts responsibility for the murder of an Israeli citizen in Alexandria today.\n\n##\nMuhammad Salah was the Egyptian policeman who carried out the attack in which three Israeli soldiers were killed at the Egyptian border in June of 2023."}, {"id": "6c523aa8-b38c-48cd-8cff-7d438446e67e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26866/", "date": "2024-05-07 19:00", "message": "Al-Jazeera, from the US State Department:\n\n\"It is important to reopen the Rafah crossing as soon as possible because it is essential for the continuation of humanitarian aid operations.\nThe launch of Israel's attack on Rafah after Hamas had agreed to a cease-fire deal indicates that Israel did not act in good faith.\"\n\n##\nThe US publicly sides with Hamas. Unbelievable. They don't understand that the shortest path towards a ceasefire is exactly on the other side. With their actions, they are only prolonging the road towards the end of the fighting, and along the way they are hurting their ally. \n\nThese statements indicate a total lack of understanding of how the Middle East operates."}, {"id": "a128e458-b625-4804-837e-0a15af5e26ce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26865/", "date": "2024-05-07 17:29", "message": "Hamas in an official announcement:\nThe movement's delegation led by Khalil al-Hayya (deputy of Yahya Sinwar and member of the political bureau of Hamas - AA) arrived in Cairo a short time ago, in order to obtain a ceasefire agreement."}, {"id": "68ce33a9-e8f9-4358-8789-e0f20537a8e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26864/", "date": "2024-05-07 17:29", "message": "From reading the statements of the Defense Minister and the Prime Minister, one gets the impression that the Rafah crossing will no longer return to Hamas control.\n\nIf this is indeed the case, this is important news.\nThe Rafah crossing, as I mentioned this morning, is the oxygen artery of Hamas and a significant part of its power base. Whoever controls the goods and money controls the Strip.\nThe effect of cutting off the Rafah crossing from the hands of Hamas will increase over time. This will help in \"ousting\" it from power. Controlling the transition means power. This is a step that shortens the life of Hamas rule. Israel must not relinquish control of the crossing and must not return it to Hamas even within the framework of a ceasefire agreement if one is signed.\nIsrael must continue to hold the crossing until the removal of Hamas as a governing body in the Strip. This should be a threshold condition for a ceasefire agreement.\nThis helps the common goal of Israel and the US to remove the rule of Hamas from the Strip."}, {"id": "2a903b2f-7cef-4448-8eb4-22d82a97d4a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26863/", "date": "2024-05-07 17:27", "message": "Al Jazeera: The number of Palestinians killed in Rafah since the morning has risen to 27."}, {"id": "acbb865e-c229-4ca9-a945-fbbd9f6fcca4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26862/", "date": "2024-05-07 17:09", "message": "The Gazan journalist - clown Saleh Al-Jafarawi, who raised about one and a half million dollars on social networks during the war, is now lamenting that the Yousef al-Najjar hospital in Rafah is not active because it is inside the area that the IDF instructed to evacuate.\nAccording to him, this hospital is the main hospital of Rafah, which now stands abandonded.\n\nI will add another small detail - this hospital was used on August 1, 2014, during the Black Friday of Operation Gaurdian Edge, as the place where Hadar Goldin's body was taken after he was kidnapped. He was brought in an ambulance by the kidnappers."}, {"id": "5994d987-133b-4f0d-b4a1-3529f02523cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26861/", "date": "2024-05-07 17:06", "message": "From Defense Minister Gallant's words this evening:\n\n\"Yesterday I ordered the IDF to enter the Rafah area, seize the crossing and carry out its missions. This operation will continue until we eliminate Hamas in the Rafah area and the entire Gaza Strip, or until the first abductee returns.\"\n\nFrom the words of Prime Minister Netanyahu, this evening:\n\n\"We are continuing the war against Hamas. The capture of the crossing in Rafah today is a very important step; an important step on the way to destroying the remaining military capabilities of Hamas, including the elimination of the four terrorist battalions in Rafah; and an important step to damage the governmental capabilities of Hamas, because as of this morning we denied Hamas a crossing that was essential for establishing a government of terror in the Strip.\""}, {"id": "03cb4b95-94bd-40b1-ac04-5f9286061cc3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26860/", "date": "2024-05-07 16:59", "message": "Reuters news agency from its sources: The US has been delaying the shipment of weapons to Israel, including equipment for the production of precision bombs, for about two weeks."}, {"id": "1fc6fdff-8a2e-4de0-862e-2f0b3b1c1fb7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26859/", "date": "2024-05-07 16:58", "message": "The military wing of Hamas accepts responsibility for firing the rockets (about an hour ago) at Re'im (a community near the Gaza Strip)."}, {"id": "4181b5f2-c297-45e3-a92f-f57a734493b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26858/", "date": "2024-05-07 15:34", "message": "Palestinian channels report 23 deaths in IDF attacks in Rafah since the morning hours (not official sources).\n\n##\nPresumably this includes the 15 dead from the night"}, {"id": "50651288-c713-4fda-bbc9-07a46ada3a8a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26856/", "date": "2024-05-07 14:09", "message": "Germany: German police disperse (resolutely) a camp with anti-Israeli demonstrators at the University of Berlin that was established against the background of the war in Gaza.\nThe protesters call out to the police:\nShame, shame, shame!"}, {"id": "fe6a990e-b8d0-4cf8-a93d-95aa20af979a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26855/", "date": "2024-05-07 13:09", "message": "Hezbollah has recently accepted responsibility for a midday drone attack that it claims was aimed at the Yiftach base and the Iron Dome batteries in Ramot Naftali.\n\nAccording to unofficial sources identified with the organization, 6 drones took part in the attack.\n\nAccording to the IDF spokesperson, one drone was intercepted, some fell in open areas and some caused damage, but according to him there were no casualties as a result.\n\n###\nThe IDF should make Hezbollah a heavy price and react as if Hezbollah's attack had achieved its goals.\nThis has become a disturbing daily occurrence."}, {"id": "f72de034-d25b-48aa-8794-ae39cabda082", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26854/", "date": "2024-05-07 12:34", "message": "What changes should Israel make to its demands, especially now after it has taken control of the Rafah crossing?\n\nI am convinced that everyone aware of the situation in the Gaza war knows Hamas's main demands that it's unwilling to compromise on for the release of the hostages:\n\nFirst and foremost - stopping the war entirely. \n\nAfter that - the withdrawal of IDF forces from the Gaza Strip, the return of the displaced, and the restoration of the Gaza Strip.\n\nThen, and only then - a \"serious\" prisoner swap deal.\n\nAnd what does Israel want? Only the release of the hostages? \nWhy is Hamas's list so long and marketed so well? Each such demand line from Hamas is published and reiterated non-stop by officials and representatives, which only strengthens each of the demands individually as bargaining chips in the negotiations. Israel has to give something to meet each of Hamas's long list of demands.\n\nDoes Israel only want the release of hostages? That's it? Why?\n\nOver the past few months, the US has been urging Israel to make decisions on \"the day after the war.\" This was crucial to them. Israel was publicly reprimanded, even creating internal political conflict.\n\nNow, the time has come for Israel to turn to the Americans, who are urging it with all their might to reach an agreement and ask about the day after the war.\n\nWhat will happen to senior Hamas officials? What will happen to Hamas's weapons?\n\nJust as Hamas announces several times a day in every possible media outlet that its threshold condition for a deal is a permanent ceasefire, Israel should now demand as a threshold condition for any future agreement the removal of senior Hamas officials from the Strip and the disarmament of Hamas.\n\nThis is a logical, basic, important condition, one that the US will have a hard time saying no to, which can lead to the full and real end of the war, even if the IDF does not eliminate all of Hamas's militants in the Strip (complete elimination is probably an unrealistic goal).\n\nSuch a condition would prevent Hamas from claiming victory. The winners are never exiled.\n\nThe US can and should agree to such a condition - it will allow it to create new leadership in Gaza for the day after the war. As long as senior Hamas officials are not expelled from the Strip and as long as Hamas is not disarmed, it is irrelevant to talk about \"the day after\" in the Strip.\n\nHamas will not just peacefully allow a foreign power (Israel, the US, Saudi Arabia, or anyone else...) to replace them as the ruling force in the Gaza Strip with someone else. The exile of Hamas's leaders is a necessary step, as mentioned, towards ending the war.\n\nIsrael should start demanding that the exile of Hamas and its disarmament are threshold conditions for any future ceasefire deal! Only then can we commit to ending the war, and it would even help Biden reach a normalization deal with Saudi Arabia before the November elections..."}, {"id": "56c1ada1-85cd-4db0-8dfe-e8b36fc74e11", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26853/", "date": "2024-05-07 12:01", "message": "Hamas in an official announcement: the purpose of the (Israeli) invasion into Rafah is to harm the ceasefire efforts.\n\n###\nAnd they still aren't announcing the suspension of talks, as they promised they would if Israel were to invade Rafah."}, {"id": "e7f106a7-9d16-493e-9919-e92534617a1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26852/", "date": "2024-05-07 10:45", "message": "Palestinian channels: An Israeli drone punched a hole in the dome of the Al-Abrar Mosque in the center of Rafah."}, {"id": "0f17903a-31d7-43c3-8b70-8405c6785799", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26851/", "date": "2024-05-07 10:42", "message": "The Egyptian Foreign Ministry condemns the operation in Rafah. But what does it really mean?\n\nThe Egyptian Ministry of Foreign Affairs: \n\n\"We strongly condemn the Israeli actions in Rafah and the takeover of the Palestinian side of the Rafah crossing. Egypt sees this as a risk to the lives of more than a million Palestinians who rely on the crossing. We call on Israel to exercise maximum restraint and \"stay away from the edge of the precipice\" - as it harms the efforts to reach a Hudna.\n\n###\nAn untrained reader might wrongly think that Egypt truly opposes an Israeli military action in Rafah. I mean, it strongly condemned it...\n\nBut if we dig a little deeper, translate it into \"spoken Middle Eastern\", and read between the lines - there is no threat of concrete actions from the Egyptian side, no threat to trade agreements, or diplomatic relations, and certainly not to the peace agreements between the two countries.  \n\nEgypt calls on Israel to exercise maximum restraint... This translates to - When you take down Hamas in Rafah, do it in a way that won't make us look bad. After all, we're not really doing anything to prevent you from doing so, but we still need to maintain our image as one of the leading countries in the Arab world...\n\nThe al-Sisi regime, which despises the Muslim Brotherhood and its Palestinian branch - Hamas, would be more than happy to see Hamas disappear from its border.\n\nMeanwhile, there are quite a few complaints among Gazans on social media: Where has the Egyptian army gone? They're doing nothing to prevent Israel from acting in Rafah...\n\n##\nTo summarize, the Egyptians are not that excited, and Hamas has not stopped the ceasefire talks. Now we understand just how idle all the threats to prevent a military operation in Rafah were.\n\nThis is an important lesson for the coming months of the war."}, {"id": "624e3724-964a-4a6c-8c00-e2b605c692e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26850/", "date": "2024-05-07 10:20", "message": "The movement of displaced Gazans from Rafah to Khan Yunis continues...\n\nSome of the displaced people who left Rafah today are setting up tents near the ruins of their homes in Khan Yunis."}, {"id": "45dabf32-13dc-48d4-a244-3558302c0b48", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26849/", "date": "2024-05-07 10:09", "message": "More ridicule from Fatah-affiliated channels: \"Be quite!\"\n\nAttached is an old photo of the leader of Hamas in the Gaza Strip, Yahya Sinwar, in his good old days in an Israeli prison."}, {"id": "6b98ee83-90b5-4fa3-83a6-c0df545c60ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26848/", "date": "2024-05-07 10:08", "message": "Fatah-affiliated channels are mocking Hamas:\n\nWhere have all the Hamas police officers gone?\nWhere are they? Why are they not protecting the people? Did they just all run away?\n\n###\nThe fact that the IDF managed to take control of the Rafah crossing without almost no resistance is significant. \n\nMany Palestinian feel that Hamas has abandoned the battlefield, not living up to the hawkish statements from its spokespeople in recent weeks.\n\nThe strategic Rafah crossing fell into the hands of the Israelis almost without a fight."}, {"id": "c63d3f21-cc65-4374-a10a-db091f5bc290", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26846/", "date": "2024-05-07 10:00", "message": "What a pleasure to download such videos from pro-Iranian regime channels..."}, {"id": "d16248ea-f96b-4858-be8a-2f74260e383f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26845/", "date": "2024-05-07 09:52", "message": "The swearing-in ceremony of Putin as President of Russia for another six years has begun."}, {"id": "826df529-8639-49fb-847a-cf7a2b2ed325", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26844/", "date": "2024-05-07 09:03", "message": "The Lebanese Al-Mayadeen, citing a senior member of the \"Palestinian Resistance\":\n\n\"The taking over of the Rafah crossing threatens the ceasefire talks. Hamas sees it as a deliberate provocation with the aim of creating difficulties in negotiations.\"\n\n###\nAnd yet... despite past promises... Hamas has not stopped the negotiations.\nThis shows that it has a lot to lose from a full-out military operation in Rafah. \nHamas was bluffing, and its hand was exposed."}, {"id": "d7684ad8-e310-4802-a70a-88dee0f7f5f2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26843/", "date": "2024-05-07 08:55", "message": "Huge support for the president of Argentina, Javier Milei:\n\nElon Musk, one of the richest businessmen in the world, recommends investing in Argentina."}, {"id": "376aba11-bb48-4cc2-90d1-e153f749656e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26842/", "date": "2024-05-07 08:44", "message": "Fatah supporters on Facebook mock Hamas by publishing a \"newly-updated list\" (instead of the existing one planned for today) of those approved to leave Gaza through the Rafah crossing today, which includes the following Israeli names:\n\nكشوفات تنسيقات شركة هلا ليوم 7 مايو على معبر رفح\n\n-ديفيد سمحون David Simhon\n-دانيال نفتالي Daniel Naftali \n- شمعون رادان Shimon Radan\n- سابير مزراحي Sapir Mizrachi\n- شوشان حاران Shoshan Haran"}, {"id": "0b2d94ec-57f6-4f36-a482-fc4723bf2289", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26841/", "date": "2024-05-07 08:37", "message": "The Palestinian Crossings Authority: \n\nRafah crossing officials left the area before the arrival of Israeli forces. None of them were hurt."}, {"id": "30942b58-57be-42cb-8ae3-4c2b02356b64", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26840/", "date": "2024-05-07 08:04", "message": "The military wing of Hamas in an official announcement: \n\nWe launched 114mm \"Rajum\" short-range rockets at the Kerem Shalom crossing.\n\n##\nThe Kerem Shalom crossing will likely remain closed for humanitarian aid... Hamas rocket fire puts truck drivers and others working at the crossing at risk."}, {"id": "14761bad-41f3-440b-ad4f-36ab8cf5423c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26839/", "date": "2024-05-07 07:16", "message": "ضاع معبر فيلادلفيا يا مصريين 💔\n\nA Palestinian channel published the attached clip with the following caption:\n\n\"The Philadelphia (Rafah - AA) crossing is lost, O Egyptians 💔\""}, {"id": "306dd890-93fd-4502-9414-8a7544653ba9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26838/", "date": "2024-05-07 07:14", "message": "The military wing of Hamas: We launched rockets at the maneuvering forces inside the Rafah crossing.\n\n##\nTwo things to note here:\n\n1. Hamas officially admits that there are Israeli forces inside the Rafah crossing.\n2. Hamas attacks the crossing with the aim of damaging it."}, {"id": "07537506-f264-4abe-b17b-35b6c03ac8f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26835/", "date": "2024-05-07 07:12", "message": "Additional photos published by the IDF spokesman from the Rafah crossing."}, {"id": "f8d1a9de-7b9d-4333-baf1-6edda6b74476", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26835/", "date": "2024-05-07 07:12", "message": "The IDF reports that it had eliminated 20 terrorists and uncovered three operational tunnel shafts as part of the operation in Rafah.\n\nAdditionally, the IDF spokesman published footage of Israeli forces entering and taking control of the Rafah crossing compound.\n\nHonestly, these are exciting sights. The Rafah crossing is the crossing through which Hamas released some of the Israeli hostages during November's Hudna. Now it's under Israeli control. \n\nWhite and blue flags - looks better this way."}, {"id": "5147f511-4c63-4794-8639-021056ad343f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26833/", "date": "2024-05-07 06:27", "message": "Here's something important to note:\n\nThe ground operation in Rafah has begun, there is no disputing that.\nThere are significant achievements on the ground - the control of the Rafah crossing, there is no dispute over that either.\n\nDespite all of this and despite explicit and public promises from senior Hamas officials that action in Rafah will cause the negotiations to stop - Hamas has not announced as of now the suspension of talks for a ceasefire deal.\n\nThis is important. The military pressure works in Israel's favor in the negotiations. This is how negotiations are conducted in the Middle East. Israel didn't play into the hands of Hamas, negotiating from a position of weakness, but rather took initiative and action - forcing Hamas, which remained stubborn in its demands throughout the recent round of talks, into a worse position to negotiate from."}, {"id": "6812112f-203b-4e44-b6a6-f58cc511ef87", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26832/", "date": "2024-05-07 06:19", "message": "Displaced residents from eastern Rafah start moving to Khan Yunis, following the beginning of the Israeli military operation in the area."}, {"id": "46379c2e-cb76-4f5f-a466-9831975f23aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26829/", "date": "2024-05-07 06:16", "message": "The Shiite militias in Iraq have increased the number of announcements about alleged attacks on Israeli territory.\n\nLast night, the militias announced that they had attacked the Yehonatan and Jordan bases (in the Golan) with suicide drones. They also claim to have attacked the Sapir base early this morning.\n\nThe multitude of announcements comes against the background of the progress of the ground operation in Rafah."}, {"id": "da8db7a4-9eec-4df8-b298-87498b2fd190", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26828/", "date": "2024-05-07 06:14", "message": "The IDF spokesman announced this morning the death of two reservists, major Dan Kamkagi and major Natan Hertz, from the 6551 patrol battalion.\n\nThe two were killed in yesterday's suicide drone attack in the Metula area.\n\nMay their memory be a blessing."}, {"id": "0e943ee5-4a7f-46d6-b0e3-19fd5a3699bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26827/", "date": "2024-05-07 06:12", "message": "The Palestinians, for their part, report 15 casualties as a result of IDF airstrikes on several houses east and west of Rafah.\n\nGiven the number of attacks by the IDF last night and considering that \"the ground operation in Rafah has begun\", this is a very small number of casualties. One possible reason for this could be the evacuation leaflets that have been dropped in the area in recent days.\n\nAttached is footage of some of last night's attacks in Rafah, as photographed from the Egyptian side of the border."}, {"id": "711b17bc-21c6-40d6-be4f-7d482e708107", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26823/", "date": "2024-05-07 06:09", "message": "A major Hamas oxygen pipeline has been cut off - currently, the IDF controls the Rafah crossing.\n\nThe IDF holds and fully controls one of Hamas's main power sources in recent months - the Gazan side of the Rafah crossing.\n\nThe crossing is closed to passenger traffic, and the commercial crossing is also shut for trucks carrying goods.\n\nThe attached photos are circulating on most Palestinian and Arab channels - everyone is witnessing this development!\n\nThis is an important mental and military achievement. The Israeli flag flies at the Rafah crossing.\n\nEqually important to note is that there was no significant resistance or fighting from Hamas, and that this objective was achieved within hours of the operation's announcement.\n\nWell done."}]