[{"id": "74c93629-b086-4e54-9a81-6b6d67d577fb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28377/", "date": "2024-06-04 09:46", "message": "Unofficial Lebanese channels: 3 injured, some of them seriously, in an Israeli UAV attack on a vehicle in the Libayya - Yohmor area in the last hour (location attached)."}, {"id": "3b17a20d-6444-4451-b78d-43c34e57ff7c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28376/", "date": "2024-06-04 09:40", "message": "The IDF spokesperson informed a short time ago that following a warning of a threat of enemy aircraft infiltration in the north of the country, interceptors were launched from the Safed area towards a suspicious aerial target which turned out to be a false alarm...\n\n##\nNot for the birds..."}, {"id": "85c07c11-e9aa-41bf-9847-791623c76e72", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28374/", "date": "2024-06-04 09:37", "message": "Palestinian channels: The IDF carried out a controlled explosion of an explosive device located on 22nd Street in Qalqilya."}, {"id": "5324810d-87c5-484b-add9-e522ee2473e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28374/", "date": "2024-06-04 09:35", "message": "Palestinian sources: the vehicle that was attacked this morning in Deir al-Balah 👆 belonged to Hamas police. The death toll in this attack rose to eight."}, {"id": "b0e5e647-61f8-43bc-ba66-db9877600776", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28373/", "date": "2024-06-04 07:21", "message": "The northern arena: where do we go from here?\n\nThe escalation in the northern sector has been increasing in the last month in a calculated and systematic manner. Since the announcement of Biden's proposal, there is a feeling that this sector is heating up even more. It is possible that Hezbollah thinks that if they increase the pressure now, as an arena that Nasrallah defined as a \"supporting arena for Gaza\", then they will be able to pressure Israel to accept the terms of the ceasefire with Hamas, with the aim of quieting the north.\n\nIsrael does not have many choices.\n\nHezbollah's many weapons and ammunition have been stockpiled for one purpose. They will not disappear on their own. And if anyone has doubts about Hezbollah's intentions, Nasrallah makes sure to make them clear often: Hezbollah will never give up on a war of attrition against Israel. This is the goal in the past, this is the goal in the present, and this is the goal in the future.\n\nEven if it is not pleasant and certainly not easy, there is no one who will do the work against Hezbollah for Israel.\nEverything is at Israel's doorstep.\n\nI wrote here a few months ago in a long article that Israel is at the right time for starting a war against Hezbollah:\n\n1. The army is prepared and Hezbollah cannot at this stage surprise Israel like Hamas did on October 7.\n\n2. There is an understanding among large parts of the Israeli public that only a hard war against Hezbollah will be able to create a situation in which the residents of the north will be able to return to their homes. There is readiness and desire.\nMany understand that it is impossible to count on a political agreement with Hezbollah. So says past experience, which enabled the situation today, and the voice of reason.\n\n3. Israel managed to erode some of Hezbollah's capabilities in recent months. Not starting from scratch.\n\nIt is true that it would have been much more convenient if Trump was in the Oval Office instead of Biden, but the current reality and the recent escalation do not allow Israel to wait 7 months for the optimistic scenario from its point of view in which Trump defeats Biden in order to get more favorable terms.\n\nJust as Israel realized in retrospect (and too late) that it made a mistake by waiting for many months in vain and not entering Rafah in order to please the US and the international community, so it will realize that delaying the inevitable in the northern arena can cost it much more than it plans and wants.\n\nWhoever runs away from the fire discovers that it is chasing him.\nThere is a difficult reality in the north and it has to be faced despite the difficulties. Postponing the end will not improve the situation. Gaza is no longer the main arena that draws the bulk of the army's forces to it. The time has come to gather the courage and the strength and take care of the northern arena with all our might. Even if it takes many months or even longer.\nThere is no other choice. No one will do it for us."}, {"id": "b5108c26-210a-4291-97a5-02dc848539ce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28372/", "date": "2024-06-04 07:18", "message": "The Palestinians report 7 dead in a vehicle attack this morning near the technical college in the north of Deir al-Balah (central Gaza)."}, {"id": "27e9d91f-b1ce-485b-8ad2-1c5c581a227f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28371/", "date": "2024-06-04 07:10", "message": "The documentation of the fires in the north of Israel have been filling the Arab channels across the board since yesterday.\nThe fire \"photographs well\" and creates a lot of interest - the Arabs in the Middle East are waiting to see how Israel will react."}, {"id": "bfa1950d-5368-4ada-8220-7f63d13451e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28370/", "date": "2024-06-04 07:08", "message": "A bank robbery that included shooting, this morning, in the village of Dar Salah in the eastern part of Bethlehem."}, {"id": "1ca579af-8f57-495e-baf3-a15e3b4f18d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28369/", "date": "2024-06-04 07:08", "message": "Lebanon: The new Iranian foreign minister (replacing the minister who was killed in the crash) in a meeting with Nasrallah in Beirut.\n\nThe Iranian minister landed yesterday in Beirut for his first official visit since his appointment.\n\nEveryone kept their shoes on (:"}, {"id": "fec7620c-a2a1-4a38-9dbf-4f5902d4bb01", "channel_id": 1560386984, "url": "", "date": "2024-06-04 07:06", "message": "The elimination of the Iranian adviser in Syria \n\nYesterday 👆 Saeed Aviar, member of the Iranian Revolutionary Guards, was killed in an attack attributed to Israel in Aleppo, Syria.\n\nFrom photos on social networks, it appears that along with the \"advisor's\" coffin, a coffin of an operative of the Fatemiyoun militia (circled in red) who was apparently also killed in the attack was sent.\nFatemiyoun is a Shiite mercenary militia that Iran operates for its needs mainly in Syria, consisting mostly of Afghans. It has been working for many years for Iranian interests for small sums of money and \"Iranian citizenship\".\n\nIn the photos, you can see Saeed Aviar in a \"consulting mission\" from more than four years ago with Qassem Soleimani, commander of the Quds force in the Iranian Revolutionary Guards who was eliminated in 2020 by the US.\n\nAviar is the first Iranian whose assassination is attributed to Israel since the attack near the Iranian embassy in Damascus on 4/1 (which led to the extensive Iranian response-AA)."}, {"id": "8155d61d-adbb-4d76-a9d1-1910b65c6396", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28364/", "date": "2024-06-04 06:31", "message": "Fatah's al-Aqsa Martyrs Battalions in Tulkarm accept responsibility in a proclamation on their behalf for the overnight shooting attack at the Nitsani Oz checkpoint in western Tulkarm.\nAccording to the announcement published last night, some of the perpetrators of the attack returned home safely, and as for another part, their fate is \"unknown\".\n\nThe two \"missing\" are:\nAbdel Fattah Jabara\nAhmad Rajab\n\nTheir picture is attached.\n\nThe IDF spokesperson helped them find out what happened to the two:\n\nTwo armed terrorists were killed in the Tulkarm area before carrying out a shooting attack on Israeli settlements in the area\n\nDuring the night (Monday), two armed terrorists approached the fence with the aim of carrying out a shooting attack on Israeli settlements from the direction of Tulkarm in the Menashe division. An ambush of Unit 636 fighters in the area eliminated the terrorists and confiscated the weapons they intended to use."}, {"id": "e58a9849-09de-4969-8764-1120b7aa80e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28363/", "date": "2024-06-04 06:30", "message": "Lebanese sources claim that Israel launched phosphorus bombs last night at Karfkela in southern Lebanon with the aim of setting fire to the area."}, {"id": "7864a572-f3da-4353-ba99-3276940dd02a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28360/", "date": "2024-06-04 06:29", "message": "The San Francisco police arrested about 70 anti-Israel clowns who broke into the building where the Israeli consulate in San Francisco is located yesterday."}, {"id": "3cec8ac1-9844-4c20-a284-4c8fa47e8c6f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28359/", "date": "2024-06-04 06:28", "message": "USA: We distributed a draft resolution supporting the implementation of President Biden's ceasefire proposal to the UN Security Council. We call on the UN Security Council to insist that Hamas accept the ceasefire agreement."}, {"id": "99557656-6f99-4d27-b494-f4175c0677a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28358/", "date": "2024-06-04 06:26", "message": "The Lebanese Al-Akhbar newspaper (Hezbollah-affiliated):\nBritain warned Lebanon of an imminent Israeli attack in mid-June with a recommendation to stockpile supplies for a war whose scope and length are unknown."}]