[{"id": "6a0041f4-13df-4749-a5a0-e0689611d731", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28761/", "date": "2024-06-11 09:32", "message": "Following Al Jazeera's report this morning on the firing of approximately 40 rockets towards the Galilee, Hezbollah accepts responsibility for launching dozens of Katyushas towards a base of the 210th Golan Division.\n\nOn the same matter, the IDF spokesperson reports:\nFollowing the sirens that sounded in northern Israel a short while ago, approximately 50 projectiles were identified crossing from Lebanon into the area of the central Golan Heights. The IDF Aerial Defense Array successfully intercepted a number of the projectiles. The rest of the launches fell in open areas. No injuries were reported."}, {"id": "bb49ef55-c28a-4dd5-b663-77f71a387f6c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28760/", "date": "2024-06-11 09:30", "message": "Documentation of an IDF attack in the Zawayda area, in the center of the Gaza Strip, near the Palestinian tents on the beach.\n\nIt was the evacuation alert that made this documentation possible."}, {"id": "f9723c52-5d6b-451e-a8ce-4faa2cb425e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28759/", "date": "2024-06-11 09:28", "message": "US Secretary of State, Blinken:\n\nIf Hamas does not accept Biden's proposal, the responsibility for the continuation of the fighting will fall on its shoulders."}, {"id": "219374cc-fcd4-400d-bed0-0a87d619b82e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28758/", "date": "2024-06-11 09:28", "message": "Hezbollah announces another death in its ranks, the third today:\n\nHadi Musa from the village of Sheba in southern Lebanon.\nThe circumstances of his death have not been published, but some estimate that he was also killed in an IDF attack last night in Hermel.\n\nNumber 339."}, {"id": "2f02f03e-a6f3-446b-912f-2a5271a35df2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28756/", "date": "2024-06-11 09:27", "message": "Hezbollah announces two deaths in its ranks:\n\nAbbas Nasser\nBilal Ala' a-Din\n\nBoth are residents of villages in southern Lebanon, but according to Lebanese sources, they were killed in an IDF attack tonight in Hermel in northern Lebanon.\n\nSo far 338 have been killed by Hezbollah since the beginning of the war."}, {"id": "9109a1c0-2644-4f2b-8093-a8e41a8208e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28755/", "date": "2024-06-11 09:26", "message": "Hamas in an official announcement:\n\nThe IDF killed four members of the military wing of Hamas yesterday in Kfar Naama (Ramallah district).\nThe four are:\nMuhammad Jaber Abdo (the senior among the four who was released 3 years ago from prison in Israel after serving 20 years in prison. Circled in red.)\nMuhammad Raslan worked\nand Sim Abu Ado\nRushdi Ataya\n\n##\nIn the West Bank, Hamas has no problem announcing the massacre, but in Gaza it hides them deeply.\nIt has no respect for its military operatives in Gaza. In the name of strengthening its narrative on the global stage, it does not announce, out of principle, the death of its military operatives in Gaza (and in order not to glorify Israel's achievements)."}, {"id": "9cbef94a-7c5f-4bc1-b110-457f36dd653e", "channel_id": 1560386984, "url": "", "date": "2024-06-11 09:21", "message": "The attack at midnight in Harmel, northern Lebanon:\n\nLebanese sources report that five died in the attack not far from the border with Syria (about 130 km from the Israeli border). Three had Syrian citizenship.\nThey report the IDF attacked several trucks, tankers and vehicles.\n\nThe Lebanese Al Mayadeen channel reports in this context that at least 9 missiles were fired from Israeli warplanes at the village of Khush a-Sid Ali in Harmel and another site.\n\nThe IDF statement regarding the attack:\n\nIn response to the shooting down of an IDF aircraft operating in the skies over Lebanon: the IDF attacked during the night a Hezbollah military compound and terrorist targets in deep and southern Lebanon\n\nDuring the night, Air Force fighter jets attacked a military compound of Unit 4400, the logistical reinforcement unit of the terrorist organization Hezbollah, which serves as a factor in transporting weapons to and within Lebanon.\nIn the complex, two centers located in the area of ​​Albak in deep Lebanon were attacked."}, {"id": "e33a7e3d-2531-4449-a5a6-cff54b5e8833", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28752/", "date": "2024-06-11 07:02", "message": "Further to this report, Hezbollah publishes an official announcement in which it accepts responsibility for launching an air defense missile, last night, at an Israeli plane - \"which was forced to flee as a result\" and return to Israeli territory."}, {"id": "a62ab444-a036-4a04-a22b-2da01bedef1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28751/", "date": "2024-06-11 06:58", "message": "IDF Spokesperson: In the past hour, the IDF Aerial Defense Array successfully intercepted a suspicious aerial target off the coast of Haifa. No sirens were sounded in accordance with protocol. No injuries or damage were reported."}, {"id": "e8f6c6f9-ef86-4c57-bb08-0272531ab9d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28750/", "date": "2024-06-11 06:57", "message": "The IDF spokesperson announced the death of three soldiers and a commander-in-training in the Givati Brigade. They fell in battle in the southern Gaza Strip.\n\nMay their memories be a blessing."}, {"id": "d20b509f-7422-41ef-883d-7a110526358c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28749/", "date": "2024-06-11 06:56", "message": "Lebanese sources: A Syrian air defense missile that was fired at Israeli Air Force planes that attacked in Hermel (in northern Lebanon) apparently hit a building in Aakkar in Lebanon."}, {"id": "dc5028fb-512e-4ea3-baf9-582bf0da0b18", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28745/", "date": "2024-06-11 06:49", "message": "The IDF attacks in northern Lebanon\n\nLebanese sources report that the IDF attacked in northern Lebanon, not far from the border with Syria.\nAccording to these sources, Israeli warplanes carried out at least 7 attacks in the area.\n\nThis is the northernmost point that the IDF has attacked in Lebanon since the beginning of the war.\nThere is a statement here."}, {"id": "c4941e01-36b4-4200-bce5-b583ebe81817", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28744/", "date": "2024-06-11 06:27", "message": "Following this 👆, according to Lebanese channels, Hezbollah fired air defense missiles at the \"noisy\" air force planes that are scaring the Lebanese people.\n\nHere in the video you can see, according to these sources, one of Hezbollah's air defense missiles, which was fired at the Air Force planes, exploding in the air."}, {"id": "5957f4a7-429e-46e7-a50c-dbeba242bc8e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28742/", "date": "2024-06-11 06:25", "message": "Lebanon: Lebanese channels complain that Israeli Air Force planes broke the sound barrier while flying over Sidon and caused supersonic booms last night."}]