[{"id": "7ef808bd-f8c7-4f03-a018-7938be026448", "channel_id": 1560386984, "url": "", "date": "2024-06-13 19:02", "message": "Official Egyptian sources: Egyptian President al-Sisi is expected to arrive in Mecca in Saudi Arabia to observe the hajj."}, {"id": "afdc80f3-f1f6-4559-8f09-8379daf1acc6", "channel_id": 1560386984, "url": "", "date": "2024-06-13 19:01", "message": "The American website Politico: Biden is pessimistic about a ceasefire between Hamas and Israel.\n\nAccording to the website, Biden expressed doubts that a ceasefire between Israel and Hamas will come soon... according to him \"Hamas needs to move\".... At the same time, he \"hasn't lose hope yet\".\n\nBiden's words were said during the G7 summit being held in Italy."}, {"id": "32ce56d4-985d-4740-9279-5d2af915dd86", "channel_id": 1560386984, "url": "", "date": "2024-06-13 19:00", "message": "IDF: As a result of an anti-tank projectile attack in the area of Manara, one IDF soldier was moderately injured and an additional soldier was lightly injured. The injured soldiers were evacuated to a hospital to receive medical treatment. Their families have been notified."}, {"id": "58a7a8cb-bc53-4620-b9ea-1657c2e7597d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68774/", "date": "2024-06-13 18:54", "message": "Saudi Arabia is launching an \"autonomous flying taxi\" for the first time to help transport pilgrims during the Hajj period."}, {"id": "2777261e-9334-44b8-806c-6ce3d62a0eda", "channel_id": 1560386984, "url": "", "date": "2024-06-13 18:48", "message": "Hezbollah claims: since the beginning of the war we have carried out 2125 attacks against Israel - 9 attacks a day on average (rounded up from 8.5)."}, {"id": "554dcd04-af00-405f-b8bd-b4403a4253f3", "channel_id": 1560386984, "url": "", "date": "2024-06-13 18:40", "message": "Viewing Warning - harsh graphic scenes.\n\nAn Israeli bulldozer removes the body of one of the terrorists who shot at IDF soldiers from the building named Kabatieh, Jenin."}, {"id": "8b5c698b-e8fa-4e1c-88e2-6faf85aaa83f", "channel_id": 1560386984, "url": "", "date": "2024-06-13 18:37", "message": "Gazan sources: IDF soldiers retrieved hundreds of corpses from four different cemeteries in Rafah and from them moved dozens of corpses to Israeli territory (for inspection-AA)."}, {"id": "db2d628e-7a07-4c20-aed2-3521f0e3ea9f", "channel_id": 1560386984, "url": "", "date": "2024-06-13 18:13", "message": "Aziz Dweik, chairman of the Palestinian Legislative Council and a senior member of Hamas, was released today back to his home in Hebron after being arrested by Israel at the beginning of the current war."}, {"id": "a953e7e3-3f6f-46db-88f2-9706eba85c71", "channel_id": 1560386984, "url": "", "date": "2024-06-13 14:46", "message": "Kabatieh, Jenin: IDF bulldozers have begun to destroy the house on its occupants."}, {"id": "38e6c971-8d45-487d-98f5-a7c10a9800c7", "channel_id": 1560386984, "url": "", "date": "2024-06-13 14:40", "message": "Kabatieh, Jenin Governorate: The Palestinians report that Muhammad Elazari was killed inside a house that IDF forces have been surrounding for several hours. According to the Palestinian report, there are also wounded inside the house, after the forces fired several shoulder-fired missiles at the building."}, {"id": "a3284259-b60b-4b20-b6f4-82e475e7715f", "channel_id": 1560386984, "url": "", "date": "2024-06-13 14:39", "message": "Lebanon: \"We will take 20,000 armed men to the streets against Hezbollah\" \n\nCamille Chamoun, a Maronite Christian, who heads the Free Nationalist Party (the grandson of the Lebanese president in the 1950s) threatens Hezbollah:\nAt dawn, we will take 20,000 armed men to the streets, except for the soldiers of the Lebanese army.\n\nChamoun specifies: they will be Sunnis, Druze and Christians.\n\n##\nThe war against Hezbollah is a central discourse in Lebanon and as we get closer to the moment of truth there are quite a few of Hezbollah's enemies who are preparing for Israel's attack on Hezbollah in order to fight against Hezbollah as well.\nYou just need to instill in them the hope that it is possible and that Israel will pursue it to the end."}, {"id": "19f288d0-6e03-4250-89a5-b6845dc77f22", "channel_id": 1560386984, "url": "", "date": "2024-06-13 12:46", "message": "Al Jazeera from a Hezbollah source on the attacks from this morning:\n\nWe attacked 15 military targets in the Galilee and the Golan at the same time.\nWe launched 30 drones and 150 rockets towards Israel this morning.\nThis is the most extensive attack we have carried out since October 8.\nThe purpose of the attack is to deter Israel and this is also a response to the assassination of the senior Talib Abdullah."}, {"id": "aa55914c-16e2-4815-b4ef-79ede156e6d3", "channel_id": 1560386984, "url": "", "date": "2024-06-13 12:03", "message": "Recent and extensive Palestinian public opinion survey: 73% support Hamas' decision to launch the October 7th attack\n\nToday, the Palestinian Center for Political Studies and Surveys published a comprehensive survey it conducted at the end of May on a variety of burning questions related to the current war.\nThe survey included about 1570 participants, half of them from the West Bank and half from Gaza.\n\nViewed from above, the survey shows an upward trend in the Palestinian public's support for Hamas and its actions, and confidence that it will win the war and remain in control of Gaza even after it.\n\nHere is a variety of data from the survey:\n\n73% of the respondents answered: Hamas made the right decision when it went to war on 10/7 - this is the highest figure for this question since the beginning of the war.\n\n96% of the Palestinians who did not watch the 10/7 videos do not believe that Hamas committed atrocities against Israeli civilians.\n\n54% of the Palestinians who saw the videos from 10/7 do not believe that Hamas committed atrocities against Israeli civilians.\n\n79% of respondents believe that Hamas will win the war - the highest rate since the beginning of the war.\n\n61% of the respondents in the survey prefer that Hamas continue to rule the Gaza Strip after the war (71% of the residents of the West Bank and 46% of the residents of the Gaza Strip prefer this to be the case).\n\nIn the event of an election for the PA presidency between Abu Mazen and Ismail Haniyeh, Abu Mazen will win 5% of the votes and Ismail Haniya 46% of the votes. 46% have announced that they will not vote in the elections.\n\nThe rate of support for Hamas and Fatah in general elections:\n17% will support Fatah\n41% will support Hamas\n\nOnly 32% of the survey respondents support the two-state solution for two peoples.\n\n52% support the armed struggle as a way to end the occupation and establish an independent Palestinian state."}, {"id": "bd80dbfb-ddee-49ad-8531-e1f9ff2e3122", "channel_id": 1560386984, "url": "", "date": "2024-06-13 11:29", "message": "The a-Najma Square area in the west of Rafah - it used to be one of the busiest places in Rafah, where in recent months the local market was also located."}, {"id": "e927dde5-b8cb-4ac0-99b7-5f62d0155015", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68735/", "date": "2024-06-13 11:28", "message": "USA: Hamas supporters set fire to the Israeli flag and the US flag in front of the Israeli consulate building in New York, in protest of the continued fighting in Gaza"}, {"id": "ec93618d-d265-4dc5-8d66-a1f5f8963f21", "channel_id": 1560386984, "url": "", "date": "2024-06-13 10:20", "message": "Al Jazeera presents: the Swedish village in the southwest of Rafah - before and after"}, {"id": "0e975aab-bdb5-484b-87e0-873fdc884700", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68735/", "date": "2024-06-13 10:18", "message": "Sources associated with the Assad regime on the video of the IDF soldiers shooting the catapults 👆:\n\"The occupation army acts like its allies, the Syrian rebels, in the first years of the civil war in Syria.\""}, {"id": "1c3787e4-0c63-4daf-a837-ed3aec73e7cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68735/", "date": "2024-06-13 10:17", "message": "Iraq: Oil refinery facilities in Erbil (Kurdistan Region) have been on fire since yesterday.\n\nSources associated with the Iranian axis claim that Kurdish oil from this region will find its way to Israel in the coming days."}, {"id": "cc2013d5-42c0-4c92-8e70-45ba6eefcfdb", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68735/", "date": "2024-06-13 10:16", "message": "Los Angeles USA:\nPro-Palestinian protesters/terrorists took over a floor of a building at California State University in LA while holding lecturers from the university's academic staff, including the president of the university, hostage in the building.\n\n##\nThat's how it is when your role model is a terrorist organization that kidnaps people... Maybe this will wake up some Americans who still don't understand what's going on around them."}, {"id": "875980db-7756-43ea-9859-3a4fd76455a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68735/", "date": "2024-06-13 10:15", "message": "This is undoubtedly one of the most popular videos this morning on the Lebanese and Palestinian channels.\nAccording to the Lebanese channels, this is how the IDF causes fires in southern Lebanon.\n\nOnly missing swords and armor... and the Game of Thrones crew🔥"}, {"id": "6785effc-631f-42c8-af29-004d23a0a689", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68735/", "date": "2024-06-13 08:16", "message": "An example from this morning of the detonation of several explosives planted in one of the roads in Jenin - the IDF continues to strip the roads in the area."}, {"id": "0623f935-0c29-4aac-8f1d-bdb88d242f1a", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68727/", "date": "2024-06-13 07:43", "message": "The Palestinians report that the IDF has been operating in the Jenin area and the Jenin refugee camp for about five hours.\nThey complain about the fact that the IDF destroys the road infrastructure in the area just days before Eid al Adha."}, {"id": "96d19bb0-d0a7-497d-8aa3-5cc4baf23303", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68727/", "date": "2024-06-13 07:42", "message": "A video sent to me by the follower R. from the beach near the place where the settlement of Pe'at Sade in the south of the Gaza Strip was located before the disengagement.\nTaken in the last few days."}, {"id": "bd7b5f2c-7e0f-453f-915c-651afeb9d6da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28833/", "date": "2024-06-13 06:14", "message": "Are the Christians in Lebanon preparing for war?\n\nAn unknown organization calling itself \"Rebellion\" posted recruitment ads targeting young Christians in Lebanon.\nThe ads were hung near the church in the Ashrafia neighborhood in Beirut, the capital of Lebanon, and with the approval of the church.\n\n##\nIn this context, I will point out that many Christians in Lebanon (and not only) wish for Israel's victory over Hezbollah and are counting on Israel to rescue Lebanon from the suffocating grip of Hezbollah.\nThis is part of recent Lebanese discourse.\nIsrael has important allies in Lebanon."}, {"id": "cf942c06-59d6-4028-84e4-ed7b6b5a7be5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28832/", "date": "2024-06-13 06:13", "message": "IDF advance in Rafah:\n\nGaza sources report a ground advance from south to north of maneuvering forces and tanks in the urban area of ​​Rafah's Mawasi - near the seashore and the Flag Square area.\n\nThe IDF denied morning reports of attacks in the humanitarian area in Mawasi (located north of there in the Khan Yunis district)."}, {"id": "81cfe7ac-f3ec-434a-ad55-f5521ca9632d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28831/", "date": "2024-06-13 06:12", "message": "Saudi Arabia: Arab channels report an unprecedented military deployment in the city of Mecca that includes the introduction of troops and military equipment seen there for the first time.\nAccording to the Saudis, the purpose of the extensive deployment is to maintain public order in the holy city of Islam, during the days of the pilgrimage."}, {"id": "3e8d46ae-55de-4802-b279-9984efeabbe3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28830/", "date": "2024-06-13 06:11", "message": "The destruction in the eastern part of the Bureij refugee camp in the center of the Gaza Strip after the departure of IDF forces from there last week."}, {"id": "520ae2d4-7ba8-4d8f-ab62-038af4429d80", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28828/", "date": "2024-06-13 06:10", "message": "Before and after: the Yabneh refugee camp in Rafah in the south of the Gaza Strip (located near the Philadelphi axis, roughly in the middle of it)."}, {"id": "5b42e249-3bc0-41bd-85fb-c2441c5bef47", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28827/", "date": "2024-06-13 06:07", "message": "Al Jazeera: The US Congress has approved the introduction of changes in the budget of the US Department of Defense in a way that will prevent the transfer of funds for the reconstruction of the Gaza Strip."}, {"id": "5f3ddf7d-4969-4002-a125-83d937ff319a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28826/", "date": "2024-06-13 06:06", "message": "Following the personal attack by senior Hamas official Osama Hamdan on the US Secretary of State Blinken, last night Hamas issued an official proclamation in which it stated:\n\nThe positions expressed by the American Secretary of State Blinken, through which he tries to clear Israel of guilt and accuse Hamas of responsibility for not reaching an agreement, are a continuation of the US policy that allows the continuation of the crimes of the occupation under American military-political cover.\nWe call on Blinken and the Biden administration to put pressure on the fascist occupation government that insists on completing the genocide.\n\n##\nHamas made a decision to address Blinken personally."}]