[{"id": "08164230-3cb6-426f-a57a-a692640d3155", "channel_id": 1560386984, "url": "", "date": "2024-06-01 20:08", "message": "After an intense day of fighting on the northern border, the IDF spokesperson summarizes the IDF's activity in this sector in the last 72 hours:\n\nMore Than 40 Strikes on Targets in Lebanon; Approximately 10 Terrorist Cells Struck by the IDF\n\nOver the last 72 hours, the IDF struck a series of targets in Lebanon. In joint activity of the Northern Command, the Israeli Air Force and the Intelligence Directorate (J2), the forces struck military structures where Hezbollah terrorists were operating, significant assets belonging to Hezbollah, as well as launchers used to fire from Lebanon at Israeli territory.\n\nDuring the day, IAF aircraft struck a surface-to-air missile launcher used by Hezbollah's air defense unit, in response to the terrorist organization's attempts to impede IDF aerial operations.\n\nIn quick and targeted combinations of intelligence, firepower and aerial strikes, approximately 10 Hezbollah terrorist cells in southern Lebanon were struck and approximately four terrorists were eliminated."}, {"id": "2e65ef1f-fc88-48a0-9b47-081bfe13e2cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28244/", "date": "2024-06-01 19:37", "message": "The Israeli attacks in western Baalbak in the depths of Lebanon: The Lebanese report casualties in the attack on a structure in Wadi Al-Aweena in the Keled a-Saba farm in the village of Beit Mchik."}, {"id": "036ccac9-6431-4991-a9dc-3861f619444f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28243/", "date": "2024-06-01 19:31", "message": "Lebanese sources: Israeli attacks in the Shmustar area in the west of Baalbek"}, {"id": "533e0b96-e4c1-4f6a-9184-6ad721f587bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28242/", "date": "2024-06-01 18:58", "message": "Hezbollah publishes the documentation of the downing of the Hermes 900 UAV today - which it claims is the 2000th attack since the beginning of the war."}, {"id": "2fb31b03-ea67-4c0b-bf20-9409d9beb876", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28238/", "date": "2024-06-01 18:22", "message": "About two months after the IDF left Khan Yunis (south of the Gaza Strip), Palestinian channels are publishing up-to-date documentation of the scenes of destruction in the city.\nThe city of Khan Yunis - \"a disaster-stricken area\", as the photographer calls it in one of the videos.\nThe sewage flows in the streets. The destruction is extensive."}, {"id": "8767107c-892c-4d6b-a499-182952bb7e62", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28232/", "date": "2024-06-01 18:20", "message": "Palestinian documentation published today of what remains of the Jabaliya refugee camp in the northern Gaza Strip."}, {"id": "8a8c8362-6275-480f-876d-36bcab47feae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28231/", "date": "2024-06-01 17:56", "message": "A surfer, who identifies himself as a Hamas supporter, responded to the picture of the \"kidnapped body\" on a Hamas-identified channel and wrote:\n\nHe looks like a Fatah man."}, {"id": "7aeb3ad3-a36c-49f3-90a6-fb4c9d4a8253", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28230/", "date": "2024-06-01 17:55", "message": "Ahead of the Saturday evening demonstrations in Israel and following the claims of the spokesperson of the Hamas military wing last week that the operatives managed to \"kidnap a soldier\", the military wing of Hamas is revealing the photo of the body in its possession, in an attempt to track down and reveal details about the \"kidnapped soldier\" from the Israeli army.\n\nI will mention that the IDF spokesperson emphasized last week that there was no kidnapping incident.\n\nI will also note that based on what is seen in the photo there is no evidence that this is an Israeli.\nSome of the Gazans hypothesize that it is possible that this is an African mercenary (of Israel), due to the fact that the Israeli side denied the kidnapping and did not provide additional details and due to his \"Arab appearance\", according to them."}, {"id": "fa760fa8-2815-49a0-8003-f1bce88f2d34", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28229/", "date": "2024-06-01 17:44", "message": "Lebanese media: The Lebanese army detonated, in a controlled manner, the missile carried by the Israeli drone that was shot down earlier today in Lebanon."}, {"id": "879d9db6-f5fe-4bc1-bccf-aee4a1d02059", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28228/", "date": "2024-06-01 17:44", "message": "More from the patriotic demonstration in London: good music, a calm and not masked crowd and some big Israeli flags that are waving with pride.\n\nA pleasure for the eyes, ears and soul 🇮🇱🇮🇱"}, {"id": "b7ede3e8-934a-45ac-a4c5-e0d28dae7846", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28225/", "date": "2024-06-01 17:41", "message": "The pendulum swings: After months of pro-Palestinian protests, tens of thousands of British patriots are marching through the streets of London and Parliament Square today to say:\n\"England 'til I die\"\n\"This is London. Not Lundistan\"\n\nPalestinian flags were not seen at the demonstration but a few Israeli flags were."}, {"id": "19feb91b-d5e7-4d5b-a327-98a47ec527f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28224/", "date": "2024-06-01 14:35", "message": "Lebanese sources: There were parts of the downed Israeli drone In the pick-up vehicle that was attacked in Deir Kifa."}, {"id": "a4dc72cd-2fe2-47e9-84c8-57d496ec6214", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28222/", "date": "2024-06-01 14:34", "message": "Saudi Arabia: Cristiano Ronaldo, a soccer player of the Saudi national team Al-Nazar was caught crying on camera after his team lost 5-4 in penalty kicks in the match against the Al-Lal team, in the final match of the Saudi Cup.\nThe Crown Prince of Saudi Arabia, Muhammad bin Salman, shook his hand during the awards ceremony."}, {"id": "332b0a60-5e1c-4931-9259-88936903c4d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28221/", "date": "2024-06-01 13:55", "message": "Lebanon: Lebanese channels reported earlier this afternoon that an Israeli drone attacked a pick-up vehicle in the Deir Kifa area, where the Israeli drone fell, according to the Lebanese Al Mayadeen channel.\n\nThere are no reports of casualties in the attack at this time."}, {"id": "e2963445-2702-4cef-bbd0-934a8020d010", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28218/", "date": "2024-06-01 13:52", "message": "Lebanese channels show parts of the Hermes 900 UAV that was shot down in Lebanon."}, {"id": "f00b6d24-1cc5-446a-80ac-fa586d36b39b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28217/", "date": "2024-06-01 13:51", "message": "A talented Iranian photographer stood in the right place and at the right time and managed to photograph the leading candidates for the presidency of Iran: Ali Larijani (right) and Saeed Jalili (left), the second they passed by the picture of President Raisi (with his turban appearing to be placed on their heads) inside the building of The Iranian Ministry of Interior, where the candidates are registered for the elections.\n\nAccording to sources in the opposition to the Iranian regime, the photos were banned from being published in Iran's official media."}, {"id": "4cba5727-40c1-48ec-a989-ce1c382be302", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28216/", "date": "2024-06-01 13:50", "message": "Lebanese media report on casualties in the IDF attack in Qantara in southern Lebanon a short time ago."}, {"id": "7885988b-88dd-4975-82bb-e297b25efa35", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28212/", "date": "2024-06-01 13:49", "message": "French President Macron tweets in four languages: Hebrew, Arabic, English, French.\n\nHey, Macron?\nThe war could be over in an hour... all Hamas has to do is put down its weapons, leave the Strip and release the abductees.\nTalk it over with your friends..."}, {"id": "de12d6ef-9fd9-448f-85e6-78594f0a3b13", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28210/", "date": "2024-06-01 13:47", "message": "Lebanese channels report 7 wounded, including some seriously, in an IDF attack this afternoon in the village of Seddiqine in southern Lebanon."}, {"id": "821680d4-174e-4557-bc18-a7456b172bf8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28209/", "date": "2024-06-01 13:44", "message": "The presidential elections in Iran: \"pressure\" on the Speaker of the Parliament, Ghalibaf, to submit his candidacy\n\nAlthough he was elected a few days ago for another one-year term as Speaker of the Iranian Parliament, channels affiliated with the Iranian Revolutionary Guards are promoting Ghalibaf's candidacy in the upcoming presidential elections.\nThe Tasnim news agency highlights a call by 2000 Iranian students for Ghalibaf to submit his candidacy despite his current position.\n\nIranian political actors claim that \"soon there will be news on the matter\"."}, {"id": "f767a91c-dbf2-450d-af1b-4a1348a50e79", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28208/", "date": "2024-06-01 13:43", "message": "Egyptian media: Tomorrow there will be a tripartite meeting in Egypt of Americans, Egyptians, and Israelis regarding the issue of reactivating the Rafah crossing."}, {"id": "576cf4aa-23af-46a9-97bf-610e82606ade", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28207/", "date": "2024-06-01 13:41", "message": "A young Lebanese man took home one of the wings of the Israeli UAV as a souvenir."}, {"id": "751ad289-c140-4c6a-b276-4a81a6456160", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28206/", "date": "2024-06-01 13:41", "message": "After accepting responsibility for the shooting down of a Hermes 900 type UAV, Hezbollah recently published an \"ID card\" for this type of UAV."}, {"id": "788ad2fe-23b6-446a-a70e-2f9d6f99fc4f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28205/", "date": "2024-06-01 13:03", "message": "Hezbollah in an announcement: We shot down a Hermes 900 type UAV.\n\n##\nThe cost of the Hermes 900 is estimated at several million dollars."}, {"id": "4b53cd17-13b1-447a-9ec2-3ed5e08b3d33", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28202/", "date": "2024-06-01 10:53", "message": "Additional documentation of the fall and the place where the Israeli UAV landed.\n\nThe Lebanese Al Mayadeen claims: the downed Israeli UAV landed in the village of Deir Kifa."}, {"id": "9e1682a0-a343-4721-a7a9-83e6a8152962", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28201/", "date": "2024-06-01 10:49", "message": "High quality documentation of the fall of the Israeli UAV in southern Lebanon."}, {"id": "7a5faecc-22d0-4881-b943-832973110888", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28198/", "date": "2024-06-01 10:47", "message": "Lebanese sources claim that Hezbollah managed to shoot down an Israeli drone in the skies of southern Lebanon over al-Kasiba in the Nabatieh governorate."}, {"id": "53b5b44b-5083-4837-90d7-dfa7d2fa3088", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28197/", "date": "2024-06-01 10:37", "message": "An apartment owner in the Bureij refugee camp in the center of the Gaza Strip: Thank God the door remained intact..."}, {"id": "f0bad617-45df-4f42-883b-570f53aff177", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28196/", "date": "2024-06-01 10:36", "message": "Gazans are dealing with the shortage of cooking gas:\nUsed motor oil is passed through an infusion dropper at a slow rate over an open fire and produces a stable heat source for cooking."}, {"id": "7163bb24-7fe0-4e9f-80c1-4193ab3c9cb3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28195/", "date": "2024-06-01 10:35", "message": "Iranian media are reporting the death of General Vajiya Allah Maradi, one of the top echelons of the Quds Force in the Iranian Revolutionary Guards.\nMaradi was a close aide to Qassem Soleimani (commander of the Quds force in the Iranian Revolutionary Guards who was eliminated in 2020) and some claim that he was even his relative.\nIn the past he also served as deputy commander of the special forces unit named after Imam Ali.\n\nAccording to media in Iran, he died as a result of \"sudden health failure\".\nNot everyone accepts this version."}, {"id": "0f7f92af-6d8a-49c5-b7ef-569ddd4136b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28194/", "date": "2024-06-01 10:35", "message": "The presidential elections in Iran:\n\nYesterday morning, the registration for candidates for the presidential elections in Iran that will be held on June 28 (current) officially opened.\nApplicants must be between the ages of 40-75.\nRegistration will close in 4 days and then for a week the candidates who submitted the application will be examined by the competent committee.\nOn June 12, the candidates approved to run will be announced - about two and a half weeks before the designated election date.\nIn Iran, as it goes in Iran, whoever is elected is whoever the Supreme Leader wants to be elected.\nChoosing the final list of candidates is part of the process. Only candidates who do not threaten the candidate desired by the supreme leader will be approved."}, {"id": "d2aca057-606a-4822-8c54-842a790b013d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28193/", "date": "2024-06-01 08:04", "message": "Gaza Strip: The Palestinians sell empty IDF ammunition boxes as firewood.\nAccording to the seller in the video, the IDF wooden box weighs about 7 kg and is sold in the market at a price of NIS 25-30 per unit.\nThe Gazans use it as a substitute for cooking gas - they use wood to light a fire on which they cook food and make coffee."}, {"id": "5a089bae-a6fb-4f51-b846-27b223f3d363", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28192/", "date": "2024-06-01 07:42", "message": "Hamas supporters are enthusiastic about the fact that in the video in which the spokesman of the Hamas military wing claimed this week that \"a soldier was kidnapped\" (something vigorously denied by the IDF spokesperson), one of the Hamas operatives is seen wearing flip flops.\n\nThroughout the week, Hamas supporters praised the \"famous flip flop\" seen in the video and now Palestinian shoe stores are offering such models for sale - like the one in the attached photo taken in Hebron."}, {"id": "45891b3f-6c1e-44f5-ab84-ceff5a32ce4a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28191/", "date": "2024-06-01 07:29", "message": "At the end of President Biden's press conference yesterday, he was asked by reporters, as he left the room, what his response was to the issue of Trump's conviction in court.\nBiden pauses for a moment, gives a big smile and continues without answering the reporters."}, {"id": "36fb051a-78b3-44c0-98ce-67fe1c8531bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28190/", "date": "2024-06-01 07:29", "message": "King of Bahrain: We are working to renew diplomatic relations with Iran."}, {"id": "a39500b7-1e75-4228-8dff-6d2b4d3afc89", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28189/", "date": "2024-06-01 07:26", "message": "Senior Hamas official Muhammad Mardawi on the proposal presented by Biden last night:\n\nWe have not yet received the details of the offer.\n\nIf the Biden administration does not put pressure on the Netanyahu government, the deal will not see the light of day.\n\nA deal cannot be reached until both demands are addressed: the withdrawal of IDF forces from the Gaza Strip and a comprehensive ceasefire."}, {"id": "c8bd7831-84a1-43da-8ad4-52daeb6479fb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28188/", "date": "2024-06-01 07:25", "message": "Lebanese media report two injured after an Israeli UAV attacked a motorcycle in Majdal Salem in southern Lebanon this morning."}]