[{"id": "6a6a1c50-27d9-4822-a1cf-92e4903ae26e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27430/", "date": "2024-05-18 18:37", "message": "The IDF spokesman in Arabic instructs the residents of the following neighborhoods - Salatin, Al-Karameh, A-Atatra, and Amer, located in the northwest of the Gaza Strip, to move south and evacuate to the west of Gaza City.\n\n##\nThis means that the IDF's activity in Jabalia deepens.\nIsraeli forces entered from the east and intend to cross the entire northern area of the Gaza Strip from east to west and reach the coastline."}, {"id": "d562200f-a894-4846-8cec-98f89cde3d15", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27428/", "date": "2024-05-18 18:33", "message": "Beirut: Demonstrations and clashes between Lebanese security forces and bikers.\n\nThe reason: the Lebanese police launched an operation to confiscate unlicensed motorcycles.\n\nAt noon, as demonstrations heated, police officers in Beirut were forced to shoot at protesters who were demonstrating in front of one of the police stations in Beirut following the confiscation of the motorcycles."}, {"id": "cf3aab91-a5f2-49b8-8f81-f289bb1109bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27427/", "date": "2024-05-18 18:29", "message": "Tonight at a press conference, Israeli Minister Benny Gantz set six conditions for his party remaining part of the coalition government, setting an ultimatum for this until June 8.\n\nThe conditions that Gantz lays out for his strategic plan:\n\n1. The return of the hostages.\n2. Toppling Hamas, demilitarizing the Gaza Strip and ensuring Israeli security control.\n3. Alongside maintaining Israeli security control, establishing an American-European-Arab-Palestinian administration that will manage civilian matters in the Strip and lay the foundation for a future alternative that is not Hamas and not Abbas (PA President and Chairman Abu Mazen - AA).\n4. The return the displaced Israelis from the north of the country to their homes by September 1, and the rebuilding of the Western Negev.\n5. Promoting normalization with Saudi Arabia as part of a comprehensive move that will create an alliance with the free world and the Arab world against Iran.\n6. Adopting a bill that will ensure that all Israelis serve and contribute to the national effort (referring to the ongoing issue of Haredi men being exempt from military service -AA). \n\n##\nGantz with a new phrase for #the_day_after the war:\n\nNot Hamas and not Abbas."}, {"id": "0ce38a86-d707-47d0-b4b2-c7d4474bcb51", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27426/", "date": "2024-05-18 18:12", "message": "UNRWA: 800,000 Gazans were forced to evacuate Rafah since the ground operation in the city began.\n\n##\nAccording to Israeli media, the number of evacuees from Rafah has reached the million mark."}, {"id": "8a5d3cf4-4be7-4715-b900-165ecf995316", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27425/", "date": "2024-05-18 18:11", "message": "Footage by the IDF spokesman: Soldiers from the IDF's Paratroopers brigade take down Palestinian terrorists one by one, as they fled to the roof of a building in Jabalia, northern Gaza Strip."}, {"id": "8d57e1e5-71c7-46b5-b6c9-b78f0c9db7f9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27424/", "date": "2024-05-18 17:40", "message": "IDF spokesperson: The IDF and the Shin Bet rescued the body of Israeli hostage Ron Binyamin, who was murdered by Hamas on Oct 7th.\n\nThe body of the late Ron Binyamin was recovered in a joint operation by the IDF and Shin Bet.\n\nAccording to verified intelligence information in our possession, Binyamin was murdered during the brutal terrorist attack on October 7th during the siege of Mefalsim, and his body was kidnapped to Gaza by Hamas terrorists.\n\nHis body was recovered along with the bodies of hostages Yitzhak Gelanter, Shani Louk and Amit Buskila.\n\nAfter an identification procedure, IDF representatives notified the family. The IDF and Shin Bet share in the family's grief at this difficult time.\n\nThe IDF and the Shin Bet continue to take all operational and intelligence measures, while taking operational risks, in order to realize the most important national mission of returning all the hostages."}, {"id": "9040778f-b5df-4108-b534-ff8e04ca9141", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27423/", "date": "2024-05-18 17:30", "message": "Palestinian channels: Anas Shabaneh, the eldest son of Abu Anas Shabaneh, the commander of the Rafah Brigade in Hamas's Izz a-Din al-Qassam Brigades and one of the most senior military commanders left in Hamas, was killed this morning in an exchange of fire with IDF soldiers in Rafah's A-Tanour neighborhood.\n\nTwo of his younger brothers, Mahmoud and Abd Al-Nasser were both killed on Oct. 7th."}, {"id": "a17ee64c-bfb5-4a54-bdfa-972d4140e90f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27422/", "date": "2024-05-18 17:20", "message": "Aid entering the Gaza Strip via the American-built pier."}, {"id": "482298d1-d12e-403c-8e0d-983eaa776c12", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27421/", "date": "2024-05-18 17:19", "message": "For the first time in the history of Saudi Arabia: a women's swimwear fashion show.\n\nThe swimwear that was presented in the show was designed by Moroccan designer Yasmina Qanzal."}, {"id": "a75910ac-8c41-4a15-a27a-6133d9a89eee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27418/", "date": "2024-05-18 14:04", "message": "The Palestinians report that 5 Hamas policemen were killed in an IDF attack earlier today on Ishrin Street, in the center of Nuseirat (the center of the Strip) near the \"Al Iman\" flour mill."}, {"id": "80a3f9cf-0bfa-471a-a8d9-94ecb59d58a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27417/", "date": "2024-05-18 13:50", "message": "Jenin: Combat engineers of the Palestinian Authority police arrived in the area of ​​Yahya Ayash square in Jenin following a report that a bomb had fallen from a fighter plane was located there."}, {"id": "1a7f4f58-6d50-498d-a70b-1e134408384a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27416/", "date": "2024-05-18 13:48", "message": "The Palestinians report 22 dead in the attack on the house of the Al-Silawi family in the Jabaliya refugee camp in the northern Gaza Strip, not far from the Kamal Adwan hospital."}, {"id": "d694bcbf-74a1-4924-acc7-c09130935936", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27413/", "date": "2024-05-18 13:44", "message": "IDF Spokesperson: The Givati ​​Brigade has killed about 80 terrorists in East Rafah.\nSignificant underground infrastructures were located.\nMany weapons were located, including a large number of anti-aircraft weapons (pictured)."}, {"id": "3cb6b484-c995-4152-9167-7ab82fcd8334", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27409/", "date": "2024-05-18 13:43", "message": "Lebanese media: Israel attacked a vehicle in the last minutes in the duty free zone on the border between Lebanon and Syria.\n\nFollowing reports state the attack was carried out in Syrian territory immediately after the vehicle entered Syrian territory from Lebanese territory.\n\nAl-Saudi Arabia Network: The target of the attack on the Syria-Lebanon border was saved."}, {"id": "074baa0c-a2c8-4a27-b1fc-bf602b5a34de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27408/", "date": "2024-05-18 13:41", "message": "The markets in the center of the Gaza Strip are full of goods from Israel - consumer prices are falling\n\nA five minute tour in the market of Deir al-Balah in the center of the Gaza Strip this afternoon.\nThe goods from Israel fill all the baskets in the market.\nAccording to the Gazan filming the video, there is a noticeable drop in prices in the market following the arrival of goods from Israel (not humanitarian aid, but goods purchased from Israel by Gazan merchants).\nAccording to him, there are fruits that have not been seen in the Gaza Strip since the beginning of the war.\nThe Gazan filming says that Gazans need more quality goods from Israel as they have been coming in the last few days. If more goods come in from Israel, he expects that the prices will continue to fall.\n\nThe prices in the market, based on the video:\n\nApple - 15 NIS per kilo\nLemon - 20 NIS per kilo\n5 eggs - 10 NIS\nClementine 20 NIS per kilo\nAvocado 25 NIS per kilo\nMelon - 9 NIS per kilo\nSugar - 9 NIS per kilo"}, {"id": "937b7cdf-a150-4bfc-ba3d-afe593d039d6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27407/", "date": "2024-05-18 13:34", "message": "The Deir al-Balah area in the center of the Gaza Strip is filling up with tents and Gazans who came from Rafah."}, {"id": "6fb695a6-4282-4fcd-8f04-3faf76cb934c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27406/", "date": "2024-05-18 13:33", "message": "The Philadelphia axis area in Rafah in the south of the Gaza Strip is becoming empty of Gazans and tents."}, {"id": "f1bcf51c-7bc1-422f-aa58-c44a73980191", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27405/", "date": "2024-05-18 13:33", "message": "Prime Minister of Slovenia: We will recognize a Palestinian state next month."}, {"id": "899e08ba-9b99-48fa-87eb-fada7d07bd5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27404/", "date": "2024-05-18 13:32", "message": "On the other side, the words of the Israeli Knesset member Ram Ben Barak stand out today and are echoed on many Arab channels:\n\n\"Our war in Gaza is pointless. And of course we will lose it.\n\nWe are returning to fight in areas where we have already fought, we are losing many soldiers and our economy is collapsing.\n\nWe are losing in the international arena and our relations with Washington are collapsing. We have not achieved any success.\""}, {"id": "43f48527-6646-4f45-a1fd-fb2f023251db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27403/", "date": "2024-05-18 13:28", "message": "Senior Hamas official Khaled Mashal:\n\n\"We are facing a historic moment and there is an opportunity to defeat Israel and dismantle the Zionist project. Our enemy is retreating and losing its self-confidence after 8 months of fighting. We call for (demonstrations of) outrage by the Arab public around the Israeli-American embassies.\"\n\n##\nEverything revolved around the firm stance. Whoever is patient will win. Whoever gives up and surrenders will lose. It is a campaign about willpower and patience.\nA campaign whose results will affect how the Middle East (and Israel within it) will look in the decades to come."}, {"id": "d4d31ecf-3074-4127-bfd3-68deb4217cfe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27402/", "date": "2024-05-18 13:26", "message": "The Saudi prince Turki bin Salman with his new Tesla  cybertruck..."}, {"id": "4ec124f2-d29f-4bbc-a1af-ca6e0e2c67b5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27399/", "date": "2024-05-18 11:23", "message": "Israeli goods fill the markets of the center of the Gaza Strip (imported by Gazan merchants via the Kerem Shalom crossing).\n\nChips, sugar, chicken liver and wings - all Israeli!"}, {"id": "c59f7421-9ccc-43a4-b94e-128084f0d1f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27398/", "date": "2024-05-18 11:22", "message": "In the last hour, the Palestinians report 12 casualties in an IDF attack on the \"Ikara\" library in the Jabalia refugee camp in the northern Gaza Strip, where a shelter for displaced Gazans is located.\n\nIn another incident, the Palestinians are reporting that a Gazan named Azami Khalil Abu Daqa was killed in an attack on a vehicle near A-Shahkoosh Street in the northwest of Rafah. Four more Gazans were injured."}, {"id": "183b9c9c-10b1-462d-9216-2592461dc93a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27393/", "date": "2024-05-18 10:32", "message": "The remains of the command room that was targeted yesterday in an airstrike in Jenin's A-Damaj neighborhood."}, {"id": "35ed6f21-aabf-49ad-a3f0-8a61e4a7ee6d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27392/", "date": "2024-05-18 10:31", "message": "The Palestinian Crossings Authority: The Kerem Shalom crossing has been closed to aid trucks for 12 days in a row.\n\n##\nOver the past few days, about 50 trucks of goods have entered through the crossing every evening, for merchants within the Strip. \n\nThis refers to the goods that were paid for and it is not the free humanitarian aid that the Gazans were used to during the first months of fighting.\n\nRafah crossing is still closed."}, {"id": "efa35bf6-649d-41d2-9dbd-bb7985679a84", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27391/", "date": "2024-05-18 10:30", "message": "The Palestinians are wondering why aid trucks at the floating pier have yellow (Israeli) license plates..."}, {"id": "44776aec-b122-4548-bdcb-fd96daa1738c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27390/", "date": "2024-05-18 08:04", "message": "The beginning of the operation of the American floating pier in Gaza. Footage from yesterday."}, {"id": "f8bade7b-5c62-4fa1-a8be-20dd3ee71c45", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27387/", "date": "2024-05-18 08:03", "message": "The assassination of Sharahabil a-Seid 👆 in Lebanon near the border with Syria\n\nThe IDF spokesman announced last night that the IDF attacked and eliminated the terrorist Sharhabil Ali A-Seid, a senior member of the terrorist organization the Islamic Jama'a in Lebanon - who worked in cooperation with Hamas.\n\nThe military wing of Hamas officially announced this morning that A-Seid was in fact a commander in its ranks."}, {"id": "f39529b6-6a6d-4016-941a-e60c18cae3a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27386/", "date": "2024-05-18 07:43", "message": "The IDF spokesman reported last night that the attack in Jenin was carried out using a fighter jet and a helicopter . \n\nAccording to the report, the terrorists' command room was targeted in the attack. According to intelligence reports, the men, who were still inside the command room, were preparing an immediate attack."}, {"id": "613f1dbf-92ae-4a00-befe-55965e9a25f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27385/", "date": "2024-05-18 07:39", "message": "Palestinian channels:\nFIFA, the International Football Federation, refuses the Palestinian request to vote on the suspension of Israel's membership in the federation.\n\nAccording to FIFA, the issue should be examined by the FIFA Council."}]