[{"id": "3e9acbfd-d1fc-413b-a144-ec748a96abba", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:23", "message": "The Palestinians report 19 dead and more than 50 wounded in the attack last night on three houses (homes of the Jamasi, Ramlawi and HatHat families) between the Tafah neighborhood and Shejaya neighborhood in Gaza City."}, {"id": "1191d475-0fd7-4514-8b43-ffbf63748ce2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28923/", "date": "2024-06-15 08:15", "message": "\"Day of Arafah\"\nSince the morning hours hundreds of thousands of pilgrims began to flow to Mount Arafah in Mecca, where they are expected to stay today, in the heavy heat (49 degrees in the shade and a ground temperature of more than 70 degrees), as an essential part of fulfilling the Hajj pillar which every Muslim must do at least once in his life.\n\nThe day of Arafah is a day of fasting and forgiveness of sins, a day when \"the gates of heaven are opened\" according to the Muslim faith.\n\nOn the occasion of this day, the spokesman for the military wing of Hamas, Abu Obaida, tweeted this morning a special tweet in which he called on the pilgrims in Mecca to pray for their brothers in Gaza who are fighting to free \"the third place in his thinking for Islam - al-Aqsa Mosque\"."}, {"id": "1d3c00ea-7d38-4611-a632-fe448047e68c", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:13", "message": "The Shifa hospital complex in Gaza City before and after in a satellite image."}, {"id": "3ebd92f9-49d0-4eae-be2b-df4faebbaec4", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:13", "message": "American officials told CBS: Our interpretation of the recent Israeli strikes inside Lebanon is that they are preparing the battlefield for a sweeping attack."}, {"id": "db8bef8e-41ea-4984-8646-a5905aa5fd53", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:10", "message": "The Lebanese Al-Akhbar channel, which is affiliated with Hezbollah, publishes that the Americans are waiting for Israel to finish the operation in Rafah in order to try to revive the negotiations for a deal.\nAccording to expectations, the operation in Rafah is expected to be completed within two weeks."}, {"id": "d63976fb-fb14-4520-8e9b-7b3a9b2390cd", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:10", "message": "US Central Command:\nThe Greek ship M/V tutor that was hit by missiles fired by the Houthis on 12.6 began to sink.\nThe ship was abandoned by the crew. One of the crew is still missing since the ship was hit.\n\nIn another Houthi attack, the Polish ship M/V Verbena was damaged.\nOne of her crew members was seriously injured."}, {"id": "9cfea90d-2758-48a0-9491-877c0a9ea8ae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28916/", "date": "2024-06-15 08:09", "message": "US Central Command: The American floating dock in Gaza will be temporarily dismantled and moved to Ashdod port due to weather conditions.\n\nSince it was installed on May 17, 3,500 tons of aid have been brought into the Strip through it (this is equivalent to about 175 trucks entering by land. There were days during the war when more entered through the Rafah crossing in one day than the floating dock brought in in a month)."}, {"id": "11844092-0572-4cbc-96e9-729269d528d8", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:08", "message": "South Lebanon: The residents of the village of Sheba announced tonight that they lost control of the fire near their village. They call for immediate assistance from the Lebanese rescue agencies"}, {"id": "87678df6-52a6-4d56-9b1a-1b1e9b7c137a", "channel_id": 1560386984, "url": "", "date": "2024-06-15 08:07", "message": "Lebanese channels report that a Palestinian was killed and wounded in an Israeli drone attack on a motorcycle between Aitaroun and Bint Jabil in southern Lebanon."}]