[{"id": "f3bb44c8-d684-482f-a9ed-2602338e4b25", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28475/", "date": "2024-06-05 21:16", "message": "Many Lebanese channels are reporting that Israeli fighter jets are breaking the sound barrier in the skies of southern Lebanon at this time and releasing flares."}, {"id": "65a1642d-604b-4fe2-b5b3-b9c011547656", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28474/", "date": "2024-06-05 21:14", "message": "The Houthis in Yemen reveal for the first time: on June 3rd we launched the \"Palestine\" ballistic missile towards Eilat.\n\nOn the same day, the IDF spokesperson reported on an interception carried out by the Arrow system"}, {"id": "0a3c3a24-0c97-442e-a07f-95bca246cc82", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28473/", "date": "2024-06-05 21:13", "message": "President Putin:\n\nThe Israeli response to the attack by Hamas is not similar to a war but to total destruction for the residents of the Gaza Strip.\n\nThe situation between Israel and Palestine is the result of the American behavior that took a monopoly on the political sphere in the region.\n\nWe will invest everything we can in solving the Palestinian issue, but while maintaining relations with Israel."}, {"id": "22261aa6-6d62-4408-848b-f0e6809b6b12", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28470/", "date": "2024-06-05 21:12", "message": "Gazans complain: sisters Noor and Na'em Abu Halima, medical students, opened an \"issue\" in Gaza. They distributed some diapers and baby formula, took a lot of pictures and raised 600 thousand dollars...\n\nNow the Gazans are asking:\nWhere's the money?"}, {"id": "9d1fdb4e-5c7d-455e-9199-61a6dbd74815", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28469/", "date": "2024-06-05 21:11", "message": "How can Israel generate enormous pressure on Hezbollah this evening without firing a single shot?\n\nYou may be surprised, but it is quite simple:\n\nDropping announcements.\n\nThe intellectual tool called \"dropping proclamations\" gained, following the war in Gaza, great power.\nAfter the IDF, during the fighting in Gaza, dropped flyers in certain areas, called on the civilian population to evacuate and later attacked those areas, a \"halo\" was created around the matter.\nEvacuation announcements create enormous pressure among the civilian population, because they know, based on proven experience, that they will be followed by fire...\n\nIf the IDF issues evacuation notices tonight in Tyre and Sidon, the effect tomorrow morning on the Lebanese front will be enormous.\nIn the proclamation itself, the responsibility of Hezbollah and its actions for the upcoming offensive by the IDF should be clearly emphasized, along with an explanation that the IDF wishes to avoid harming innocents and therefore they must evacuate Tyre and Sidon (this also sounds really humane-AA).\n\nThe next day Israel should attack Tyre and Sidon with some intensity or another in order to back up the evacuation announcements with actions and wait.... the results will not be late in coming.\n\nI would like to point out in this context that in recent months I have come across reports in Lebanon in which the dropping of IDF flyers in various areas has been denied. The Lebanese population is really disturbed by this. The Israeli messages have a reputation... worth taking advantage of."}, {"id": "89c53250-40d2-4c0c-9b22-60398b260706", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28468/", "date": "2024-06-05 18:54", "message": "The most popular video in the last two hours on the Palestinian channels.\n\nCredit: Western Wall Heritage."}, {"id": "df2d3e6c-34db-40b8-b955-3611fd7bf3f4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28467/", "date": "2024-06-05 17:00", "message": "Black flag march of Israeli Arabs, this evening in Tamra, calling for an end to the war in Gaza."}, {"id": "9ed6d884-f92a-4770-b6bd-d636e0b3cae8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28464/", "date": "2024-06-05 17:00", "message": "Palestinian channels: Minister Amichai Eliyahu, Minister Itamar Ben Gvir and Minister Bezalel Smotrich arrived at the Nablus gate."}, {"id": "5b3f0904-7e42-4163-aa95-02f03792356f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28462/", "date": "2024-06-05 16:58", "message": "IDF Spokesperson: A Significant Tunnel that was used by Terrorists for Force Build-up and Terror Activities in Rafah was Destroyed; The Troops of the 162nd Division Continue to Operate in the Area\n\nThe combat teams of the 12th Brigade, the Givati ​​Brigade, the 401st Brigade, the Yahalom Unit, and Unit 504 have been conducting precise, intelligence-based, targeted operations in the Rafah area for the past few weeks under the command of the 162nd Division.\n\nThe troops have located several significant tunnel shafts that led to a long tunnel route that reached as far as the Philadelphi Corridor. The tunnel route’s length is approximately 2 kilometers and it connects to several other routes in the area.\n\nThe tunnel that was located was extensive and contained blast doors, inside which the troops located weapons such as AK-47s, anti-tank missiles, many intelligence assets and explosives.\n\nThe tunnel route was investigated and destroyed by troops of the Yahalom Unit."}, {"id": "ddcbf323-f154-4b8d-b6f4-d0afc4130433", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28461/", "date": "2024-06-05 16:56", "message": "Hezbollah accepts responsibility for the attack in Hurfeish 👆 and states that it was carried out using several suicide drones, in response to the massacres carried out by the IDF in Lebanon and with an emphasis on yesterday's massacre in Naqoura."}, {"id": "6e881473-433b-484d-8130-6cd316d9030b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28460/", "date": "2024-06-05 16:55", "message": "Israeli media: 11 injured, including one seriously, as a result of Hezbollah shooting at a soccer field in Hurfeish (a Druze town in the north of Israel -AA)"}, {"id": "84714d47-da11-4c52-a18c-cd3f143ab9a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28459/", "date": "2024-06-05 16:54", "message": "A confrontation between a Palestinian journalist and one of the Israelis who came to the parade of flags at the Nablus gate."}, {"id": "83e73b03-8a3f-4a10-9118-6ad1a2a7d065", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28458/", "date": "2024-06-05 16:54", "message": "Lebanese channels claim that the IDF is firing \"incendiary shells\" at Khiam (pictured) and at Kafrkela in southern Lebanon in order to start fires."}, {"id": "e1a5348a-52c0-4847-b0f0-5b2f4ef92d48", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28452/", "date": "2024-06-05 14:43", "message": "The Houthis in Yemen launched a counter-procession - in protest of the parade of flags in East Jerusalem."}, {"id": "c93fbb0e-3402-436b-a80f-06891f71fe1a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28448/", "date": "2024-06-05 14:42", "message": "More recent documentation from the Nablus Gate in East Jerusalem."}, {"id": "aedb9819-222d-4583-add6-da73412276e4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28444/", "date": "2024-06-05 14:42", "message": "Documentation from the Nablus Gate area - the barometer of East Jerusalem."}, {"id": "5eb9f7f9-7bec-404b-8cb6-aac300c70616", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28443/", "date": "2024-06-05 14:40", "message": "Speakers: documentation of the singing of the Israeli national anthem at the Temple Mount shared on Palestinian channels in the last few hours."}, {"id": "2a8b0a98-6cc3-4898-acc7-2121d1203611", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28442/", "date": "2024-06-05 14:38", "message": "The Lebanese report fires between Huola and Markhaba in southern Lebanon following the firing of phosphorus bombs by the IDF."}, {"id": "13a64f72-51c5-4483-9dc7-a895befdbfc8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28441/", "date": "2024-06-05 13:56", "message": "Hezbollah in an official announcement:\nAt 14:00 we hit the Iron Dome battery in Ramat Naftali with a guided missile."}, {"id": "a53b76cc-d27a-459b-b596-3d2597369edf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28440/", "date": "2024-06-05 12:59", "message": "PA Prime Minister: We are ready to operate the Rafah crossing according to the agreement from 2005 (the post-disengagement agreement - EA), on the condition that Israel withdraws from the crossing."}, {"id": "adb0473a-99a9-43a5-8233-d5237fef74c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28432/", "date": "2024-06-05 12:46", "message": "Residents of the Bureij refugee camp in the center of the Gaza Strip are moving west, following the activity announced by the IDF yesterday. This is despite the fact that no evacuation instruction was given by Israel."}, {"id": "76ad40a7-fa2a-4427-b3b4-dbf4d2c6c127", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28431/", "date": "2024-06-05 12:44", "message": "The Lebanese are reporting large fires in Aitaroun and Maroun al-Ras in southern Lebanon as a result of IDF shelling."}, {"id": "b5157f51-efe2-4ee7-be75-f479e1bd68d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28430/", "date": "2024-06-05 12:44", "message": "Coming full circle with a Gazan writer named Kawther:\n\"My father was born in a tent in 1950 and died in a tent in 2024.\"\n\n#tufan_alaqsa"}, {"id": "6f3a7cc6-802f-4903-b31b-c9bd528f5e91", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28429/", "date": "2024-06-05 12:42", "message": "East Jerusalem channels:\n\nميلشيات المستوطنين تنظم \"مسيرة أعلام\" تهويدية في مدينة اللد المحتلة، اليوم.\n\n\"The settler militias are organizing a 'Jewish procession' of flags in the occupied city of Lod today.\""}, {"id": "6c34bb45-173e-4dd1-a90b-32b8472e7827", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28427/", "date": "2024-06-05 10:00", "message": "Many Arab media cite this morning's report by Israeli media according to which the government approved the recruitment of 50,000 reserve personnel, in preparation for the possibility of an escalation in the north."}, {"id": "f5f82c40-58f3-4bbd-a65a-ad0430319fc6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28426/", "date": "2024-06-05 10:00", "message": "The market area adjacent to the Nablus Gate in the Old City of Jerusalem."}, {"id": "506771ea-8a67-4f21-b39f-b522c99e3c19", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28425/", "date": "2024-06-05 10:00", "message": "Palestinian channels:\n\nمستوطن يقتحم المسجد الأقصى مرتدياً أداة الصلاة اليهودية \" التيفيلن\"؛ لأول مرة منذ احتلاله.\n\n\"A settler invaded Al-Aqsa wearing a Jewish prayer accessory - tefillin - this is happening for the first time since the occupation of Al-Aqsa\""}, {"id": "f15a62d9-1e3a-4524-8841-936b885eb4d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28424/", "date": "2024-06-05 08:56", "message": "The Prime Minister of France welcomes President Biden who flew to France to take part in the ceremonies commemorating the 80th anniversary of the invasion of Normandy."}, {"id": "71fdc4a1-48b7-4e45-baf9-9ab76b3ceaea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28423/", "date": "2024-06-05 08:55", "message": "East Jerusalem media:\n\"1,119 settlers invaded Al-Aqsa since the morning hours\""}, {"id": "b77b6889-771f-49d4-8b8b-a111000600c4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28421/", "date": "2024-06-05 08:55", "message": "The headline of the Egyptian \"Al Messa'\" newspaper today 57 years ago - the first day of the Six Day War:\n\"The Arab army is on its way to Tel Aviv...\"\n\nIn the headline of another newspaper a map was attached showing how the Arab forces are surrounding the State of Israel... \n\n##\nEven then, as today, the Arab media sold their readers tales of false victories. We all know how the Six Day War started and how it ended. \n\nWhat has changed since then are the traditional Israeli media which, instead of praising the achievements of the soldiers in battles (and there are many of them), consistently and continuously try to suppress the spirit of the people and explain that Israel is losing."}, {"id": "d3e9d84b-7d16-4da8-8978-66eea2a60b88", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28420/", "date": "2024-06-05 08:50", "message": "IDF activity in the Bureij area:\n\nYesterday, the IDF announced a ground operation in the Bureij refugee camp area in the center of the Gaza Strip.\nPalestinian sources report this morning that the IDF forces have not entered the territory of the Bureij refugee camp and are now in the Makbola area in the southeast of the camp, near the border fence with Israel, where they are carrying out excavation work using engineering tools."}, {"id": "686f1420-9318-4fa5-a735-e2f0adc138a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28419/", "date": "2024-06-05 07:11", "message": "Graphic image, viewer discretion advised\n\nThe shooting incident in the compound of the American embassy in Lebanon👆: on the vest of the terrorist who was killed by the Lebanese army it is carelessly written:\nIslamic State (ISIS)\n\nAccording to some reports, he has Syrian citizenship"}, {"id": "49455dca-9b7e-4009-857f-854360da1ee6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28418/", "date": "2024-06-05 07:01", "message": "Commander of the Iranian Revolutionary Guards, Hossein Salami:\nThe Zionists should wait for a response following the assassination of Saeed Aviar (the Iranian military advisor who was killed in an attack attributed to Israel in Aleppo, Syria 👆)."}, {"id": "04d1d471-7d77-46af-a73c-6f69fa813052", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28417/", "date": "2024-06-05 06:46", "message": "The exchange of fire near the US embassy in Lebanon."}, {"id": "29aa4472-fae2-422e-8401-c763d62c18c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28416/", "date": "2024-06-05 06:45", "message": "The Lebanese news network LBCI reports on a shooting that lasted nearly half an hour in the area of ​​the US Embassy in Lebanon.\n\nLebanese media: There was a shooting attack on the American embassy in Lebanon.  The Lebanese army managed to kill one of the attackers.  There are wounded among the security force of the American embassy."}, {"id": "cd641bd0-4623-469d-93f9-5209ac21121f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28415/", "date": "2024-06-05 06:44", "message": "A picture I took from a Gazan channel: thing are under control on the border with Egypt."}, {"id": "c01d796d-9b32-4239-b9e7-cfe0f1786374", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28414/", "date": "2024-06-05 06:43", "message": "As part of his visit to Syria, the new Iranian foreign minister (replacing the minister who was killed in the crash) came to kiss and caress the Shiite saint A-Sayida Zainab in southern Damascus."}, {"id": "03bdfdbb-53ff-4cfb-b8c8-63ee31c8773d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28413/", "date": "2024-06-05 06:42", "message": "The Gaza news agency Shahab, which is affiliated with Hamas, publishes documentation from the \"invasion of Al-Aqsa\"."}, {"id": "4a960dce-cb18-40fc-8156-3b830e766485", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28412/", "date": "2024-06-05 06:41", "message": "East Jerusalem channels: \"Over 500 settlers invaded Al-Aqsa since this morning\""}, {"id": "454ddee1-ad1f-4c34-97b4-13ca5661e8cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28411/", "date": "2024-06-05 06:41", "message": "Kamal Khatib, the deputy head of the northern faction in the Islamic movement, calls on the masses of Israeli Arabs to urgently go to the Temple Mount, where \"the settlers intend to hold the flag dance procession today\""}, {"id": "e3b37b3b-6186-4dd8-a9b1-1393d20f7c33", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28410/", "date": "2024-06-05 06:40", "message": "Intensive American efforts to achieve a ceasefire in Gaza\n\nAmerican National Security Adviser, Jack Sullivan:\n\n1. We are not referring to various statements in the various media regarding Hamas's response to the proposal. We are only waiting for the official answer from Hamas which will be delivered by the Qataris.\n\n2. We continue to press the Israelis regarding an overall strategy to end the fighting.\n\n3. We hope that Hamas will agree to the proposal as the best way to end the fighting, release the abductees and increase aid.\n\n##\nAt the same time, Egyptian media are reporting the arrival in Cairo of a high-ranking Islamic Jihad delegation led by Ziyad al-Nakhalah, the movement's secretary general (who has not been seen in public for many weeks - AA).\n\nDelegations of the Palestinian factions also arrived in Cairo, at the invitation of the Egyptian intelligence, including a delegation of the Popular Front led by the deputy secretary general Jamil Mazhar.\n\n##\nThe head of the CIA William Burns will arrive in Doha, Qatar to conduct the negotiations for a close deal.\nSenior American officials are also in Cairo, at the same time as the heads of the Palestinian factions are being summoned by Egyptian intelligence.\n\n##\nThe US is using its weight with Turkey so that it will put pressure on senior Hamas officials to agree to the deal.\n\n###\nThe Biden administration is running a massive, multi-dimensional pressure cooker to advance the proposal announced by President Biden on Friday:\nPressure on Israel, pressure in Qatar, Egypt, Turkey...\nBut I still don't understand what changed...\nThe dispute between the parties is clear and stated:\n\nIsrael wants to continue the war as a condition for accepting the offer.\nHamas wants a declaration with guarantees of a permanent ceasefire.\nIt's black and white.\nAll around there is a particularly thick American smoke that tries to square the circle and in less subtle words: to work on one of the parties so that he gives up on his very clear condition because without it there will be no deal. To this end, the new marketing campaign was launched on Friday.\nIn the end it boils down, as mentioned, to only one thing: the war will be stopped completely or it will be possible to renew it."}, {"id": "f889bb3d-7a75-41dc-ba3e-c943baed0ef6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28409/", "date": "2024-06-05 06:36", "message": "USA: yesterday the American Congress approved, with a large majority of 244 supporters against 155 opponents and 27 abstentions, a bill to impose sanctions on the ICC - the Criminal Court in The Hague following its intention to issue arrest warrants against senior Israeli officials in the context of the war in Gaza.\n\nThe bill will now be transferred to the upper house of representatives - the Senate.\nIt is important to note that among the 244 supporters of the law there were also 42 members of the Democratic Party, despite the opposition of Biden and the heads of the American government to the move."}]