[{"id": "e2fa1bf4-f7af-4cc0-bdfe-595767334e2c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32270/", "date": "2024-08-11 20:45", "message": "The IDF attacked a short time ago, after an evacuation alert, the home of Jamil Mezher, the deputy secretary general of the Popular Front, which is located near the Abu Zarar intersection in the west of the Nuseirat refugee camp in the center of the Gaza Strip."}, {"id": "3b4930ba-b833-477c-ab72-c5af76e576e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32269/", "date": "2024-08-11 20:43", "message": "The military wing of Hamas accepts responsibility for today's shooting attack in Mehola, in the Jordan Valley, in which an Israeli citizen was murdered and another wounded."}, {"id": "3f1cab0b-7e80-43e7-9173-ab0d4f0de023", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32268/", "date": "2024-08-11 20:43", "message": "One of the \"legends\" that the Palestinians have been telling in the media since the attack on \"a-Taba'een\" school early Saturday morning is that since it was not possible to identify the dead who were scattered to pieces, the Palestinian rescue workers counted the bodies according to the weight of the meat (sorry for the graphic description) collected in bags - according to a reference point of 70 kilos per martyr....\n\nThis is of course rambling nonsense but caught on quite well on social networks and even earned a cartoon: \"every 70 kilos is a martyr\"."}, {"id": "b9f48440-8b37-40fd-8829-b503040a255f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32267/", "date": "2024-08-11 19:14", "message": "Hezbollah announces another death in its ranks:\n\nHassan Mustafa\n\nHe was injured in an Israeli UAV attack about a week ago in Beit Leif (Aug 4) in southern Lebanon and died today of his wounds.\n\nNumber 407"}, {"id": "8502fcde-bcc5-473d-affa-29e082ac78d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32266/", "date": "2024-08-11 19:13", "message": "Hamas publishes an official proclamation in response to the joint announcement 👆 of the President of the USA, the President of Egypt and the ruler of Qatar calling for the renewal of the negotiations this week:\n\nWe demand that the mediators present a plan for the implementation of what was presented to the movement on July 2 and on which the movement agreed, in accordance with the proposal of Biden and the Security Council - instead of going to more rounds of new negotiations or new proposals that are used as a cover for the continuation of the genocide in Gaza.\n\n##\nSinwar's signature is clear on the message. This is his first move as chairman of the political bureau of Hamas.\nSinwar wants the pressure to be on Israel.\n\n##\nAnother point to think about in this context: if Hezbollah or Iran decide to respond this week, it will not derail the negotiations..."}, {"id": "beb675e9-53db-4f49-a8cf-3ead9ee17657", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32264/", "date": "2024-08-11 18:00", "message": "Hezbollah announces two deaths in its ranks:\n\nMuhammad Haidar, from the village of Blida.\nAli Hejazi, from the village of Derdghaiya.\n\nBoth were killed in the UAV attack on the motorcycle 👆 on which they were riding in Taybeh in southern Lebanon.\n\n406 dead for Hezbollah since the beginning of the war."}, {"id": "80b9e549-f18e-4ccb-98c5-8f5a141c9429", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32264/", "date": "2024-08-11 17:58", "message": "The Lebanese Al-Mayadeen channel (Hezbollah-affiliated) responds to the Israeli government's decision approved today, under which the channel's equipment will be confiscated and its websites will be blocked:\n\n\"The Israeli occupation once again reveals its true face - the hostility towards the free professional media committed to humanitarian issues everywhere and in particular the issues related to the Palestinian people in the Gaza Strip.\""}, {"id": "0e7c430b-623f-4ac8-bbf2-a4e895a3ea31", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32264/", "date": "2024-08-11 17:56", "message": "Hamas in response to the words attributed to Minister Israel Katz👆: The Zionist foreign policy to destroy the Jenin camp is an expression of the genocidal mentality that inhabits the occupation leaders."}, {"id": "361ff973-973f-482e-a5d1-119ea58d0e6c", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73052/", "date": "2024-08-11 16:45", "message": "Lebanese channels report that 4 people were slightly injured in an attack on a three-story house in the village of Maaroub in southern Lebanon, 25 km north of the border with Israel."}, {"id": "24d8d42b-3217-4fbb-a1ec-91a931a7e78d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32256/", "date": "2024-08-11 16:44", "message": "Exception 1: The Palestinian Ministry of Health in Gaza has not yet published official data on the number of people killed in the attack on \"a-Taba'een\" school in Gaza City, a day and a half after the incident.\n\nException 2: The Palestinian Ministry of Health in Gaza did not publish the daily death toll figures that are published every day in the morning-afternoon hours.\n\nI don't remember anything like this since the beginning of the war.\nApparently the \"school massacre\" figures do not match reality and they are afraid of losing credibility."}, {"id": "3ed8635d-c9a3-4a71-ac03-10c59fcbf7e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32255/", "date": "2024-08-11 15:20", "message": "Next to him is the contestant Iman Abu Aram from Birzeit who claims to have lost 39 kilos in ten months of administrative detention in a prison in Israel."}, {"id": "068fe794-051e-440b-9198-daa083276fd0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32254/", "date": "2024-08-11 15:18", "message": "Maher Barkan from Hebron was released today from an administrative arrest of 10 months"}, {"id": "d9f95dfa-0174-4326-9e25-0cccd5f70a83", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32253/", "date": "2024-08-11 15:17", "message": "Trump's campaign team announces three televised confrontations with Kamala Harris on the following dates:\nSept 4 on Fox News\nSept 10 on the ABC network\nSept 25 on the NBC network"}, {"id": "7bba8feb-db88-4fca-8c3a-947b7238c488", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32252/", "date": "2024-08-11 15:16", "message": "The Palestine Square billboard in Tehran.\n\nIn Hebrew:\n\"You received a military blow on October 7th and a political blow on August 7th\nThe additional blow is close...\"\n\n##\nI'm still trying to understand what the political blow was on August 7..."}, {"id": "cdcd9b9e-bca5-48eb-8072-c2d6a9e5d5a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32250/", "date": "2024-08-11 15:11", "message": "The motorcycle that was attacked about an hour and a half ago in Taybeh in southern Lebanon."}, {"id": "12270102-31a7-4409-8246-aa9eb7f41be0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32249/", "date": "2024-08-11 15:09", "message": "Lebanon: Lebanese channels report that Air Force planes are breaking the speed of sound throughout southern Lebanon and over Beirut.\n\nIn the video, documentation from the Aadloun area."}, {"id": "1ba1bed6-3fd8-485a-a804-f82ffc677cb0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32248/", "date": "2024-08-11 13:54", "message": "The cigarette announcements have become the talk of the day among Gazans on social networks.\n\nEveryone wants nicotine. It's a sensitive spot...\n\nPoor Abu Khader from Deir al-Balakh - there they didn't drop any..."}, {"id": "e6d7c829-a5cc-432b-b133-4813aa41032a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32247/", "date": "2024-08-11 13:53", "message": "Lebanese channels report casualties in an Israeli UAV attack on a motorcycle in the village of Taybeh in southern Lebanon a short time ago.\n\nAccording to unofficial sources there are two dead in this attack."}, {"id": "eb0ae119-5254-4890-bc1c-7eb03782768b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32246/", "date": "2024-08-11 13:52", "message": "The spokesman of the Iranian Revolutionary Guards congratulates himself and his comrades:\n\nThe fear of the Iranian reaction to the elimination of Haniyeh took over the Zionist entity and its settlers."}, {"id": "588e15d1-7bea-410b-b403-c782f09b15f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32243/", "date": "2024-08-11 13:52", "message": "High demand for the cigarette announcements that the IDF threw over the Mawasi area in Khan Yunis\n\nGazans report that the IDF dropped flyers on Mawasi in Khan Yunis that read:\n\"Smoking is dangerous, but Hamas is more\"\n\"Hamas is burning Gaza\"\nas well as a cigarette and a contact phone number \"for those who want more...\"\n\nA prominent Gazan wrote online that the number of calls received by the number published by the IDF on the announcement was enormous.\nThe callers from Gaza asked when cigarette flyers will be dropped in the north of the Gaza Strip and when in Deir al-Balah in the center of the Gaza Strip..."}, {"id": "2936191f-bfbc-458f-bcd8-4898063911df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32242/", "date": "2024-08-11 13:49", "message": "IDF: Following the initial report regarding the shooting attack in the area of the Mehola Junction on Route 90, terrorists opened fire from a passing vehicle at a number of vehicles in the area. As a result of the attack, an Israeli civilian was killed, and an additional Israeli civilian was injured and is currently receiving treatment from medical teams. IDF soldiers have begun pursuing the terrorists, blocking routes, and conducting thorough searches in the area."}, {"id": "07e78c07-03ce-4d72-92dd-ec6624f906a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32241/", "date": "2024-08-11 12:33", "message": "Sources identified with the Shia axis: 6 dead and 15 wounded from among the Shia militias in the UAV attack on the vehicle in al Bukamal in eastern Syria."}, {"id": "cf723d86-2188-4b08-aabe-bd6e8a7ef8b0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32240/", "date": "2024-08-11 12:32", "message": "\"Who will replace Sinwar?\"\n\nA good question (with 1.2 million views) asked yesterday by an Algerian journalist, who lives in Europe and works against the Iranian axis.\n\n#the_day_after_sinwar"}, {"id": "72c191fe-affe-4d76-973b-f37a576624b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32233/", "date": "2024-08-11 12:31", "message": "Statements attributed to Israel's Minister Katz according to which the residents of the Jenin refugee camp should be treated the same as the residents of Gaza, including evacuating them from the camp, are being quoted widely in Arab media."}, {"id": "33842b88-4027-4bab-b261-34c186573dee", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73018/", "date": "2024-08-11 11:29", "message": "Palestinian sources report that a robbery took place today at the only bank branch open in the center of the Strip and in the south - \"Bank of Palestine\"."}, {"id": "37165713-a546-4813-9cf3-b112de5934ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73018/", "date": "2024-08-11 11:29", "message": "Channels affiliated with the Shia axis report an attack carried out a short time ago by an unidentified drone on a vehicle in the al Bukamal area in eastern Syria.\n\nAccording to some sources there are 4 dead as a result of the attack.\nThis is an area where mostly American aircraft operate, but there have been cases in the past of attacks attributed to Israel in this area."}, {"id": "7a95fdc2-df7e-447e-bb4f-1e9c7c280670", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73018/", "date": "2024-08-11 11:07", "message": "Islamic Jihad: Totally deny the claims of the occupation army spokesman regarding the presence of our military operatives inside the \"A-Taba'een\" school in Gaza City."}, {"id": "57f40b45-9fee-44f5-953f-5869acf87d50", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32229/", "date": "2024-08-11 10:41", "message": "Unofficial Syrian sources identified with the Shiite axis report that an Iranian cargo plane of the Ilyushin 76 type landed in the last few hours at the Hmeimim airport in Syria.\nThis airport was effectively expropriated by Russia from Assad's hands and is under full Russian control. It is unlikely that Israel will attack this field."}, {"id": "a83be845-7a39-4e40-878a-9ea7f872e21b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32228/", "date": "2024-08-11 10:40", "message": "Iran: The new Pezeshkian government\n\nToday the Iranian president-elect announced the ministers to be appointed in his government.\nDisappointment was registered among those who expected the government to bear a reformist character, as expected by those who elected the president who \"represents\" the reformist trend in Iran.\nThe government is \"a Khamenei government\" in which all the ministers were dictated from above and most of them are conservative.\nCitizens from Arab regions of Iran pointed out that they have no representation in the government - there are no ministers of Arab origin."}, {"id": "e538d2c4-de6a-4ea9-8e17-1a39395ce3b0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32227/", "date": "2024-08-11 10:31", "message": "Moving backwards..."}, {"id": "1105d77c-d787-4195-b31a-9268bbe909ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32225/", "date": "2024-08-11 10:30", "message": "Internally displaced Gazans are complaining about their fate due to the evacuation instructions they receive from Israel.\n\nAccording to UNRWA, 75 thousand Gazans have been evacuated in the last few days."}, {"id": "4eb0595d-8a1b-4523-be81-1b15696023f2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32224/", "date": "2024-08-11 10:27", "message": "Palestinian channels are publishing a satellite image from two days ago of the Hamad neighborhood which the IDF spokesman instructed to evacuate this morning.\nIn the photo you can see the layout of the displaced persons' tents in the compound before the evacuation. The buildings are also mostly inhabited..\n\nAccording to Palestinian estimations, this is the evacuation of thousands of families."}, {"id": "0dfed38d-650a-4ec8-be60-c6e1bbd05da8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32223/", "date": "2024-08-11 08:51", "message": "The area of ​​buildings A8 and A7 in the Hamad neighborhood in Khan Yunis - an area that was attacked this morning after an IDF spokesman in Arabic called the residents of the Hamad neighborhood to evacuate to the west.\nThe evacuation continues."}, {"id": "5d1d440d-164f-411c-9a63-5ef426fafd56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32222/", "date": "2024-08-11 08:24", "message": "The sons of Ismail Haniyeh, who survived and inherited their father's empire of billions, arrived full of smiles to visit the President of Turkey."}, {"id": "c5c90ee2-e82e-497c-9cfd-83ce7dffbe44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32221/", "date": "2024-08-11 08:23", "message": "Algeria asked to convene the UN Security Council next Tuesday for an urgent discussion on the \"massacre in the Daraj neighborhood in Gaza\" (the \"A-Taba'een\" school)."}, {"id": "6aa3c28b-998c-4757-9286-d7b98d19bff5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32220/", "date": "2024-08-11 07:15", "message": "Gazans began to evacuate the Hamad neighborhood in northern Khan Yunis following the IDF spokesman's announcement and the attacks in the area.\nPalestinian journalists report injuries as a result of the attacks in the Hamad neighborhood this morning."}, {"id": "29a232dd-d360-4147-94bc-392ab30d373d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32219/", "date": "2024-08-11 06:48", "message": "IDF: IDF operational activities continue across the Gaza Strip\n\nIDF troops are continuing to conduct precise, intelligence-based operations in the Rafah area. This morning (Sunday), IDF troops identified a terrorist cell exiting a tunnel shaft in the area of Rafah. The IAF struck and eliminated the terrorists."}, {"id": "91950f75-e7ab-4a0b-896e-bd695bb20605", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32218/", "date": "2024-08-11 06:46", "message": "Iran has issued a NOTAM message about a flight ban over the area of ​​the Iranian air base \"Nuja\" located near the city of Madan in western Iran.\nThe flight ban, at an altitude of ten thousand feet, will apply from August 11 to August 14 from eight in the morning to six in the evening, according to Iran time. According to the announcement, shooting will take place in this area.\n\n(Iranian time is half an hour ahead of Israeli time)."}, {"id": "4ec69587-f5e9-4adf-8a7d-0434bcec215d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32215/", "date": "2024-08-11 06:42", "message": "The attacks in the Hamad neighborhood (the area that received an evacuation alert this morning), in the north of Khan Yunis"}, {"id": "b942d420-7f2e-4b60-a730-2acff173b972", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32214/", "date": "2024-08-11 06:32", "message": "Trump's campaign team:\nMicrosoft has informed us that one of the campaign's many websites has been hacked by the Iranian government. They were only able to access public information.\nIran will not stop because we have a weak government... not for much longer."}, {"id": "a9c323e1-a391-4e7a-a8b7-841b2612be25", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32213/", "date": "2024-08-11 06:32", "message": "This morning the Palestinians are reporting attacks in the Hamad neighborhood in northern Khan Yunis - this will surely help speed up those who are delayed..."}, {"id": "8dc84fb4-c71f-439f-9811-57f1492baff7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32210/", "date": "2024-08-11 06:31", "message": "Hamad neighborhood in northern Khan Yunis before the war."}, {"id": "5473dfa8-d386-4a4c-bd05-4b11c353184e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32209/", "date": "2024-08-11 06:30", "message": "This morning, the IDF spokesman published another evacuation notice in Arabic announcing the \"adjustment of the humanitarian space\" - in fact the part of the Hamad neighborhood, which was built with Qatari funding, was removed from the humanitarian area of ​​Khan Yunis and the residents are now required to evacuate.\n\nThe IDF explains in both evacuation announcements that it was rocket fire from these areas that led to the evacuation."}]