[{"id": "6e877bdb-1140-45f8-8eb2-6d6c775a5cb4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28140/", "date": "2024-05-30 20:16", "message": "Hezbollah announces two deaths in its ranks:\n\nHussein Atawi\nSamer Yasin\n\nBoth are residents of the village of Houla in southern Lebanon, and were killed in an IDF attack 👆 this afternoon in the village.\n\n325 dead for Hezbollah since the beginning of the war."}, {"id": "ed66e8a2-c6b3-4a36-b015-76e0cdfeb07f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28139/", "date": "2024-05-30 20:14", "message": "Palestinian channels: \"10 Palestinian demonstrators were arrested by the occupation forces at a demonstration in Haifa this evening.\""}, {"id": "a1897b0e-4db5-4ad0-a695-e3bf4a3ae356", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28139/", "date": "2024-05-30 20:14", "message": "Today, the military wing of Hamas published two videos boasting two of its \"achievements\":\n\n1. Its militants managed to miss soldiers when dropping a grenade from a drone.\n\n2. Its militants managed to miss a helicopter when firing a shoulder-fired missile.\n\nIn the videos, there does not appear to be any damage or casualties, yet Hamas presents these as achievements to be shown off..."}, {"id": "b280a429-deca-4803-b52b-de75e553ff51", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28136/", "date": "2024-05-30 20:11", "message": "Hamas in an official announcement:\n\nWe showed flexibility and a positive approach to the mediators' efforts in the negotiation rounds.\n\nThe occupation used the negotiations as a cover for its continued military activity and responded to our positive approach by invading Rafah.\n\nHamas and the Palestinian factions will not be able to continue negotiations in the shadow of continued aggression against our people.\n\nWe informed the mediators today that if the occupation stops the war in Gaza we will agree to reach a comprehensive deal that will also include a prisoner swap."}, {"id": "e9283f90-67ee-4dc4-97eb-ff37f761088a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28135/", "date": "2024-05-30 18:18", "message": "A-Trans Street in the Jabaliya refugee camp in the north of the Gaza Strip - today and before October 7th"}, {"id": "7f03c785-7cda-4c18-8370-9200ff2c5e79", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28133/", "date": "2024-05-30 18:02", "message": "The IDF spokesperson reveals the tunnel in Jabaliya where the bodies of the 7 recently located abductees were found.\nThe tunnel was destroyed."}, {"id": "3992d675-eabf-47f5-9112-119d01f26404", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28132/", "date": "2024-05-30 17:48", "message": "Belgian police use water hoses to disperse anti-Israeli protesters near the Israeli embassy in Brussels."}, {"id": "2d0cee02-7823-45b8-8dff-e3fd3110a74f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28131/", "date": "2024-05-30 17:48", "message": "Unofficial Lebanese sources: two dead and several wounded in an IDF attack in Houla in southern Lebanon earlier this evening."}, {"id": "8e0ad9d1-3255-468d-9acd-8c8cf1f438b5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28127/", "date": "2024-05-30 16:43", "message": "The Palestinians report that trucks with humanitarian aid for UNRWA have arrived in Khan Yunis' Mawasi in the south of the Gaza Strip (the humanitarian zone)."}, {"id": "e52bc7a6-2d71-4352-8324-a138de1c2f77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28126/", "date": "2024-05-30 16:08", "message": "The Palestinians report at least two deaths in a vehicle attack in the center of Abu Madin, on the Salah al-Din axis near Bureij in the center of the Strip."}, {"id": "d2d055e3-125b-4432-ae39-f564df8e235a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28125/", "date": "2024-05-30 15:35", "message": "Reuters from the French Ministry of Foreign Affairs:\nWe have not yet received an answer from Israel regarding our proposal to reduce tensions in Lebanon.\nThe answer we received from Lebanon regarding the proposal is relatively positive."}, {"id": "d829f0cc-d9a8-4c66-8117-9eb4435aeec2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28124/", "date": "2024-05-30 14:40", "message": "The Slovenian government has decided to approve the recognition of a Palestinian state. After approval by the government, the matter will be put to a vote in the Slovenian Parliament.\n\nSlovenian Ministry of Foreign Affairs: This is a message that the only solution to the situation is a two-state solution."}, {"id": "3fe8d1a5-cdd0-46a3-afc2-1321c1bc4f48", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28123/", "date": "2024-05-30 14:39", "message": "The military arm of the Islamic Jihad publishes a psychological warfare video of one of its hostages (Alexander Turpanov). He looks fine physically and mentally.\nMost of the things said in the video are aimed at the heart of the political debate in Israel."}, {"id": "fe766fcf-5859-4989-b2ca-aaa9c4d8ef4f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28120/", "date": "2024-05-30 13:56", "message": "Lebanon: You might assume that what is preoccupying the Lebanese these days is the war against Israel... But on social media, the Lebanese are busy with the attached advertisement made by the internet star \"Rayal\" for Eastern Sweets in Beirut.\n\nThe Lebanese on social media, lets just say... had trouble connecting with the sexual orientation of the broadcaster Rayal and called for a boycott of the \"Eastern Sweets\" due to the distribution of LGBTQ content and damage to the social fabric in the country.\n\nThe Eastern Sweets were quick to disown Rayal and published a statement that it was a private initiative of a customer and that they had nothing to do with it.\n\nMeanwhile, Rayal is basking in the moment..."}, {"id": "26e180ad-eeda-4e07-9b84-9246ae68a447", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28119/", "date": "2024-05-30 13:45", "message": "Palestinian channels report that residents of Gaza set fire to the UNRWA warehouses in Rafah in the southern Gaza Strip after stealing all the contents of the warehouses."}, {"id": "4b998170-7297-481b-862c-26f870f3686e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28118/", "date": "2024-05-30 13:44", "message": "The IDF spokesperson reveals the place where three IDF soldiers fell 👆on Tuesday in Rafah - a booby-trapped tunnel shaft that was hidden inside a clinic in the same compound as a UNRWA school and a mosque."}, {"id": "d28f3439-9bdc-4aca-9e30-bef7a2c62e3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28117/", "date": "2024-05-30 13:34", "message": "The president of Syria, Bashar Assad wore a suit and polished leather shoes and jumped to Tehran to receive instructions from the boss, who received him in socks and sandals."}, {"id": "f67f7d1f-a0a2-45e0-a5e3-4d1872cd0c5c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28116/", "date": "2024-05-30 13:28", "message": "After Twitter suspended his main account (with hundreds of thousands of followers), Ali Shoeib, Hezbollah's home henchman, tried to promote his secondary account which had less than ten thousand followers - but this account was also suspended a short time ago... 😁\n\nAll the best to those who do the craft. An important and useful move! This is a significant neutralization of a major weapon of Hezbollah, no less."}, {"id": "817c4f6b-46b9-42fb-bd19-eb4f966525e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28114/", "date": "2024-05-30 13:01", "message": "Twitter suspended the accounts of two of the most prominent Lebanese journalists on the Shiite axis:\nHosein Mortada\nAli Shoeib (Hezbollah's home reporter on the Almanar channel)\n\n##\nTo quiet these two trumpets in their strongest arena - Twitter, is definitely a significant damage to the power of spreading the agenda of the Shia axis and Hezbollah.\n\nThanks Elon."}, {"id": "61b9a1e3-f8d0-4d63-920a-9b308e23658f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28113/", "date": "2024-05-30 12:58", "message": "Ritchie Torres, a member of the Democratic Party in the USA, addresses the students protesting in the USA, against the background of the words of the supreme leader of Iran:\n\n\"If the world's leading sponsor of terrorism is claiming you're on the right side of history, it means you're useful idiots on the wrong side of history.\""}, {"id": "403e8fc0-db58-418c-83c1-8084dd42c018", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28112/", "date": "2024-05-30 12:57", "message": "In Sweden, the local police began working with attack dogs to deal with the anti-Israeli \"Keffiyeh protesters\"."}, {"id": "4c50664d-e5fd-428c-9d34-4a8f5c9ca9dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28111/", "date": "2024-05-30 12:54", "message": "Germany: Anti-Israeli demonstration.\nThe police are trying to deal with the crowd that is throwing objects at them and calling out in English:\nShame on you! Shame on you!\n\n##\nThere is no word in German for shame?"}, {"id": "51c9d025-e971-4b93-913c-934858fa147d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28110/", "date": "2024-05-30 12:35", "message": "A resident of the Jabaliya refugee camp in the north of the Gaza Strip went over to see what had become of his house and when he found it destroyed he burst into tears and added: \"I can't...\""}, {"id": "027a0a90-1bf4-4f68-9284-ca6f22a87460", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28109/", "date": "2024-05-30 12:34", "message": "Palestinian journalists: Gazans tried to return to their homes in the Jabaliya refugee camp in the northern Gaza Strip... IDF artillery fire caused them to retreat en masse."}, {"id": "7548121c-c39c-4a17-98fb-4d2b2b40fee4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28108/", "date": "2024-05-30 12:28", "message": "Gazans visit the Jabaliya refugee camp in the northern Gaza Strip after the Israeli forces left the camp and observe the destruction that remains."}, {"id": "41640995-ebed-4386-8b7d-e8a7b1c9956b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28107/", "date": "2024-05-30 11:53", "message": "UN: The amount of food and humanitarian aid entering the Gaza Strip has dropped by two-thirds since the operation began in Rafah.\n\n##\nA tip to the guys at the UN, check how it happened that, despite what you claim regarding the reduction of aid entering the Strip, the prices of goods in the markets in the Strip dropped by hundreds of percent..."}, {"id": "315230a2-fe2f-4898-9f29-fb959c5edefd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28106/", "date": "2024-05-30 11:53", "message": "Palestinian sources claim that the IDF forces left the northern Gaza Strip (with an emphasis on the Jabaliya refugee camp - AA) and the Palestinian Civil Defense forces began searching for the bodies of the Palestinian \"martyrs\" in the area."}, {"id": "dbc477a3-579b-4b73-b4d1-8c07b2235098", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28105/", "date": "2024-05-30 10:51", "message": "Lebanese Member of Parliament Sami Jameel (Christian Al-Ktayeb Party):\nI support peace between Israel and the Palestinians.\nThis is the thing, in my opinion, that will lead to peace between Israel and Lebanon and Palestine.\nWhy are we not dealing with this issue? Is our goal an endless war?"}, {"id": "26ed8e23-41c4-4b6e-8661-675fbe38f4ae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28104/", "date": "2024-05-30 06:08", "message": "A member of the Lebanese Forces (Christian) party, Richard Kouyoumjian mocks Nasrallah in a press interview:\nGetting the residents of northern Israel to evacuate their homes has now become heroic?\nIf so, congratulations on the victory... (he is cynical - AA)"}, {"id": "da5078b1-afd0-4ec9-92e2-541c4a951ef5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28103/", "date": "2024-05-30 06:04", "message": "The Lebanese al-Mayadeen from a source in the \"resistance\" following yesterday's Israeli attack in Syria:\n\nThe reports according to which three Hezbollah members were killed in yesterday's Israeli attack on a truck in the Al Furqlus area of ​​Homs (Syria) are not true.\nThe truck driver jumped out of it, and was saved.\nThere were no Hezbollah members inside the truck."}, {"id": "a9ee9b42-ad8c-4a74-b6dc-46afc08924d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28103/", "date": "2024-05-30 06:04", "message": "Paris: French MPs Louis Boyard and Sebastien Delogu celebrate at an anti-Israel demonstration after being expelled from the parliament for waving the Palestinian flag."}, {"id": "c51bf4a3-43f4-4e82-ad2d-e5f1f551d667", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28101/", "date": "2024-05-30 06:01", "message": "The supreme leader of Iran in a direct appeal to students at US universities:\n\nYou are now on the right side of history.\nYou are part of the axis of resistance.\nYou started a legitimate fight against your brutal government that protects the \"raping Zionist entity\".\nI recommend you to get to know the Quran.\nThe axis of resistance advances through it and with the help of Allah you will achieve victory.\n\n##\nIran's supreme leader embraces the American students and includes them as part of the axis of resistance. Now they just need to convert to Islam and victory is at hand...\nunbelievable."}, {"id": "775cfecd-0869-4461-95a1-984c3009c200", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28100/", "date": "2024-05-30 05:57", "message": "Palestinian sources affiliated with the Palestinian Authority claim: the picture of the weapon shown yesterday👆 in the proclamation of the Al-Aqsa Martyrs' Brigades in Tulkarm (which claimed to have infiltrated Bat Hefer-AA) is an old picture taken from the Internet."}, {"id": "230952a3-eb96-4a2e-987a-4d67da1447b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb67776/", "date": "2024-05-30 05:56", "message": "The IDF spokesperson announced this morning the fall of three fighters:\nTwo in the ramming attack last night near Nablus and one in battle in the north of the Gaza Strip.\n\nMay their memories be a blessing."}, {"id": "5ac96eaa-1ae8-404b-af27-55d416b54e9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28095/", "date": "2024-05-30 05:52", "message": "Syria: Syrian opposition sources claim that the destruction of the residential building yesterday in Baniyas, and the killing of the Syrian girl, were caused by a Syrian interceptor missile that was launched at the Israeli warplanes that attacked in Syria yesterday evening."}, {"id": "cd57c64c-30c2-4e0e-bfb4-e91b939fd5fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28094/", "date": "2024-05-30 05:51", "message": "American Senator: Saudi Arabia is not opposed to the destruction of Hamas\n\nRepublican Senator Lindsey Graham, visiting Israel, talks about the normalization agreement between Israel and Saudi Arabia and says out loud what Saudi Arabia cannot:\n\nTo reach an agreement, Saudi Arabia wants a reduction in the scope of the fighting. The Saudi Crown Prince does not expect Israel to agree to not destroying the Hamas battalions. No one in Saudi Arabia wants Hamas to remain a military presence (in order to reach an agreement - AA).\nWhy would Saudi Arabia invest money in the \"new Palestine\" if Hamas stays?\nIt is in everyone's interest to destroy these terrorist networks.\n\n##\nIt should be remembered that Saudi Arabia is the leader of the Sunni axis and its position regarding Hamas is the position of many other Sunni countries - they cannot say publicly that they support the destruction of Hamas, but they would be happy for it to happen and as soon as possible."}, {"id": "36f9cac6-ee87-4cdb-a7a8-5ddc4df6b424", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28093/", "date": "2024-05-30 04:44", "message": "Fatah's al-Aqsa Martyrs Brigades in Tulkarm claim in a proclamation: Our operatives infiltrated a house in the settlement of Bat Hefer with the aim of eliminating an officer. The officer was not at home and only his children were present. In accordance with Islamic morality and contrary to the nature of the occupation's activities, the operatives spared the children and only took an M4 type weapon and a Glock pistol from the scene."}]