[{"id": "cfea2626-6f2c-4be1-8ef8-4a54d96be9a0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29017/", "date": "2024-06-17 07:31", "message": "South Lebanon: Also in the villages of Tayrharfa and Ayta ash-Shab, the residents of southern Lebanon (who fled the terror of the war) are taking advantage of the holiday and the relative peace on the border with Israel to reach their homes and assess the damage from the Israeli attacks."}, {"id": "9ae74060-18b1-4740-9e83-ce9fe27f2264", "channel_id": 1560386984, "url": "", "date": "2024-06-17 07:30", "message": "Lebanese channels report that the IDF is firing machine guns at residents of South Lebanon who came, on the occasion of the holiday, to visit their homes in the village of Chahira, in order to witness the destruction caused by the IDF attacks."}, {"id": "ac20221c-a49d-411d-b9ba-ff4839942533", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:31", "message": "Published yesterday on Lebanese channels:\nA \"Lebanese bear\" was observed in the wild in the western part of the Baqaa district."}, {"id": "8c0ab6e2-c88c-4be5-9f8c-4443f26b187e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29013/", "date": "2024-06-17 06:30", "message": "Deadly fever on pilgrimage to Mecca\n\nThe Jordanian Ministry of Foreign Affairs: 14 Jordanian pilgrims who came to perform the Hajj, who are not a part of the official Jordanian delegation, died as a result of the intense heat on Mount Arafah.\n17 more Jordanians are identified as missing.\n\nOne of the Jordanian pilgrims who died wished, on his way to the mountain, victory for the Gazans (over Israel in Gaza).\nAttached is the video he shot expressing this wish."}, {"id": "a3d723b7-57dc-4b54-acd5-679478eed182", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:28", "message": "The Palestinians report the movement of maneuvering forces and tanks, accompanied by aircraft, in the area of ​​the Zeytoun neighborhood in the southeast of Gaza City."}, {"id": "96574735-4ce6-4645-b58a-34a80690eb4a", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:28", "message": "The White House: The American special envoy Amos Hochstein is expected to arrive in Israel today (Monday).\n\n##\nHochstein will try to promote the reduction of tensions between Israel and Hezbollah to further the goal of the Biden administration to reach a diplomatic agreement that will prevent war in the north."}, {"id": "10509fdb-5316-4c14-a823-41a4f273a6a6", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:25", "message": "Palestinian channels: IDF soldiers set fire to the \"departure hall\" at the Rafah crossing."}, {"id": "5346bb14-b7fa-4816-a3d4-f10230f53a05", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29008/", "date": "2024-06-17 06:25", "message": "Two events in the last few days in which President Biden froze in place and did not move his gaze for several long seconds, are creating a storm on social networks centered on a discussion about his fitness to run in the presidential elections this coming November.\nThe discussion on the network about the possibility of replacing him with another candidate has become more public in the last day."}, {"id": "1d3620df-4a17-4ade-a20a-1d5d9e8d2efe", "channel_id": 1560386984, "url": "", "date": "2024-06-17 06:22", "message": "Yesterday, Gaza channels reported the death of Muhammad Abu Kura, known as \"Abu Shahid\", in an attack in Rafah.\nA member of his family claims in a post published on social media that Abu Kura was killed in the explosion of the Israeli APC in Rafah on Saturday.\nAccording to Palestinian sources, he has a long history of military activity in the Gaza Strip and is a well-known figure in Rafah."}]