[{"id": "fea3ca8e-8af2-479d-846a-80ca202b99fe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31539/", "date": "2024-07-31 19:02", "message": "The place where Haniyeh was eliminated\n\nIranian and Western sources publish the location of the guest house of the Iranian Revolutionary Guards where Ismail Haniyeh was staying at the time he was killed.\nThe place is surrounded by mountains on almost all sides. It is located in the north of Tehran and there is even a soccer field nearby.... like in the assassination of Fuad Shukr in Beirut.\nThe part damaged as a result of the attack was covered with a black cloth."}, {"id": "2fb18555-8824-4b26-8273-c22991fb7c9c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31538/", "date": "2024-07-31 19:00", "message": "The guys in the Iranian opposition are in a good mood today in light of the assassinations...\nThis is their version of the \"Haniyeh Kebab\"."}, {"id": "83f6c938-ce4c-41f5-b6e1-8b2070f24513", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31537/", "date": "2024-07-31 18:59", "message": "Palestinian sources report that Wassim Abu Shaaban, the personal security guard of Ismail Haniyeh who was killed with him in Tehran, was one of the operatives of the Nukhba special forces of Hamas who broke into a pillbox in Nahal Oz on July 28, 2014, by surprise, from a tunnel, during Operation \"Guardian Edge\". In the incident, 5 IDF soldiers were killed, the \"Tabor\" weapon of one of them was taken as loot and the abduction of the bodies of the dead was prevented thanks to the resourcefulness of the soldier who was in charge of the pillbox.\n\nHis elimination is also an achievement."}, {"id": "3573c531-ed58-4319-843e-8230a46ac785", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31536/", "date": "2024-07-31 18:30", "message": "Notably, al-Ghoul documented the release of the hostages in the November 2023 deal - if the military arm of Hamas invited him to film up close, you can bet the organization really trusts him."}, {"id": "01c25e65-401e-455e-b256-8145988fd0b4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31535/", "date": "2024-07-31 18:29", "message": "On March 18 of this year, l wrote to you about Ismail al-Ghoul when IDF soldiers raided the Shifa hospital a second time in one of the most brilliant maneuvers of the war 👆"}, {"id": "4c9a436c-2b74-4300-9773-44ff989f956a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31534/", "date": "2024-07-31 18:26", "message": "Hamas in an official announcement: the killing of journalists Ismail al-Ghoul and Rami al-Rifi is a heinous crime.\n\n##\nWho is this particular journalist to Hamas?"}, {"id": "07ca2c1a-997c-4a63-8f61-a2b0b39b6cfb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31533/", "date": "2024-07-31 18:25", "message": "Here is his last tweet, for today and forevermore."}, {"id": "d44e7089-678d-4dae-8de9-2189f4eb6f08", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31531/", "date": "2024-07-31 18:24", "message": "Earlier today, the Palestinians reported that Al Jazeera journalist Ismail al-Ghoul was killed in an Israeli attack on a group of journalists in the Shatti refugee camp in the west of Gaza City - near the ruins of Ismail Haniyeh's house (they came to the scene to film a news piece following the assassination of Haniyeh in Tehran).\nAnother journalist named Rami al-Rifi was killed with him.\n\nAccording to the photographs from the scene of the attack and according to the testimonies of his fellow journalists, al-Ghoul was left without a head, while sitting in his car, as a result of the attack."}, {"id": "9c2a6b67-35d4-4d05-9ab2-31b2e3a66ed4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31526/", "date": "2024-07-31 17:54", "message": "Following the official announcement of his death, Hezbollah publishes a series of photos of Fuad Shukr. \n\nThis includes photos with the late Quds Force commander Qasem Soleimani (killed in an American drone strike during the Trump administration in 2020), with Hezbollah's former Chief-of-Staff Imad Mughniyeh (killed in Syria in 2008 in an explosion attributed to Israel), and with Hassan Nasrallah (who is still waiting...)"}, {"id": "74060559-19a9-48e6-8fcf-17af3237c32b", "channel_id": 1560386984, "url": "", "date": "2024-07-31 17:48", "message": "° The only one so far to have his martyrdom poster be oriented to \"landscape\" (horizontal) and not \"portrait\" (vertical)."}, {"id": "e678b247-744a-4fcf-8c17-87da7795a32d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31524/", "date": "2024-07-31 17:46", "message": "Hezbollah officially announces the death of the \"great jihadi commander\" A-Sayyid Fuad Ali Shukr, also known as \"Sayyid Muhsen\".\n\n###\nOnly three Hezbollah militants recieved the title of \"commander\" in their martyrdom posters - Fuad Shukr outranks them with the title of \"great jihadi commander\"...\n\nBut at the end of the day he is - number 388"}, {"id": "65ae683b-ba0e-49c2-9983-83b362352fdc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31523/", "date": "2024-07-31 17:25", "message": "Hezbollah Secretary-General Hassan Nasrallah is expected to deliver a speech tomorrow at 5 PM (local time)."}, {"id": "005a129b-9ef9-44ac-bc65-83830042b3bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31520/", "date": "2024-07-31 17:24", "message": "Photos of the aftermath of today's drone strike on a Hamas police vehicle in a-Zawayda.\n\nAccording to Palestinian reports, 10 people were killed in the attack, most of them Hamas policemen."}, {"id": "17c15732-9bef-4bf0-948e-593f1aea624e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31519/", "date": "2024-07-31 17:19", "message": "In a press conference this evening, Israeli Prime Minister Netanyahu did not accept responsibility for the assassination of Hamas leader Ismail Haniyeh yesterday in Tehran.\n\nAddressing recent threats from members of the Shiite \"Axis of Resistance,\" Netanyahu added that those seeking to attack Israel, regardless from which arena, will pay a heavy price."}, {"id": "45f522fc-760e-437f-b742-d4871ca5ffcd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31517/", "date": "2024-07-31 17:16", "message": "In the last hour, the Hezbollah-affiliated al-Mayadeen channel reported that a body was recovered from the site of the attack in Beirut, which could be that of senior Hezbollah commander Fuad Shukr.\n\nSeveral moments later, and almost 20 hours after the statement from the IDF spokesperson, both the Iranian state news agency Tasnim and the Hezbollah-affiliated al-Manar confirmed that the most senior commander in Hezbollah was indeed killed in yesterday's attack.\n\nAccording to Tasnim's report, Shukr survived the initial attack, but later succumbed to his injuries."}, {"id": "130a71cd-9308-417a-97e3-3fd09fe708aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31516/", "date": "2024-07-31 15:13", "message": "Meanwhile, on a street corner in Tehran, a \"quiet celebration\" with mini sweets on the occasion of the \"killing of the terrorist Ismail Haniyeh\""}, {"id": "433fe288-6af0-4fbf-8834-bf1aedb91aa6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31515/", "date": "2024-07-31 15:13", "message": "\"Wait for spicy punishment\"\n\nA huge poster in Palestine Square in Tehran."}, {"id": "5ebb4979-823c-4edd-aac3-be02e50c5204", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31514/", "date": "2024-07-31 14:06", "message": "Unofficial sources associated with Hezbollah: Hezbollah is expected to soon publish a statement regarding yesterday's attack in Dahieh.\n\n##\nThe assumption is that the body of Fuad Shukr was found after a 20-hour search."}, {"id": "b38e2465-4891-4fa1-b9f1-8b15c3c3607c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31513/", "date": "2024-07-31 14:05", "message": "The military wing of Hamas accepts responsibility for the attack this morning in the Hebron area in which an Israeli citizen was seriously injured.\n\nAccording to the military wing of Hamas, the attack in Hebron was carried out in revenge for the assassination of Ismail Haniyeh."}, {"id": "862a07ed-4673-44ba-8fb6-8100ca3c920c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31508/", "date": "2024-07-31 12:58", "message": "Gazans in Khan Yunis distribute dates \"to lift the soul\" of Haniyeh..."}, {"id": "a05b4f6b-1cf5-4195-9b1c-99d812221708", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31507/", "date": "2024-07-31 12:57", "message": "Supporters of the Iranian opposition turning to Israel: now here, please..."}, {"id": "ee659c8a-2a75-4be7-98a6-ca0975208b56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31503/", "date": "2024-07-31 12:10", "message": "Parades and demonstrations in support of Hamas against the background of the assassination of Haniyeh in several West Bank cities including Nablus, Tulkarm and Hebron."}, {"id": "b5cd6ba5-02bb-42af-99eb-cd7d466881e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31502/", "date": "2024-07-31 12:01", "message": "Additional documentation of the destruction from the scene of yesterday's attack in Dahieh in Beirut."}, {"id": "ba90cc9c-d86c-4cd3-9e50-50ca3901c9f0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31501/", "date": "2024-07-31 11:41", "message": "Syria: reports of explosions in the area of ​​Sayyidah Zaynab, the Iranian stronghold in southern Damascus.\n\nSources identified with the Shiite axis reported that a building was attacked. \n\nUnofficial Syrian sources report the smoke in the Sayyidah Zaynab area was caused by a fire at a factory in Damascus and not by an Israeli attack."}, {"id": "5f5773dc-d337-44d1-81af-31da251ee7aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31500/", "date": "2024-07-31 11:35", "message": "The Palestinians report 10 deaths, most of them Hamas policemen, in a drone attack a short time ago on a vehicle in the area of ​​the entrance to a-Zawayda in the center of the Strip."}, {"id": "221f0464-7f37-4274-9155-366814ec2522", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31499/", "date": "2024-07-31 11:09", "message": "Lebanon: The moment of the attack yesterday in Dahieh in Beirut, near a soccer field - very reminiscent of similar documentation from the soccer field in Majdal Shams.\n\nEye for an eye."}, {"id": "d20c5b90-90da-43a3-8bff-421103ae9754", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31498/", "date": "2024-07-31 11:08", "message": "The Washington Post from the US Secretary of State Blinken:\nThe US did not receive an early warning before the elimination of Haniyeh and has nothing to do with the incident."}, {"id": "00a4fe49-9d60-4b40-b30b-cdc2fc9f6325", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31498/", "date": "2024-07-31 11:08", "message": "Iranian channels affiliated with the Iranian Revolutionary Guards claim: the red flag of revenge was raised over the Jamkaran Mosque in the city of Qom in Iran following the assassination of Ismail Haniyeh."}, {"id": "afa6533f-0637-4a75-8bdb-ec03c1f1e700", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31494/", "date": "2024-07-31 10:41", "message": "Haniyeh and Kahled Mashal in better days"}, {"id": "d3e239eb-fe0e-4fc2-b6a5-f11d25b9c7da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31493/", "date": "2024-07-31 10:39", "message": "The apparent heir in Hamas:\n\nHussein al-Sheikh, the secretary general of the PLO's working committee and designated to succeed Abu Mazen, called Hamas leader Khaled Mashal to offer his condolences on Haniyeh's death and to inform him that internal Palestinian unity is the only choice of the Palestinian people in the face of the occupation.\n\n##\nKhaled Mashal served, before Haniyeh, as the chairman of the political bureau of Hamas from 1996 to 2017 and is now a senior political figure in Hamas."}, {"id": "8c4c146a-f30e-4469-9cd3-3b23ae2723cd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31492/", "date": "2024-07-31 10:11", "message": "Gazan children wave the pictures of Ismail Haniyeh above the ruins of his house in the Shatti refugee camp in the west of Gaza City."}, {"id": "abcbc279-6fb2-4279-9fef-14ed9d39fd3f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31488/", "date": "2024-07-31 10:10", "message": "Sudan: Abdel Fattah al-Burhan, the chairman of the Sovereignty Council of Sudan (which signed normalization with Israel) was saved this morning from an assassination attempt by a UAV while he was present at the graduation ceremony of a course of the Sudanese army.\n\nIn Sudan, a civil war has been going on for two years, in which the Sudanese army is fighting the \"Rapid Support Forces\" a paramilitary group that sprung from the Sudanese army."}, {"id": "7f36122d-c4c0-4c1f-a54e-73800de4d922", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31487/", "date": "2024-07-31 09:50", "message": "Dahieh, Beirut: \"We are looking for Fuad\""}, {"id": "73d6b3d1-2575-4318-9650-4879e98c492f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31486/", "date": "2024-07-31 09:47", "message": "Haniyeh's office:\n\nTomorrow, Thursday, a funeral ceremony will be held for Haniyeh in Tehran.\nIn the evening his body will be transferred to Qatar.\nOn Friday, the funeral ceremony will be held in Doha in the presence of senior officials from all over the world, after which Haniyeh will be buried in the cemetery in the city of Lusail in Qatar."}, {"id": "43547ac6-c44f-4445-a3a7-2adeefd74bdb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31485/", "date": "2024-07-31 09:36", "message": "Iran announces three days of mourning in the country following the assassination of Haniyeh."}, {"id": "72e89d2d-856d-4c22-a537-2ccd5d5f1b2e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31484/", "date": "2024-07-31 09:35", "message": "Prime Minister of Qatar:\nThe policy of assassinations of political figures raises the question of how a negotiation is conducted when one side eliminates the other side who negotiates with him?"}, {"id": "600f3d8f-20bd-4a8b-b061-946735fcaf72", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31483/", "date": "2024-07-31 09:08", "message": "Erdogan strongly condemns the assassination of his friend Haniyeh.\n\nMeanwhile, judoka Maya Goshen crushed the Turkish contestant...🇮🇱🇮🇱\n\nA difficult morning for Erdogan"}, {"id": "99b02ab4-7781-4514-bce4-0513bddd69b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31482/", "date": "2024-07-31 09:04", "message": "Haniyeh's daughter-in-law (his son's wife) wails over his death and asks the many members of the Haniyeh family who have already been killed in the war to welcome him upstairs.\n\nIf you had any doubt: 10 on the online howling index among Hamas supporters..."}, {"id": "87fe3c7d-1526-4d12-a023-3a70e7bff292", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31481/", "date": "2024-07-31 08:48", "message": "The regime managed to gather some people at the entrance to the University of Tehran to carry Palestinian flags and chant with noticeable fatigue:\nDeath to America\nDeath to Israel"}, {"id": "4ecd6563-a86a-4fc4-99d2-3bc6b965e4d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31477/", "date": "2024-07-31 08:21", "message": "Iraq: al-Hashd ash-Shaabi Shiite organization at the funeral of 4 of its military operatives who were killed in an American airstrike last night in the Babil district of Iraq.\n\nThis is an unusual event that comes against the background of several attacks by Shiite militias against American bases in Syria and Iraq in the past week."}, {"id": "6476861f-c285-451d-bf40-8c28a7e2be56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31476/", "date": "2024-07-31 08:19", "message": "The Lebanese Red Crescent: So far, 4 dead and 80 wounded have been rescued from the attack area in Beirut's Dahieh."}, {"id": "9bf9d6cf-5e26-405d-a444-5dde81901cf9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31475/", "date": "2024-07-31 08:19", "message": "The last greeting and kiss from the supreme leader of Iran."}, {"id": "91c024b4-f3cb-4105-9e00-3c61de85ce8f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31474/", "date": "2024-07-31 08:18", "message": "I wonder which senior officials will come to the funeral ceremony..."}, {"id": "ed459e66-64f4-4497-b2e1-2c699b9d2fec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31473/", "date": "2024-07-31 08:18", "message": "Haniyeh's funeral and burial ceremony will be held in Qatar on August 2 after the Friday prayer.\n(On Thursday, as mentioned, a ceremony will be held in Tehran)."}, {"id": "22bfbd50-2ef5-45fb-b98f-3d9df1013e01", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31472/", "date": "2024-07-31 08:16", "message": "Iran's Supreme Leader:\n\nAvenging Haniyeh's assassination is an Iranian duty because he was assassinated on our soil."}, {"id": "a48343c2-6222-44e2-baa5-b9f0de8ccd88", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31471/", "date": "2024-07-31 08:16", "message": "Iranian sources: A funeral ceremony will probably be held for Haniyeh tomorrow in Tehran (from there he will continue to Qatar - AA)."}, {"id": "035cf3e6-6f76-4eb0-a4c2-d7607de577bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31470/", "date": "2024-07-31 07:46", "message": "Iran's President Masoud Pezeshkian on the assassination of Haniyeh:\nIran will defend the integrity of its lands (sovereignty) and honor and make the invaders regret their cowardly actions.\n\nThe relations between the Iranian people and the Palestinian people will be stronger than ever.\n\nYesterday I raised the hand of the martyr with the symbol of victory and today I have to bury him...\nToday Iran mourns its partner for the moments of sadness and joy."}, {"id": "a210c87b-d7c5-422d-a1dd-ea7e1e91786c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31469/", "date": "2024-07-31 07:44", "message": "The Houthis in Yemen announced 3 days of mourning and lowering the flag to half-mast following the assassination of Haniyeh."}, {"id": "72944a2b-6817-4d23-8db5-c33c0986f5b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31468/", "date": "2024-07-31 07:43", "message": "Among the supporters of the Iranian axis on social networks there is a delicate and amusing balance between loud sobs and threats of revenge and warnings of the opening of the gates of hell.\n\nWe will wait for the event to stabilize and take direction. Many have not yet woken up from the shock.\n\nI will mention that they are still excavating the remaining parts of the Hezbollah leader in Dahieh... it is not yet possible to officially mourn him..."}, {"id": "9bf45fd4-066b-4e56-92dd-e3c2f2c9aee4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31467/", "date": "2024-07-31 07:37", "message": "Via Amit Segal:\n\nHanding out baklava in Sderot after the assassinations in Beirut and Tehran"}, {"id": "85812bfa-a7fa-4793-a912-d6455eae3132", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31466/", "date": "2024-07-31 07:34", "message": "Expressions of joy on social networks\n\nGazans on social media, including many Fatah supporters, find it difficult to hide their joy in view of Haniyeh's assassination in Tehran.\n\nSome also reported \"rejoicing in tents\" among the displaced Gazans in the Strip.\n\nOne Gazan wrote:\n\nيعني اغتيال هنية في طهران والعاروري نائبه في الضاحية.!! هو المحور معانا ولا علينا.!؟\n\nSo, Haniyeh was assassinated in Tehran and Al-Arouri his deputy was in the southern suburbs (of Beirut in Lebanon -AA).!! Is the axis with us or against us?!"}, {"id": "a4b97a7f-63d7-40b0-8fb5-9d9f7e8c0722", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31462/", "date": "2024-07-31 07:28", "message": "Hamas-identified channels report a general strike in East Jerusalem and West Bank cities following the assassination of Haniyeh in Iran."}, {"id": "7319d076-27aa-4771-8c8d-ba92971445eb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31461/", "date": "2024-07-31 07:05", "message": "Leading Palestinian channels:\n\nHaniyeh's funeral ceremony will be held in Doha, the capital of Qatar, where he will be buried."}, {"id": "d7b438b0-fa4f-4550-b079-f32a34d905af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31459/", "date": "2024-07-31 07:05", "message": "Along with Haniyeh, his personal escort, Wassim Abu Shaaban, was also killed in the attack."}, {"id": "ca5e8d01-668d-421e-afb6-e5a9c778ba4c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31458/", "date": "2024-07-31 06:43", "message": "There is no doubt that the assassination in the heart of Tehran sends a strong message to many high-ranking terrorists:\nIsrael calls the shots.\nTake a good look behind your back, under the bed, behind the seat in your car... In the end, a missile can also come from above..."}, {"id": "3e9d5790-f100-4b5a-86b1-deca57839907", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31457/", "date": "2024-07-31 06:40", "message": "Iranian opposition channels mock Esmail Kaani, commander of the Quds force in the Iranian Revolutionary Guards:\nKaani after hearing about the assassination in Tehran..."}, {"id": "4bf7b1db-9a99-4b32-959d-ab28ebe02416", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31456/", "date": "2024-07-31 06:39", "message": "Known details about Haniyeh's assassination in Iran \n\nThe Iranian news agency Fars states that the assassination was carried out around two o'clock in the morning in the \"convalescent home\" of retired Iranian Revolutionary Guards in northern Iran.\n\nThe Lebanese Al Mayadeen channel stated earlier that Haniyeh was killed by a missile launched from another country towards the place where he was staying (north of Tehran).\n\nThe al-Arabi al-Jadid newspaper points out that Haniyeh stayed, as mentioned, in an accommodation facility of the Iranian Revolutionary Guards. According to the newspape, Ziyad al-Nakhalah, the Secretary General of the Islamic Jihad was staying on another floor of the building."}, {"id": "1bbca214-12f7-4243-9de4-69e10bf8cb60", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31455/", "date": "2024-07-31 06:36", "message": "Hezbollah in a proclamation:\nWe share in the grief of our brothers in Hamas for the assassination of Ismail Haniyeh.\nWe send our condolences to his family and the Palestinian people.\nHis assassination will only increase the determination of jihad fighters in all arenas to continue on the path of jihad."}, {"id": "0dbbb560-bc99-44c7-a81a-378797a24b72", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31454/", "date": "2024-07-31 05:54", "message": "Spokesman of the Foreign Affairs and Security Committee in the Iranian Parliament on the elimination of Haniya in Iranian territory:\n\nThere will undoubtedly be a response.\nThe committee will convene for an urgent meeting."}, {"id": "192a7d46-baeb-4bcc-8199-8bb8f87046fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31453/", "date": "2024-07-31 05:47", "message": "The Turkish Ministry of Foreign Affairs:\n\nWe condemn the killing of Haniyeh in Tehran.\nOnce again it becomes clear that the Netanyahu's government has no intention of reaching peace."}, {"id": "cc4b6687-ccd6-4c99-b56d-7e51a4805733", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31452/", "date": "2024-07-31 05:47", "message": "Haniyeh's last televised interview, yesterday in the heart of Tehran."}, {"id": "26a4dcfb-bc82-4781-8e1f-3c1e570700a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31451/", "date": "2024-07-31 05:46", "message": "An Iranian source for the Lebanese al-Mayadeen channel:\n\nThe assassination of Haniyeh was carried out by means of a missile launched outside the territory of Iran. The launch was not carried out from inside Iranian territory."}, {"id": "7633348b-864a-4a46-82fb-930e088965bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31450/", "date": "2024-07-31 05:45", "message": "From a Hezbollah statement on the attack in Dahieh:\n\n\"Significant damage was caused to the building that was attacked in the Dahieh. The senior commander, Brother Fuad Shukr, was in the building at the time of the attack. Civil defense teams are working to clear the rubble - we are awaiting news regarding Fuad Shukr's fate.\""}, {"id": "30f253e2-9b82-469a-901b-5acd88af16da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31448/", "date": "2024-07-31 05:44", "message": "One of this channel's subscribers writes to me this morning:\n\n\"The photo on the left is from the last Hanukkah at Palestine Square, in Gaza City's Rimal neighborhood. After we took over the house where Ismail Haniyeh's daughter lived, we found Haniyeh's ID card.\n\nI kept the ID with the inscription on the back: 'We will get you too, Am Israel Chai!'\n\nThe right image is from this morning, eight months later, in Rafah's Shaboura neighborhood - with the same ID and the news of Haniyeh's assassination in the background.\n\nA sweet victory 🇮🇱\""}, {"id": "bb745148-9492-4058-aaf6-a8c2f0023327", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31447/", "date": "2024-07-31 05:35", "message": "The American Defense Minister, after the assassinations in Beirut and Tehran:\n\nIf Israel is attacked we will help defend it."}, {"id": "eabaa079-aadb-453c-9f34-59dda8c6ff0a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31446/", "date": "2024-07-31 05:35", "message": "IDF Spokesperson: There are no changes in the Home Front Command defensive guidelines. The IDF is currently conducting a situational assessment. If any changes will be made, an update will be released on the IDF and Home Front Command's platforms. Please stay updated and act according to the Home Front Command defensive guidelines."}, {"id": "991bea57-29cc-438b-bf7a-e20536995ba0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31444/", "date": "2024-07-31 05:31", "message": "The past 24 hours have certainly helped restore Israel's deterrent power in the Middle East.\n\nThis is an important step in shaping the region for decades to come."}, {"id": "65237c0b-1fce-4347-a0dc-de08be664ec3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31442/", "date": "2024-07-31 05:30", "message": "In the attached clip, taken on the morning of October 7th, Ismail Haniyeh and his deputy Saleh al-Arouri are seen celebrating the news of the attack.\n\nOn January 2nd, Saleh Al-Arouri was eliminated. On July 31st, Haniyeh was eliminated.\n\nThe two most senior members of the Hamas political bureau were eliminated during the war... but the room is full... there is still more work to be done..."}, {"id": "cd05e9ca-0df1-4a26-b0c4-4a68b8d00a98", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31441/", "date": "2024-07-31 05:26", "message": "As of this time, Hezbollah has yet to comment on the assassination of Fuad Shukr in Beirut yesterday.\n\nMeanwhile, Abu Mazen and the Palestinian Authority strongly condemn the assassination of Haniyeh: it is a cowardly act."}, {"id": "d6d31fbe-8618-47f5-b504-51e0aaf6897a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31440/", "date": "2024-07-31 05:26", "message": "Nasser Kanaani, spokesman for the Iranian Foreign Ministry, before the announcement of Haniyeh's assassination and after the attack in Beirut:\n\n\"The Israeli attack in Lebanon is a gross violation of Lebanese sovereignty. We call on the UN Security Council to fulfill its role.\"\n\n##\nAnd what about the violation in Tehran? (:"}, {"id": "a871b171-a14d-4e97-ba6e-2beb27ac43d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31439/", "date": "2024-07-31 05:25", "message": "Reunited with his kids..."}, {"id": "ce915858-fd83-482e-a0d9-fbae271d098c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31438/", "date": "2024-07-31 05:23", "message": "Hamas's red triangle."}, {"id": "46ced4ef-2d4b-4e73-85b9-56ea460e3435", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31432/", "date": "2024-07-31 05:22", "message": "The Palestinians can take solace in the fact that Haniyeh spent a day full of smiles in Tehran before being assassinated. He was really living his \"best life,\" even meeting with the Supreme Leader of Iran. He made it to the top.\n\n##\nIsrael's message is equally important: no one has immunity anywhere, not even in what they consider the most protected places - the heart of Beirut or the heart of Tehran."}, {"id": "9e286515-8d45-428f-aa92-2accd24be725", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31431/", "date": "2024-07-31 05:20", "message": "Haniyeh's last \"V sign\", during yesterday's ceremony in Tehran, as a show of being on the path to victory."}, {"id": "ed9f4975-53c8-429f-955e-3f21573df8e2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31430/", "date": "2024-07-31 05:19", "message": "Senior Hamas official Musa Abu Marzouk on the assassination of Haniyeh:\n\n\"This is a cowardly act that will not go unanswered...\"\n\n##\nReally Musa? An attack in the heart of Iran after the presidential inauguration ceremony is a cowardly act?\nGood luck with finding a replacement."}, {"id": "af63c5f0-ce73-4e84-9dbf-ce8bbef7565e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31429/", "date": "2024-07-31 05:18", "message": "\"The Kiss of Death\"\n\nHaniyeh receiving multiple kisses from the President of Iran immediately after his inauguration ceremony yesterday."}, {"id": "f82f8a2d-6eff-4d73-a7d6-55ae0dc2c82a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31428/", "date": "2024-07-31 05:15", "message": "An updated list of \"unfulfilled revenge\":\n\n1. The Houthis promised to respond to the attack on the port in Hodeidah.\n2. Hezbollah seeks revenge for the killing of their Chief of Staff yesterday in the heart of their stronghold in Beirut.\n3. Hamas and Iran are seeking revenge for the assassination of the head of the Hamas political bureau in the heart of Tehran."}, {"id": "9d3cbe93-3bbd-4d26-9273-7076756178ea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31427/", "date": "2024-07-31 05:10", "message": "Hamas confirms in an official statement:\n\nIsmail Haniyeh, the chairman of the political bureau of Hamas, was killed in an Israeli attack in Tehran, hours after his participation in the swearing-in ceremony of the Iranian president.\n\nThe Iranian Revolutionary Guards also confirm the report and announced that they are investigating the circumstances and the consequences...\n\nOne of Haniyeh's security men was also killed in the attack."}]