[{"id": "c0505cca-d306-4d31-897c-5d8ce15e2e3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27536/", "date": "2024-05-20 08:53", "message": "Lebanese channels report casualties in the IDF attack in Naqoura in southern Lebanon a short time ago."}, {"id": "c0cc3ba3-3f1d-4ceb-93b9-e46f6db3702c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27535/", "date": "2024-05-20 08:53", "message": "The new Iranian foreign minister, Ali Bakri Khouni."}, {"id": "a699b107-858d-4fbf-a3dd-a1a3a84dbb95", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27534/", "date": "2024-05-20 08:52", "message": "Iran - appointments and decisions following the death of the president and the foreign minister\n\nThe supreme leader of Iran announced 5 days of mourning in the country.\n\nThe supreme leader confirmed that Muhammad Mahbar, the first deputy of the president, will receive his powers until the holding of presidential elections within 50 days.\n\nAli Bakri Khouni, who was the Iranian deputy foreign minister, will be appointed the acting foreign minister."}, {"id": "7bcaa310-e885-456e-aa9d-4a2807252b5e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27532/", "date": "2024-05-20 07:43", "message": "Follower Ben-Tzion Macales shows, based on satellite images, the changes going on in the Jabaliya refugee camp in the north of the Gaza Strip and the eastern Rafah area in the south of the Gaza Strip, following the IDF's activity in these sectors in the last ten days."}, {"id": "1eb76864-1401-4ab2-8b46-8e3bae9a063e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27531/", "date": "2024-05-20 07:42", "message": "The Palestinians are reporting this morning on a limited advance of IDF maneuvering forces in eastern Khan Yunis in the southern Gaza Strip (Wadi Salqa area and Qarara area)."}, {"id": "2ff8cd69-49a7-43b3-b8bb-17f1e542f440", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27530/", "date": "2024-05-20 07:41", "message": "Spokesman of the Constitutional Committee in Iran:\nWe will hold presidential elections within 50 days."}, {"id": "151ed431-bdf8-4d2c-990a-3e7296ff1c92", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27529/", "date": "2024-05-20 07:40", "message": "Lebanon declared three days of national mourning following the death of the Iranian president and his foreign minister.\n\nIranian Foreign Minister Abdollahian was supposed to arrive this Thursday on a \"working visit\" to Lebanon."}, {"id": "8c0f4e8f-d61f-4b11-afa5-887680ce9bb7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27528/", "date": "2024-05-20 07:39", "message": "Ilham Aliyev, the president of Azerbaijan, sent a letter of condolence to the supreme leader of Iran following the death of Ebrahim Raisi, the Iranian president, with whom Aliyev met shortly before Raisi took off on a flight from which he did not return."}, {"id": "a53c8048-54e6-4c2c-a103-896853272a43", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27527/", "date": "2024-05-20 07:35", "message": "Celebrations by anti-regime Iranians as well as Israelis, in front of the Iranian embassy in London this morning, following the confirmation of the death of Iranian President Ebrahim Raisi.\n\nRaisi, during his tenure as a senior in the Iranian justice system, signed execution orders for thousands of opponents of the regime in Iran (mainly in the late 1980s).\n\nThere are many people who are happy today throughout Iran and abroad."}, {"id": "4e0d3000-d8b2-487b-b775-15a4c8531f5f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27526/", "date": "2024-05-20 06:38", "message": "Another picture of the Iranian president's helicopter crew members: the pilot, co-pilot and flight technician.\n\n##\nThe real heroes :)"}, {"id": "c85d59fe-4578-4794-b5cc-48e96a75919d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27524/", "date": "2024-05-20 06:09", "message": "Rafah, southern Gaza: The neighborhood of Yabneh is completely empty. Only journalists remain.\n\nThe IDF forces have not yet entered this area, located west of the Al-Barazil neighborhood (where the maneuvering forces are now).\n\nThe IDF has not yet issued an evacuation warning for Yabneh, but despite this it is already empty."}, {"id": "d15a0c5c-4845-4ab1-829e-961d749345d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27523/", "date": "2024-05-20 06:04", "message": "The bodies are being recovered from the crash site."}, {"id": "cf497860-bc44-477f-8256-d98202a7361d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27521/", "date": "2024-05-20 06:00", "message": "Pictures of the pilot and co-pilot."}, {"id": "6d3abe16-6786-4f76-92da-ba56ab7ff07a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27520/", "date": "2024-05-20 05:51", "message": "Meanwhile in Jabalia in the north of the Gaza Strip: Palestinians complain on attacks and destruction on a level they have not seen since the beginning of the war."}, {"id": "c2662f2c-d6fb-4cc7-8ee9-ae73aa7cf139", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27519/", "date": "2024-05-20 05:49", "message": "A black flag was placed on the dome of the Imam Reza shrine in Mashhad, Iran, as a sign of mourning."}, {"id": "167af9fd-d359-461d-90ec-343c93c32aae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27518/", "date": "2024-05-20 05:43", "message": "Hamas was among the first to issue a statement of condolences on the death of the Iranian president and the other passengers of the helicopter. \n\nAlready at 8 AM."}, {"id": "0767260c-09c1-4a0a-b4a4-b24ace93a890", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27517/", "date": "2024-05-20 05:42", "message": "The names of the helicopter crew members were also published:\n\nColonel Sayed Taher Mustafavi - the pilot\nColonel Muhsen Darainosh - the co-pilot\nMajor Bahroz Kedima - on-flight technician"}, {"id": "ecb3d3bb-a7dc-4bbc-a266-03d8764d4d58", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27516/", "date": "2024-05-20 05:37", "message": "According to article 132 of the Iranian constitution, Iranian Vice President Mohammad Mokhber will take Raisi's place as the acting president of Iran for the next 50 days."}, {"id": "40c45bc2-9f88-4483-96a8-429a15427f4e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27514/", "date": "2024-05-20 05:33", "message": "The list of the nine passengers killed in the helicopter crash in Iran:\n\n1. The Iranian president, Ayatollah A-Sayed Ebrahim Raisi.\n\n2. Ayatollah A-Sayed Muhammad Ali Elhashem, the imam of the city of Tabriz.\n\n3. The Iranian Foreign Minister, Dr. Hossein Amir-Abdollahian.\n\n4. The Governor of East Azerbaijan Province, Dr. Malek Rahmati.\n\n5. General Sayed Mehdi Mousavi, in charge of the president's security (in the separate picture).\n\n6. The pilot.\n\n7. The co-pilot.\n\n8. A helicopter crew member.\n\n9. An officer from the \"Ansar Al-Mahdi\" force."}, {"id": "96f32b00-56a2-4e0b-8042-6c49ca25d109", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27513/", "date": "2024-05-20 05:30", "message": "The first footage of the crash site after sunrise and after the weather had improved.\n\nAccording to Iranian sources, it was a Turkish drone with thermal imaging capabilities that located the crash site."}, {"id": "50edad1e-c0b8-4e80-8985-3feaa7a5b3b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27512/", "date": "2024-05-20 05:19", "message": "The charred helicopter fragments clearly indicate that a fire broke out at the crash site. \n\nAccording to some reports, some of the bodies were burnt to the point where it was difficult to identify them."}, {"id": "9667be63-825c-4f2e-b207-a0e125b66f2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27507/", "date": "2024-05-20 05:16", "message": "Photos from the helicopter crash site that were published on Iranian channels earlier today."}, {"id": "df9cec27-d1dd-4ed0-b17e-d398c7242fbe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27506/", "date": "2024-05-20 05:07", "message": "Iran officially announced a short while ago: \n\nThe President of Iran, Ebrahim Raisi was killed along with all the other passengers of the helicopter (a total of nine dead including the helicopter crew).\n\nAt around 5 AM (local time), the wreckage of Raisi's helicopter was located.\n\nAn hour later, it was announced that no signs of life were found among the wreckage of the helicopter.\n\nTowards 7 AM, the Iranians officially announced that the Iranian president and the foreign minister, the two most important political figures in the country (besides the supreme leader), are dead."}]