[{"id": "e7746573-448a-4263-8ab6-d0756c1bc9bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33144/", "date": "2024-08-26 12:38", "message": "Crowding on the coastline in Deir al-Balah following the evacuation instructions.\n\nThe pressure on the residents of Deir al-Balah is intensifying. This is also noticeable in discussions online."}, {"id": "99158355-8c91-4970-b118-bfa433f1d924", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33144/", "date": "2024-08-26 12:36", "message": "An interesting report in Russian media about the attack in Sidon 👆:\nAmar Khlikhel, a senior member of Hamas, was the target of the attack in Sidon and he was seriously injured as well as some of his family members.\n\n##\nUnofficial Lebanese channels do not specify the name of the target of the attack but claim that the target was slightly injured, contrary to the Russian report."}, {"id": "cef21835-3371-44a7-943e-1dd27106e5df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33142/", "date": "2024-08-26 12:35", "message": "Since yesterday at 15:00 until now, Hezbollah has not accepted responsibility for any attack on Israel."}, {"id": "19cb2a77-c1ed-4aa0-94d3-64e57ad3c7be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33141/", "date": "2024-08-26 12:34", "message": "Lebanese sources reported earlier this afternoon that Israeli fighter jets broke the sound barrier in the skies of southern Lebanon.\n\nThese sources also report that Hezbollah subsequently launched an air-to-ground missile at the planes in the skies of southern Lebanon."}, {"id": "7e5500f7-88cb-441f-9bab-c9d013c8439b", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74114/", "date": "2024-08-26 09:49", "message": "The Lebanese Al Mayadeen channel claims: the target of the attack in Sidon was saved.\n\nThe Almanar network and the Lebanese Al Akhbar channel also rushed to announce that the target of the attack in Sidon had been saved.\n\nThe common denominator for all 3 of these media: they are identified with Hezbollah.."}, {"id": "2d8fdf59-e254-4935-b501-25b759508a9c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33138/", "date": "2024-08-26 09:48", "message": "Lebanese channels: An Israeli drone attacked a Honda CRV at the entrance to the village of Ibra in Sidon (about 50 km north of the border with Israel).\nAccording to Lebanese sources, there are casualties."}, {"id": "055bc3fb-23ee-4743-8c85-e754d327d3dd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33137/", "date": "2024-08-26 08:45", "message": "Lutsk, Ukraine: An Iranian-made Shahad 136 UAV (used by Russia) dives towards a residential building."}, {"id": "9274d9c7-3c11-4af3-a1d4-a08d113fe46e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33136/", "date": "2024-08-26 08:45", "message": "The municipality of Deir al-Balah in the center of the Gaza Strip:\n\nNearly 250,000 people evacuated Deir al-Balah during the last 72 hours following the evacuation instructions of the Israeli army.\n\n4 additional water wells have become out of our reach and a total of 14 wells, which would have provided 70% of the drinking water for the residents are not in use.\n\nAid organizations have begun to leave the area."}, {"id": "2dee82f2-8515-42bb-bbfa-43beb43a97e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74105/", "date": "2024-08-26 07:43", "message": "Remember the \"work accident\" 👆 from 5 days ago when an explosive device went off in the Tammun area, in southern Tubas, and one of the terrorists had his lower limbs amputated?\n\nWell, his name was Yazan Maslamani, one of the senior members of the \"Tubas Battalion\" of the Islamic Jihad - and he died today of his wounds.\n\nDug his own grave..."}, {"id": "a5d1f265-bf9b-4591-af0f-7d7d19fad3c5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33130/", "date": "2024-08-26 07:40", "message": "North Korea reveals today, in the presence of the supreme leader, a new suicide drone of its own production.\n\nSoon to be seen in the Middle East and Ukraine?"}, {"id": "5d4a4f21-83de-4dfe-8cb0-596d10fe0950", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33126/", "date": "2024-08-26 07:39", "message": "A fire was still burning yesterday on board the Greek oil tanker SOUNION.\nIt was attacked by the Houthis last week."}, {"id": "00f02702-4ba3-49d8-85ed-d47d04cdc733", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33123/", "date": "2024-08-26 07:37", "message": "In contrast to the Lebanese Al Akhbar newspaper, the more accepted equation on social networks is - a head for a head:\n\nThe head of the Hezbollah Chief of Staff for the head of a chicken.\n\n(It's worth watching the attached video)."}, {"id": "572abad0-2ab8-431f-b4e3-6bcb7bf2cb2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33122/", "date": "2024-08-26 07:36", "message": "The Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, has an explosive headline:\n\nHezbollah established an equation - Tel Aviv for Dahiyeh.\n\n##\nHezbollah is trying to frame the narrative...\n\nSocial media users didn't buy it👇👇👇"}, {"id": "e3c160be-1b92-4a1e-837e-faab55d14d1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33119/", "date": "2024-08-26 07:09", "message": "The chickens don't stop chasing Nasrallah and Hezbollah on social media\n\nIn my opinion, Hezbollah has never regretted launching a rocket like the one that hit the chicken coop yesterday.\n\nSome of the posts on social networks:\n\n1. The occupation government decided to move the chicken coops to the Negev after intelligence reports arrived that Hezbollah intended to attack the chickens with strategic missiles.\n\n2. Nasrallah: The enemy must understand that there is no more KFC after today.\n\n3. Nasrallah: The enemy must know - if you attack our senior officers, we will attack your chickens.\n\n4. Hezbollah yesterday intensively, strategically and metaphysically attacked the chicken coops in response to the assassination of Fuad Shukr. His head was worth a thousand chicken heads!"}, {"id": "7a8c0338-5dd1-4842-bc8f-243dd5b41252", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb74096/", "date": "2024-08-26 07:05", "message": "The Palestinian Ministry of Health in Gaza:\n\nFollowing the evacuation instructions of the IDF spokesperson, according to which the Shuhada Al-Aqsa hospital in Deir al-Balah is in the vicinity of a combat zone, there was panic among the patients and some of them fled the hospital for fear that the IDF would break into it.\n\nWe emphasize that the Shuhada Al Aqsa Hospital continues to operate and that the medical staff remains with 100 patients in the hospital.\n\nWe demand protection for the hospital and those staying there."}, {"id": "678815ec-6bd4-4744-a875-7689aeb616e1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33117/", "date": "2024-08-26 07:04", "message": "The Palestinian Ministry of Health in Gaza:\n1.26 million polio vaccines entered the Gaza Strip. We are now preparing for a vaccination campaign.\n\n##\nThese additional vaccines entered through Israel, of course."}, {"id": "85ea27a0-81eb-452e-ad36-fe3c3d6d75fb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33116/", "date": "2024-08-26 07:02", "message": "France: The arrest of the founder of Telegram was extended\n\nFrench media reports that the detention of Pavel Durov, the founder of Telegram, has been extended for investigation purposes.\nAccording to French law, the detention can be extended up to 96 hours, after which Durov will be released or an indictment will be filed against him.\n\nThe Telegram company responded to his arrest and stated that it complies with all the conditions of the law used in the European Union, including the Digital Services Law, like the other companies in this industry.\nAccording to the company, Durov has nothing to hide and travels frequently throughout the European Union. It also stated that it is ridiculous to accuse the platform itself or its owner of responsibility for inappropriate use of the platform."}, {"id": "4bd171d0-b9ff-46b7-8bf8-8bbf1b0bdf5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33115/", "date": "2024-08-26 07:01", "message": "Iranian Foreign Minister:\nThere will be an Iranian response to Israel's terrorist attack in Tehran.\n\n##\nThe Iranians are jealous of Nasrallah. They would be happy to be like him, after the \"powerful revenge\" they promised with  grandiose threats, all without causing a shred of escalation."}, {"id": "55533952-c8dd-43af-85da-257330f6f3e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33114/", "date": "2024-08-26 06:58", "message": "A Gazan reacts to the results of the round of talks in Cairo:\nEveryone lies.\nAnd the only truth is that only we die."}, {"id": "7a099111-15ca-4e24-89d1-48a26fa6b76a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33113/", "date": "2024-08-26 06:57", "message": "The failure of the talks in Cairo\n\nReuters from two Egyptian security sources:\n\nThe negotiation talks in Cairo ended without an agreement.\nHamas and Israel did not agree on the proposals of the mediators.\n\nThe Egyptian sources doubted the chances of success of the efforts to reach an agreement.\n\nAt the same time, a senior American source told Reuters that the talks were \"constructive\" and in an atmosphere where all parties wanted to reach an agreement...\n\n##\nThere is nothing new under the sun... There is no agreement between Hamas and Israel on fundamental issues, which are black and white. This does not prevent the Americans from continuing to scatter celebratory confetti around..."}, {"id": "697d3d1c-64df-4cb9-9c09-856e573caab1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33112/", "date": "2024-08-26 06:56", "message": "Another unusual event last night:\n\nIDF: an explosive device was detonated on a civilian bus in the area of the town of Marah Rabah. Damage was caused to the bus. No injuries were reported."}, {"id": "b75c730b-7df0-48cc-b4ac-9814944fbec8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33110/", "date": "2024-08-26 06:55", "message": "Yesterday's ramming attack in Ariel:\n\nThe attack was carried out by two Islamic Jihad terrorists from the Jenin refugee camp.\n\nIDF: Following the initial report, two terrorists in a vehicle arrived from the direction of the Tapu'ah Junction to the entrance of Ariel and accelerated in the opposite direction of traffic. Their vehicle collided with other vehicles and attempted to ram IDF soldiers operating in the area. The soldiers eliminated the terrorists and located a military vest and ammunition in the vehicle.\n\nAs a result of the ramming attack, an IDF soldier was lightly injured and was evacuated to the hospital to receive medical treatment and his family has been notified."}, {"id": "d3897bf8-1a4c-4942-a1dc-45d47ae146bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en33109/", "date": "2024-08-26 06:53", "message": "Last night yhe IDF spokesman announced the fall of a reservist in battle in the center of the Gaza Strip.\n\nMay his memory be a blessing."}]