[{"id": "78853e41-8cc8-41db-aec4-6722be85f28a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32486/", "date": "2024-08-15 18:12", "message": "President Biden: Doha ceasefire talks continue. Hamas is represented in them through Qatar and Egypt."}, {"id": "36853d6d-6440-4e43-8a36-9740f415366d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32486/", "date": "2024-08-15 18:12", "message": "Palestinian channels claim: \"Settlers raided the village of Jit in eastern Qalqilya and set fire to 4 houses and 6 vehicles.\""}, {"id": "bcae3fca-685c-4506-92ee-50e83911b602", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32480/", "date": "2024-08-15 18:11", "message": "The Palestinians report that today Israel released from Ofer prison about 70 Palestinian detainees who had been imprisoned for many months as part of preventive detentions following October 7th.\nAmong those released is attorney Ahmed Abu Damos known as \"Advisor Abu Iyad\" who ran a particularly inciting Telegram channel with close to a million Palestinian followers and has been detained since October."}, {"id": "fbc3c09a-9c43-42a4-b319-334e35547c00", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32479/", "date": "2024-08-15 18:10", "message": "The Iranian attempt to establish a foothold in Sudan\n\nBloggers who follow the world of aviation report that a cargo plane of the Iranian Revolutionary Guards carrying weapons landed in Sudan - as part of the supply of Iranian weapons to the Sudanese army.\nI would like to point out that in the last few months I have presented here on the channel evidence of Iranian UAVs being used by the Sudanese army.\nI will also note that the location of Sudan made it a strategic destination in the past as a transit station for smuggling weapons to the Gaza Strip."}, {"id": "957d449c-3fa8-49e7-85f5-18bdc010f513", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73321/", "date": "2024-08-15 16:17", "message": "Sky News: The foreign ministers of France and UK will arrive tomorrow for a quick visit to Israel in order to prevent an all-out war.\n\nThe British Foreign Ministry: \"We see the ceasefire talks in Gaza as a decisive moment for global stability\""}, {"id": "623f0d90-67d4-4885-848f-d84c3673f8b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32475/", "date": "2024-08-15 16:16", "message": "The Russian Ministry of Defense reports that a Russian Tu22M3 (Tupolev) strategic bomber has crashed near the city of Irkutsk.\n\nThe circumstances of the crash are still unclear."}, {"id": "c3764683-f84e-4d14-98b8-6e646b28afc6", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73321/", "date": "2024-08-15 16:15", "message": "Following Abu Mazen's words today in front of the Turkish Parliament:\n\nHere is a recent photo of Abu Mazen in the Gaza Strip."}, {"id": "866d12bb-b989-4c19-83f9-800831013399", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32473/", "date": "2024-08-15 14:57", "message": "Al-Jazeera has appointed Muhammad Qarika to replace Ismail al-Ghoul in covering events in northern Gaza.\n\nAl-Ghoul was killed in an Israeli drone strike - and was later revealed to be a militant in Hamas's elite Nukhba unit.\n\n##\nI wonder if the Hamas military wing's appointments committee approved Qarika as the replacement for al-Ghoul."}, {"id": "f8f9d2f7-9bc2-46be-acbe-fcdb8ad01d7e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32472/", "date": "2024-08-15 14:14", "message": "The White House: We do not believe that Iran has backed down from its threats to attack Israel.\nWe believe that the Iranian attack will happen in the next few days."}, {"id": "dc1ed020-c481-4d38-809f-2254c23e70b6", "channel_id": 1560386984, "url": "", "date": "2024-08-15 14:11", "message": "Documentation from Abu Mazen's speech and his extraordinary in the Turkish Parliament:\n\n1. Receives applause for a long time (the members of the Turkish parliament get up from their chairs) when he says that he decided to come to Gaza together with all the members of the Palestinian leadership.\n2. Reads the militant-religious slogan: \"Victory or Martyrdom\"\n3. Members of the Lebanese parliament wave pictures of Haniyeh and Sanwar.\n4. A microphone was attached to Haniyeh's mouth in one of the photos...\n\n##\nAbu Mazen is trying to be a counterweight to Netanyahu's speech to the American Congress in July.\nThe timing of the speech and the unprecedented words at a non-coincidental time: when the talks for the ceasefire in Doha resume.\nAs mentioned, Hamas also pulls out Abu Obaida's tweets near the hour of the talks in Doha.\n\nAt the same time, the Americans, Hezbollah, the Iranians, the Western countries are all pressuring Israel in one direction...\nI don't envy the decision makers in Israel."}, {"id": "d4b1ff46-bf40-4e57-843e-5f2f5bf3d03f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32467/", "date": "2024-08-15 13:42", "message": "Abu Mazen, chairman of the Palestinian Authority, in a speech before the Turkish parliament:\n\nI decided to come together with all the members of the Palestinian leadership to the Gaza Strip.\nI call on the UN Security Council to secure my visit to Gaza.\nAfter Gaza I will go to Jerusalem.\nVictory or Martyrdom...\n\n##\nThey promised yesterday that there would be an extraordinary speech..."}, {"id": "21895b30-0098-49aa-b624-4a50e8e4c057", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32464/", "date": "2024-08-15 12:20", "message": "The security mechanisms of the Palestinian Authority in Nablus are holding a military funeral for the two terrorists whom the IDF eliminated from the air in the early morning in the Balata refugee camp in Nablus.\nOne of them was an operative of the military wing of Hamas who was released from Israeli prison in a deal with Hamas last November."}, {"id": "48ab6a35-69c1-4ad0-8565-e73874dc1d8f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32463/", "date": "2024-08-15 12:19", "message": "Third tweet in five days by Abu Obaida, the spokesman for the military wing of Hamas.\nThe tweet itself, like its predecessor, is a transparent tweet of psychological warfare in preparation for the ceasefire talks in Doha, with the aim of exerting pressure on the Israeli side.\nIn my opinion, the IDF spokesman was wrong to refer last time to the content of the tweet as something that is even worth looking at.\n\nI will also mention two interesting facts:\n\n1. Abu Obaida only tweets and does not appear in video or voice. Something that anyone with access to the user account can do. The last time a sign of life was received from him was at the beginning of July.\n\n2. Abu Obaida tweeted 3 times since the assassination of Haniyeh but did not refer to the assassination or Haniyeh at all."}, {"id": "8753020a-b404-4088-a5c0-904f40d3dcb7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32462/", "date": "2024-08-15 12:17", "message": "Naim Qassem, Nasrallah's deputy:\nThe visit of the American envoy Amos Hochstein to Beirut was merely a show. He brought nothing with him and there are no concrete American proposals. The US wants to show that it is working, but everything is in the empty space... there still no direction..."}, {"id": "82753921-6918-404b-b1d5-46ae07c2e544", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32461/", "date": "2024-08-15 12:15", "message": "The Palestinian Ministry of Health in Gaza reports 40 deaths in the last day in the Strip, bringing the number of deaths in the Strip since the beginning of the war to 40,005."}, {"id": "864f6088-bbff-46be-87a3-14ffd0b518d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32460/", "date": "2024-08-15 12:14", "message": "Iranian news agency Fars:\nColonel (equivalent to Colonel) Ahmad Reza Afshari, an Iranian adviser from the Air and Space Forces in the Iranian Revolutionary Guards, died today in Iran.\n\nHe was injured in an American attack in Syria in the last two weeks in northeastern Syria and was transferred to Iran for treatment, where he died of his wounds."}, {"id": "febad3c1-c806-4d6c-8b7d-63a02fcf0bc3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32458/", "date": "2024-08-15 09:43", "message": "The body of Ahmed Sheikh Khalil, the terrorist who was killed by the IDF tonight in a drone attack in the Balata refugee camp in Nablus, is wrapped in the flags of the Fatah movement, next to his M-16 rifle."}, {"id": "92a76a08-af0a-4dd4-b62e-a9698981bd53", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32457/", "date": "2024-08-15 09:42", "message": "Palestinian channels published Israeli documentation of the new state of the Rafah crossing with the caption in Hebrew blurred... a few meters from the Egyptian flag."}, {"id": "5832a323-7d3e-4904-b16e-2160f54934c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32456/", "date": "2024-08-15 08:38", "message": "The IDF spokesman in Arabic published a short time ago another evacuation notice for the residents of a-Satar neighborhood and the Qarara area west of the Salah al-Din axis in Khan Yunis in the southern Gaza Strip.\n\nAccording to the IDF spokesperson, the reason for the evacuation is Hamas rocket fire from this area."}, {"id": "e979fb40-04be-4bea-8e77-d95e16d85def", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32455/", "date": "2024-08-15 08:37", "message": "New York: Anti-Israel protesters are celebrating the resignation of Nemat Shafik, president of Columbia University, over her performance during a protest against Israel on campus.\n\nShe lost on both sides:\nHamas supporters are outraged that the administration brought the police into the campus and suppressed the protest by force.\nSupporters of Israel are outraged that she allowed such an anti-Semitic protest to spread in the first place."}, {"id": "fa5c24ba-bd0b-4858-a64e-b441f7fc62f0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32454/", "date": "2024-08-15 08:35", "message": "Even after the IDF spokesperson officially announced the assassination of Muhammad Deif, senior Hamas official Osama Hamdan claims yesterday that Muhammad Deif is safe and sound and that the announcement by the IDF spokesman was only intended to justify the great slaughter that Israel carried out in the attack."}, {"id": "150a23c3-eeb0-4666-8c1a-710a6c2ae3ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32453/", "date": "2024-08-15 07:32", "message": "The Lebanese government has approved the recruitment of 6,000 soldiers to the Lebanese army, of which 1,500 will be recruited in the first phase - in order to implement resolution 1701 (from the end of the Second Lebanon War, according to which the Lebanese army will be deployed in southern Lebanon and enforce the non-introduction of weapons into the region)."}, {"id": "84ea74e4-0d54-4ad2-89ae-aa176b4b0be6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32452/", "date": "2024-08-15 06:42", "message": "Optimism in Lebanon\n\nThe newspaper Al-Sharq Al-Awsat from Nabieh Berri, the speaker of the Lebanese parliament and the chairperson of the Shia Amal movement, after he met yesterday with the American envoy Amos Hochstein:\nThe situation today is better than it was yesterday."}, {"id": "7888f8ba-7db7-4fc0-9728-c1a43861e026", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32446/", "date": "2024-08-15 06:40", "message": "Today Israel allowed 11 Gazan children to go to Jordan for medical treatment."}, {"id": "e1d6fce8-de99-4687-afc0-46468b59c8c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32445/", "date": "2024-08-15 06:39", "message": "In this context, I will mention Trump's promise number 18, if he is elected:\nDeporting Hamas supporters and making US colleges safe and patriotic."}, {"id": "524d88e7-05f6-4445-8d95-ef91aab40a03", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32444/", "date": "2024-08-15 06:37", "message": "Nemat Shafik, the president of Columbia University in New York resigned in the wake of the student protests in favor of Hamas and against Israel this year."}, {"id": "c1a463fa-625b-423b-838b-b31f081d2af2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32443/", "date": "2024-08-15 06:34", "message": "Documentation of the terrorist Wael Masha👆, who was killed tonight in a UAV attack in the Balata refugee camp in Nablus, shortly after his release in a deal in November.\nMasha sings with great enthusiasm the praise of Muhammad Deif and the praise of the Izz ad-Din al-Qassam Brigades, the military arm of Hamas."}, {"id": "03be7377-221f-4ec8-a00a-5df5f167e416", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32442/", "date": "2024-08-15 06:32", "message": "Wael Masha (circled in red), 18 years old, who was killed last night, is an operative of the military wing of Hamas, who was released in the hostage deal with Hamas last November.\nIn the picture here, next to him, appears his friend, the terrorist Tarek Daud (green circle), who was killed by a short-range shot in Qalqilya a few days ago after seriously wounding an Israeli in a shooting attack.\n\n##\nThe other side of the hostage release deal."}, {"id": "d0e6567a-68e5-4548-ac33-ad73a51491cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32440/", "date": "2024-08-15 06:32", "message": "Hezbollah reported two deaths in its ranks last night:\n\nHussein Sheitu\nMuhammad Badr al-Din\n\nThey were eliminated in the IDF attacks yesterday (when he was eliminated as such in an attack in the village of Balida and Badr al-Din was apparently eliminated in an attack in Marja'ion).\n\n411 deaths for Hezbollah since the beginning of the war (out of about 550 deaths in Lebanon since the beginning of the war according to the Lebanese Ministry of Health)."}]